zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_bus.h
/**
  ******************************************************************************
  * @file    stm32mp2xx_ll_bus.h
  * @author  MCD Application Team
  * @version $VERSION$
  * @date    $DATE$
  * @brief   Header file of BUS LL module.

  @verbatim
                      ##### RCC Limitations #####
  ==============================================================================
    [..]
      A delay between an RCC peripheral clock enable and the effective peripheral
      enabling should be taken into account in order to manage the peripheral read/write
      from/to registers.
      (+) This delay depends on the peripheral mapping.
        (++) AHB & APB peripherals, 1 dummy read is necessary

    [..]
      Workarounds:
      (#) For AHB & APB peripherals, a dummy read to the peripheral register has been
          inserted in each LL_{BUS}_GRP{x}_EnableClock() function.

  @endverbatim
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */


/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32MP2xx_LL_BUS_H
#define STM32MP2xx_LL_BUS_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx.h"

/** @addtogroup STM32MP2xx_LL_Driver
  * @{
  */

#if defined(RCC)
/** @defgroup BUS_LL BUS
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/

/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/

/* Exported constants --------------------------------------------------------*/

/* Exported macro ------------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/
/** @defgroup BUS_LL_Exported_Functions BUS Exported Functions
  * @{
  */

/** @defgroup BUS_LL_EF_AHB2 AHB2
  * @{
  */

/**
  * @brief  Enable HPDMA1  peripheral clock
  * @rmtoll HPDMA1         HPDMA1EN         LL_RCC_HPDMA1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HPDMA1_EnableClock(void)
{
  SET_BIT(RCC->HPDMA1CFGR, RCC_HPDMA1CFGR_HPDMA1EN);
}

/**
  * @brief  Enable HPDMA2  peripheral clock
  * @rmtoll HPDMA2         HPDMA2EN         LL_RCC_HPDMA2_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HPDMA2_EnableClock(void)
{
  SET_BIT(RCC->HPDMA2CFGR, RCC_HPDMA2CFGR_HPDMA2EN);
}

/**
  * @brief  Enable HPDMA3  peripheral clock
  * @rmtoll HPDMA3         HPDMA3EN         LL_RCC_HPDMA3_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HPDMA3_EnableClock(void)
{
  SET_BIT(RCC->HPDMA3CFGR, RCC_HPDMA3CFGR_HPDMA3EN);
}

#if defined(RCC_ADC1CFGR_ADC1EN) || defined(RCC_ADC2CFGR_ADC2EN)
/**
  * @brief  Enable ADC1  peripheral clock
  * @rmtoll ADC1         ADC1EN         LL_RCC_ADC1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC1_EnableClock(void)
{
  SET_BIT(RCC->ADC1CFGR, RCC_ADC1CFGR_ADC1EN);
}

/**
  * @brief  Enable ADC2  peripheral clock
  * @rmtoll ADC2         ADC2EN         LL_RCC_ADC2_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC2_EnableClock(void)
{
  SET_BIT(RCC->ADC2CFGR, RCC_ADC2CFGR_ADC2EN);
}
#endif /* RCC_ADC1CFGR_ADC1EN || RCC_ADC2CFGR_ADC2EN*/

#if defined(RCC_ADC3CFGR_ADC3EN)
/**
  * @brief  Enable ADC3  peripheral clock
  * @rmtoll ADC3         ADC3EN         LL_RCC_ADC3_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC3_EnableClock(void)
{
  SET_BIT(RCC->ADC3CFGR, RCC_ADC3CFGR_ADC3EN);
}
#endif /* RCC_ADC3CFGR_ADC3EN */

#if defined(RCC_ADC12CFGR_ADC12EN)
/**
  * @brief  Enable ADC12  peripheral clock
  * @rmtoll ADC12         ADC12EN         LL_RCC_ADC12_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC12_EnableClock(void)
{
  SET_BIT(RCC->ADC12CFGR, RCC_ADC12CFGR_ADC12EN);
}
#endif /* RCC_ADC12CFGR_ADC12EN */

/**
  * @brief  Enable MDF1  peripheral clock
  * @rmtoll MDF1         MDF1EN         LL_RCC_MDF1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MDF1_EnableClock(void)
{
  SET_BIT(RCC->MDF1CFGR, RCC_MDF1CFGR_MDF1EN);
}

/**
  * @brief  Enable IPCC1  peripheral clock
  * @rmtoll IPCC1         IPCC1EN         LL_RCC_IPCC1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IPCC1_EnableClock(void)
{
  SET_BIT(RCC->IPCC1CFGR, RCC_IPCC1CFGR_IPCC1EN);
}

#if defined(RCC_DCMIPSSICFGR_DCMIPSSIEN)
/**
  * @brief  Enable DCMIPSSI  peripheral clock
  * @rmtoll DCMIPSSI         DCMIPSSIEN         LL_RCC_DCMIPSSI_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DCMIPSSI_EnableClock(void)
{
  SET_BIT(RCC->DCMIPSSICFGR, RCC_DCMIPSSICFGR_DCMIPSSIEN);
}
#endif /* RCC_DCMIPSSICFGR_DCMIPSSIEN */

/**
  * @brief  Enable DCMIPP  peripheral clock
  * @rmtoll DCMIPP         DCMIPPEN         LL_RCC_DCMIPP_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DCMIPP_EnableClock(void)
{
  SET_BIT(RCC->DCMIPPCFGR, RCC_DCMIPPCFGR_DCMIPPEN);
}

/**
  * @brief  Enable CRC  peripheral clock
  * @rmtoll CRC         CRCEN         LL_RCC_CRC_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CRC_EnableClock(void)
{
  SET_BIT(RCC->CRCCFGR, RCC_CRCCFGR_CRCEN);
}

/**
  * @brief  Disable HPDMA1  peripheral clock
  * @rmtoll HPDMA1         HPDMA1EN         LL_RCC_HPDMA1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HPDMA1_DisableClock(void)
{
  CLEAR_BIT(RCC->HPDMA1CFGR, RCC_HPDMA1CFGR_HPDMA1EN);
}

/**
  * @brief  Disable HPDMA2  peripheral clock
  * @rmtoll HPDMA2         HPDMA2EN         LL_RCC_HPDMA2_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HPDMA2_DisableClock(void)
{
  CLEAR_BIT(RCC->HPDMA2CFGR, RCC_HPDMA2CFGR_HPDMA2EN);
}

/**
  * @brief  Disable HPDMA3  peripheral clock
  * @rmtoll HPDMA3         HPDMA3EN         LL_RCC_HPDMA3_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HPDMA3_DisableClock(void)
{
  CLEAR_BIT(RCC->HPDMA3CFGR, RCC_HPDMA3CFGR_HPDMA3EN);
}

#if defined(RCC_ADC1CFGR_ADC1EN) || defined(RCC_ADC2CFGR_ADC2EN)
/**
  * @brief  Disable ADC1  peripheral clock
  * @rmtoll ADC1         ADC1EN         LL_RCC_ADC1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC1_DisableClock(void)
{
  CLEAR_BIT(RCC->ADC1CFGR, RCC_ADC1CFGR_ADC1EN);
}

/**
  * @brief  Disable ADC2  peripheral clock
  * @rmtoll ADC2         ADC2EN         LL_RCC_ADC2_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC2_DisableClock(void)
{
  CLEAR_BIT(RCC->ADC2CFGR, RCC_ADC2CFGR_ADC2EN);
}
#endif /* RCC_ADC1CFGR_ADC1EN || RCC_ADC2CFGR_ADC2EN*/

