zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_bus.h
#if defined(RCC_ADC3CFGR_ADC3EN)
/**
  * @brief  Disable ADC3  peripheral clock
  * @rmtoll ADC3         ADC3EN         LL_RCC_ADC3_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC3_DisableClock(void)
{
  CLEAR_BIT(RCC->ADC3CFGR, RCC_ADC3CFGR_ADC3EN);
}
#endif /* RCC_ADC3CFGR_ADC3EN */

#if defined(RCC_ADC12CFGR_ADC12EN)
/**
  * @brief  Disable ADC12  peripheral clock
  * @rmtoll ADC12         ADC12EN         LL_RCC_ADC12_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC12_DisableClock(void)
{
  CLEAR_BIT(RCC->ADC12CFGR, RCC_ADC12CFGR_ADC12EN);
}
#endif /* RCC_ADC12CFGR_ADC12EN */

/**
  * @brief  Disable MDF1  peripheral clock
  * @rmtoll MDF1         MDF1EN         LL_RCC_MDF1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MDF1_DisableClock(void)
{
  CLEAR_BIT(RCC->MDF1CFGR, RCC_MDF1CFGR_MDF1EN);
}

/**
  * @brief  Disable IPCC1  peripheral clock
  * @rmtoll IPCC1         IPCC1EN         LL_RCC_IPCC1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IPCC1_DisableClock(void)
{
  CLEAR_BIT(RCC->IPCC1CFGR, RCC_IPCC1CFGR_IPCC1EN);
}

#if defined(RCC_DCMIPSSICFGR_DCMIPSSIEN)
/**
  * @brief  Disable DCMIPSSI  peripheral clock
  * @rmtoll DCMIPSSI         DCMIPSSIEN         LL_RCC_DCMIPSSI_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DCMIPSSI_DisableClock(void)
{
  CLEAR_BIT(RCC->DCMIPSSICFGR, RCC_DCMIPSSICFGR_DCMIPSSIEN);
}
#endif /* RCC_DCMIPSSICFGR_DCMIPSSIEN */

/**
  * @brief  Disable DCMIPP  peripheral clock
  * @rmtoll DCMIPP         DCMIPPEN         LL_RCC_DCMIPP_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DCMIPP_DisableClock(void)
{
  CLEAR_BIT(RCC->DCMIPPCFGR, RCC_DCMIPPCFGR_DCMIPPEN);
}

/**
  * @brief  Disable CRC  peripheral clock
  * @rmtoll CRC         CRCEN         LL_RCC_CRC_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CRC_DisableClock(void)
{
  CLEAR_BIT(RCC->CRCCFGR, RCC_CRCCFGR_CRCEN);
}

/**
  * @brief  Enable HPDMA1 peripheral clocks enable during CSleep mode
  * @rmtoll HPDMA1         HPDMA1LPEN         LL_RCC_HPDMA1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HPDMA1_EnableClockSleep(void)
{
  SET_BIT(RCC->HPDMA1CFGR, RCC_HPDMA1CFGR_HPDMA1LPEN);
}

/**
  * @brief  Enable HPDMA2 peripheral clocks enable during CSleep mode
  * @rmtoll HPDMA2         HPDMA2LPEN         LL_RCC_HPDMA2_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HPDMA2_EnableClockSleep(void)
{
  SET_BIT(RCC->HPDMA2CFGR, RCC_HPDMA2CFGR_HPDMA2LPEN);
}

/**
  * @brief  Enable HPDMA3 peripheral clocks enable during CSleep mode
  * @rmtoll HPDMA3         HPDMA3LPEN         LL_RCC_HPDMA3_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HPDMA3_EnableClockSleep(void)
{
  SET_BIT(RCC->HPDMA3CFGR, RCC_HPDMA3CFGR_HPDMA3LPEN);
}

#if defined(RCC_ADC1CFGR_ADC1LPEN) || defined(RCC_ADC2CFGR_ADC2LPEN)
/**
  * @brief  Enable ADC1 peripheral clocks enable during CSleep mode
  * @rmtoll ADC1         ADC1LPEN         LL_RCC_ADC1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC1_EnableClockSleep(void)
{
  SET_BIT(RCC->ADC1CFGR, RCC_ADC1CFGR_ADC1LPEN);
}

/**
  * @brief  Enable ADC2 peripheral clocks enable during CSleep mode
  * @rmtoll ADC2         ADC2LPEN         LL_RCC_ADC2_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC2_EnableClockSleep(void)
{
  SET_BIT(RCC->ADC2CFGR, RCC_ADC2CFGR_ADC2LPEN);
}
#endif /* RCC_ADC1CFGR_ADC1LPEN || RCC_ADC2CFGR_ADC2LPEN*/

#if defined(RCC_ADC3CFGR_ADC3LPEN)
/**
  * @brief  Enable ADC3 peripheral clocks enable during CSleep mode
  * @rmtoll ADC3         ADC3LPEN         LL_RCC_ADC3_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC3_EnableClockSleep(void)
{
  SET_BIT(RCC->ADC3CFGR, RCC_ADC3CFGR_ADC3LPEN);
}
#endif /* RCC_ADC3CFGR_ADC3LPEN */

#if defined(RCC_ADC12CFGR_ADC12LPEN)
/**
  * @brief  Enable ADC12 peripheral clocks enable during CSleep mode
  * @rmtoll ADC12         ADC12LPEN         LL_RCC_ADC12_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC12_EnableClockSleep(void)
{
  SET_BIT(RCC->ADC12CFGR, RCC_ADC12CFGR_ADC12LPEN);
}
#endif /* RCC_ADC12CFGR_ADC12LPEN */

/**
  * @brief  Enable MDF1 peripheral clocks enable during CSleep mode
  * @rmtoll MDF1         MDF1LPEN         LL_RCC_MDF1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MDF1_EnableClockSleep(void)
{
  SET_BIT(RCC->MDF1CFGR, RCC_MDF1CFGR_MDF1LPEN);
}

/**
  * @brief  Enable IPCC1 peripheral clocks enable during CSleep mode
  * @rmtoll IPCC1         IPCC1LPEN         LL_RCC_IPCC1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IPCC1_EnableClockSleep(void)
{
  SET_BIT(RCC->IPCC1CFGR, RCC_IPCC1CFGR_IPCC1LPEN);
}

/**
  * @brief  Enable DCMIPP peripheral clocks enable during CSleep mode
  * @rmtoll DCMIPP         DCMIPPLPEN         LL_RCC_DCMIPP_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DCMIPP_EnableClockSleep(void)
{
  SET_BIT(RCC->DCMIPPCFGR, RCC_DCMIPPCFGR_DCMIPPLPEN);
}

#if defined(RCC_DCMIPSSICFGR_DCMIPSSILPEN)
/**
  * @brief  Enable DCMIPSSI peripheral clocks enable during CSleep mode
  * @rmtoll DCMIPSSI         DCMIPSSILPEN         LL_RCC_DCMIPSSI_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DCMIPSSI_EnableClockSleep(void)
{
  SET_BIT(RCC->DCMIPSSICFGR, RCC_DCMIPSSICFGR_DCMIPSSILPEN);
}
#endif /* RCC_DCMIPSSICFGR_DCMIPSSILPEN */

/**
  * @brief  Enable CRC peripheral clocks enable during CSleep mode
  * @rmtoll CRC         CRCLPEN         LL_RCC_CRC_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CRC_EnableClockSleep(void)
{
  SET_BIT(RCC->CRCCFGR, RCC_CRCCFGR_CRCLPEN);
}

/**
  * @brief  Disable HPDMA1 peripheral clocks during CSleep mode
  * @rmtoll HPDMA1         HPDMA1LPEN         LL_RCC_HPDMA1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HPDMA1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->HPDMA1CFGR, RCC_HPDMA1CFGR_HPDMA1LPEN);
}

/**
  * @brief  Disable HPDMA2 peripheral clocks during CSleep mode
  * @rmtoll HPDMA2         HPDMA2LPEN         LL_RCC_HPDMA2_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HPDMA2_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->HPDMA2CFGR, RCC_HPDMA2CFGR_HPDMA2LPEN);
}

/**
  * @brief  Disable HPDMA3 peripheral clocks during CSleep mode
  * @rmtoll HPDMA3         HPDMA3LPEN         LL_RCC_HPDMA3_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HPDMA3_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->HPDMA3CFGR, RCC_HPDMA3CFGR_HPDMA3LPEN);
}

#if defined(RCC_ADC1CFGR_ADC1LPEN) || defined(RCC_ADC2CFGR_ADC2LPEN)
/**
  * @brief  Disable ADC1 peripheral clocks during CSleep mode
  * @rmtoll ADC1         ADC1LPEN         LL_RCC_ADC1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->ADC1CFGR, RCC_ADC1CFGR_ADC1LPEN);
}


/**
  * @brief  Disable ADC2 peripheral clocks during CSleep mode
  * @rmtoll ADC2         ADC2LPEN         LL_RCC_ADC2_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC2_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->ADC2CFGR, RCC_ADC2CFGR_ADC2LPEN);
}
#endif /* RCC_ADC1CFGR_ADC1LPEN || RCC_ADC2CFGR_ADC2LPEN */

#if defined(RCC_ADC3CFGR_ADC3LPEN) || defined(RCC_ADC12CFGR_ADC12LPEN)
/**
  * @brief  Disable ADC3 peripheral clocks during CSleep mode
  * @rmtoll ADC3         ADC3LPEN         LL_RCC_ADC3_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC3_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->ADC3CFGR, RCC_ADC3CFGR_ADC3LPEN);
}

/**
  * @brief  Disable ADC12 peripheral clocks during CSleep mode
  * @rmtoll ADC12         ADC12LPEN         LL_RCC_ADC12_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC12_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->ADC12CFGR, RCC_ADC12CFGR_ADC12LPEN);
}
#endif /* RCC_ADC3CFGR_ADC3LPEN || RCC_ADC12CFGR_ADC12LPEN */
/**
  * @brief  Disable MDF1 peripheral clocks during CSleep mode
  * @rmtoll MDF1         MDF1LPEN         LL_RCC_MDF1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MDF1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->MDF1CFGR, RCC_MDF1CFGR_MDF1LPEN);
}

/**
  * @brief  Disable IPCC1 peripheral clocks during CSleep mode
  * @rmtoll IPCC1         IPCC1LPEN         LL_RCC_IPCC1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IPCC1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->IPCC1CFGR, RCC_IPCC1CFGR_IPCC1LPEN);
}

/**
  * @brief  Disable DCMIPP peripheral clocks during CSleep mode
  * @rmtoll DCMIPP         DCMIPPLPEN         LL_RCC_DCMIPP_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DCMIPP_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->DCMIPPCFGR, RCC_DCMIPPCFGR_DCMIPPLPEN);
}

