zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_bus.h
#if defined(RCC_DCMIPSSICFGR_DCMIPSSILPEN)
/**
  * @brief  Disable DCMIPSSI peripheral clocks during CSleep mode
  * @rmtoll DCMIPSSI         DCMIPSSILPEN         LL_RCC_DCMIPSSI_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DCMIPSSI_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->DCMIPSSICFGR, RCC_DCMIPSSICFGR_DCMIPSSILPEN);
}
#endif /* RCC_DCMIPSSICFGR_DCMIPSSILPEN */

/**
  * @brief  Disable CRC peripheral clocks during CSleep mode
  * @rmtoll CRC         CRCLPEN         LL_RCC_CRC_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CRC_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->CRCCFGR, RCC_CRCCFGR_CRCLPEN);
}

/**
  * @brief  Assert HPDMA1 reset
  * @rmtoll HPDMA1         HPDMA1RST         LL_RCC_HPDMA1_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HPDMA1_ForceReset(void)
{
  SET_BIT(RCC->HPDMA1CFGR, RCC_HPDMA1CFGR_HPDMA1RST);
}

/**
  * @brief  Assert HPDMA2 reset
  * @rmtoll HPDMA2         HPDMA2RST         LL_RCC_HPDMA2_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HPDMA2_ForceReset(void)
{
  SET_BIT(RCC->HPDMA2CFGR, RCC_HPDMA2CFGR_HPDMA2RST);
}

/**
  * @brief  Assert HPDMA3 reset
  * @rmtoll HPDMA3         HPDMA3RST         LL_RCC_HPDMA3_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HPDMA3_ForceReset(void)
{
  SET_BIT(RCC->HPDMA3CFGR, RCC_HPDMA3CFGR_HPDMA3RST);
}

#if defined(RCC_ADC1CFGR_ADC1RST) || defined(RCC_ADC2CFGR_ADC2RST)
/**
  * @brief  Assert ADC1 reset
  * @rmtoll ADC1         ADC1RST         LL_RCC_ADC1_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC1_ForceReset(void)
{
  SET_BIT(RCC->ADC1CFGR, RCC_ADC1CFGR_ADC1RST);
}

/**
  * @brief  Assert ADC2 reset
  * @rmtoll ADC2         ADC2RST         LL_RCC_ADC2_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC2_ForceReset(void)
{
  SET_BIT(RCC->ADC2CFGR, RCC_ADC2CFGR_ADC2RST);
}
#endif /* RCC_ADC1CFGR_ADC1RST || RCC_ADC2CFGR_ADC2RST*/

#if defined(RCC_ADC3CFGR_ADC3RST) || defined(RCC_ADC12CFGR_ADC12RST)
/**
  * @brief  Assert ADC3 reset
  * @rmtoll ADC3         ADC3RST         LL_RCC_ADC3_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC3_ForceReset(void)
{
  SET_BIT(RCC->ADC3CFGR, RCC_ADC3CFGR_ADC3RST);
}

/**
  * @brief  Assert ADC12 reset
  * @rmtoll ADC12         ADC12RST         LL_RCC_ADC12_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC12_ForceReset(void)
{
  SET_BIT(RCC->ADC12CFGR, RCC_ADC12CFGR_ADC12RST);
}
#endif /* RCC_ADC3CFGR_ADC3RST ||  RCC_ADC12CFGR_ADC12RST */

/**
  * @brief  Assert MDF1 reset
  * @rmtoll MDF1         MDF1RST         LL_RCC_MDF1_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MDF1_ForceReset(void)
{
  SET_BIT(RCC->MDF1CFGR, RCC_MDF1CFGR_MDF1RST);
}

/**
  * @brief  Assert IPCC1 reset
  * @rmtoll IPCC1         IPCC1RST         LL_RCC_IPCC1_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IPCC1_ForceReset(void)
{
  SET_BIT(RCC->IPCC1CFGR, RCC_IPCC1CFGR_IPCC1RST);
}

/**
  * @brief  Assert DCMIPP reset
  * @rmtoll DCMIPP         DCMIPPRST         LL_RCC_DCMIPP_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DCMIPP_ForceReset(void)
{
  SET_BIT(RCC->DCMIPPCFGR, RCC_DCMIPPCFGR_DCMIPPRST);
}

#if defined(RCC_DCMIPSSICFGR_DCMIPSSIRST)
/**
  * @brief  Assert DCMIPSSI reset
  * @rmtoll DCMIPSSI         DCMIPSSIRST         LL_RCC_DCMIPSSI_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DCMIPSSI_ForceReset(void)
{
  SET_BIT(RCC->DCMIPSSICFGR, RCC_DCMIPSSICFGR_DCMIPSSIRST);
}
#endif /* RCC_DCMIPSSICFGR_DCMIPSSIRST */

/**
  * @brief  Assert CRC reset
  * @rmtoll CRC         CRCRST         LL_RCC_CRC_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CRC_ForceReset(void)
{
  SET_BIT(RCC->CRCCFGR, RCC_CRCCFGR_CRCRST);
}

/**
  * @brief  Release HPDMA1 reset
  * @rmtoll HPDMA1         HPDMA1RST         LL_RCC_HPDMA1_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HPDMA1_ReleaseReset(void)
{
  CLEAR_BIT(RCC->HPDMA1CFGR, RCC_HPDMA1CFGR_HPDMA1RST);
}

/**
  * @brief  Release HPDMA2 reset
  * @rmtoll HPDMA2         HPDMA2RST         LL_RCC_HPDMA2_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HPDMA2_ReleaseReset(void)
{
  CLEAR_BIT(RCC->HPDMA2CFGR, RCC_HPDMA2CFGR_HPDMA2RST);
}

/**
  * @brief  Release HPDMA3 reset
  * @rmtoll HPDMA3         HPDMA3RST         LL_RCC_HPDMA3_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HPDMA3_ReleaseReset(void)
{
  CLEAR_BIT(RCC->HPDMA3CFGR, RCC_HPDMA3CFGR_HPDMA3RST);
}

#if defined(RCC_ADC1CFGR_ADC1RST) || defined(RCC_ADC2CFGR_ADC2RST)
/**
  * @brief  Release ADC1 reset
  * @rmtoll ADC1         ADC1RST         LL_RCC_ADC1_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC1_ReleaseReset(void)
{
  CLEAR_BIT(RCC->ADC1CFGR, RCC_ADC1CFGR_ADC1RST);
}

/**
  * @brief  Release ADC2 reset
  * @rmtoll ADC2         ADC2RST         LL_RCC_ADC2_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC2_ReleaseReset(void)
{
  CLEAR_BIT(RCC->ADC2CFGR, RCC_ADC2CFGR_ADC2RST);
}
#endif /* RCC_ADC1CFGR_ADC1RST || RCC_ADC2CFGR_ADC2RST */

#if defined(RCC_ADC3CFGR_ADC3RST) || defined(RCC_ADC12CFGR_ADC12RST)
/**
  * @brief  Release ADC3 reset
  * @rmtoll ADC3         ADC3RST         LL_RCC_ADC3_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC3_ReleaseReset(void)
{
  CLEAR_BIT(RCC->ADC3CFGR, RCC_ADC3CFGR_ADC3RST);
}

/**
  * @brief  Release ADC12 reset
  * @rmtoll ADC12         ADC12RST         LL_RCC_ADC12_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADC12_ReleaseReset(void)
{
  CLEAR_BIT(RCC->ADC12CFGR, RCC_ADC12CFGR_ADC12RST);
}
#endif /* RCC_ADC3CFGR_ADC3RST || RCC_ADC12CFGR_ADC12RST */

/**
  * @brief  Release MDF1 reset
  * @rmtoll MDF1         MDF1RST         LL_RCC_MDF1_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MDF1_ReleaseReset(void)
{
  CLEAR_BIT(RCC->MDF1CFGR, RCC_MDF1CFGR_MDF1RST);
}

/**
  * @brief  Release IPCC1 reset
  * @rmtoll IPCC1         IPCC1RST         LL_RCC_IPCC1_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IPCC1_ReleaseReset(void)
{
  CLEAR_BIT(RCC->IPCC1CFGR, RCC_IPCC1CFGR_IPCC1RST);
}

/**
  * @brief  Release DCMIPP reset
  * @rmtoll DCMIPP         DCMIPPRST         LL_RCC_DCMIPP_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DCMIPP_ReleaseReset(void)
{
  CLEAR_BIT(RCC->DCMIPPCFGR, RCC_DCMIPPCFGR_DCMIPPRST);
}

#if defined(RCC_DCMIPSSICFGR_DCMIPSSIRST)
/**
  * @brief  Release DCMIPSSI reset
  * @rmtoll DCMIPSSI         DCMIPSSIRST         LL_RCC_DCMIPSSI_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DCMIPSSI_ReleaseReset(void)
{
  CLEAR_BIT(RCC->DCMIPSSICFGR, RCC_DCMIPSSICFGR_DCMIPSSIRST);
}
#endif /* RCC_DCMIPSSICFGR_DCMIPSSIRST */

/**
  * @brief  Release CRC reset
  * @rmtoll CRC         CRCRST         LL_RCC_CRC_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CRC_ReleaseReset(void)
{
  CLEAR_BIT(RCC->CRCCFGR, RCC_CRCCFGR_CRCRST);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_AHB3 AHB3
  * @{
  */
/**
  * @brief  Enable SYSRAM  peripheral clock
  * @rmtoll SYSRAM         SYSRAMEN         LL_RCC_SYSRAM_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SYSRAM_EnableClock(void)
{
  SET_BIT(RCC->SYSRAMCFGR, RCC_SYSRAMCFGR_SYSRAMEN);
}

/**
  * @brief  Enable PKA  peripheral clock
  * @rmtoll PKA         PKAEN         LL_RCC_PKA_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PKA_EnableClock(void)
{
  SET_BIT(RCC->PKACFGR, RCC_PKACFGR_PKAEN);
}

/**
  * @brief  Enable SAES  peripheral clock
  * @rmtoll SAES         SAESEN         LL_RCC_SAES_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAES_EnableClock(void)
{
  SET_BIT(RCC->SAESCFGR, RCC_SAESCFGR_SAESEN);
}
#if defined(RCC_CRYP2CFGR_CRYP2EN)
/**
  * @brief  Enable CRYP2  peripheral clock
  * @rmtoll CRYP2         CRYP2EN         LL_RCC_CRYP2_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CRYP2_EnableClock(void)
{
  SET_BIT(RCC->CRYP2CFGR, RCC_CRYP2CFGR_CRYP2EN);
}
#endif /* RCC_CRYP2CFGR_CRYP2EN */

#if defined(RCC_CRYP1CFGR_CRYP1EN)
/**
  * @brief  Enable CRYP1  peripheral clock
  * @rmtoll CRYP1         CRYP1EN         LL_RCC_CRYP1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CRYP1_EnableClock(void)
{
  SET_BIT(RCC->CRYP1CFGR, RCC_CRYP1CFGR_CRYP1EN);
}
#endif /* RCC_CRYP1CFGR_CRYP1EN */
#if defined(RCC_RNGCFGR_RNGEN)
/**
  * @brief  Enable RNG  peripheral clock
  * @rmtoll RNG         RNGEN         LL_RCC_RNG_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RNG_EnableClock(void)
{
  SET_BIT(RCC->RNGCFGR, RCC_RNGCFGR_RNGEN);
}
#endif /* RCC_RNGCFGR_RNGEN */

#if defined(RCC_RNG1CFGR_RNG1EN) || defined(RCC_RNG2CFGR_RNG2EN)
/**
  * @brief  Enable RNG1  peripheral clock
  * @rmtoll RNG1         RNG1EN         LL_RCC_RNG1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RNG1_EnableClock(void)
{
  SET_BIT(RCC->RNG1CFGR, RCC_RNG1CFGR_RNG1EN);
}

/**
  * @brief  Enable RNG2  peripheral clock
  * @rmtoll RNG2         RNG2EN         LL_RCC_RNG2_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RNG2_EnableClock(void)
{
  SET_BIT(RCC->RNG2CFGR, RCC_RNG2CFGR_RNG2EN);
}
#endif /* RCC_RNG1CFGR_RNG1EN || RCC_RNG2CFGR_RNG2EN */

#if defined(RCC_HASHCFGR_HASHEN)
/**
  * @brief  Enable HASH  peripheral clock
  * @rmtoll HASH         HASHEN         LL_RCC_HASH_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HASH_EnableClock(void)
{
  SET_BIT(RCC->HASHCFGR, RCC_HASHCFGR_HASHEN);
}
#endif /* RCC_HASHCFGR_HASHEN */

#if defined(RCC_HASH1CFGR_HASH1EN) || defined(RCC_HASH2CFGR_HASH2EN)
/**
  * @brief  Enable HASH1  peripheral clock
  * @rmtoll HASH1         HASH1EN         LL_RCC_HASH1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HASH1_EnableClock(void)
{
  SET_BIT(RCC->HASH1CFGR, RCC_HASH1CFGR_HASH1EN);
}

/**
  * @brief  Enable HASH2  peripheral clock
  * @rmtoll HASH2         HASH2EN         LL_RCC_HASH2_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HASH2_EnableClock(void)
{
  SET_BIT(RCC->HASH2CFGR, RCC_HASH2CFGR_HASH2EN);
}
#endif /* RCC_HASH1CFGR_HASH1EN  || RCC_HASH2CFGR_HASH2EN*/

/**
  * @brief  Enable BKPSRAM  peripheral clock
  * @rmtoll BKPSRAM         BKPSRAMEN         LL_RCC_BKPSRAM_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_BKPSRAM_EnableClock(void)
{
  SET_BIT(RCC->BKPSRAMCFGR, RCC_BKPSRAMCFGR_BKPSRAMEN);
}

/**
  * @brief  Disable SYSRAM  peripheral clock
  * @rmtoll SYSRAM         SYSRAMEN         LL_RCC_SYSRAM_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SYSRAM_DisableClock(void)
{
  CLEAR_BIT(RCC->SYSRAMCFGR, RCC_SYSRAMCFGR_SYSRAMEN);
}

/**
  * @brief  Disable PKA  peripheral clock
  * @rmtoll PKA         PKAEN         LL_RCC_PKA_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PKA_DisableClock(void)
{
  CLEAR_BIT(RCC->PKACFGR, RCC_PKACFGR_PKAEN);
}

/**
  * @brief  Disable SAES  peripheral clock
  * @rmtoll SAES         SAESEN         LL_RCC_SAES_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAES_DisableClock(void)
{
  CLEAR_BIT(RCC->SAESCFGR, RCC_SAESCFGR_SAESEN);
}
#if defined(RCC_CRYP2CFGR_CRYP2EN)
/**
  * @brief  Disable CRYP2  peripheral clock
  * @rmtoll CRYP2         CRYP2EN         LL_RCC_CRYP2_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CRYP2_DisableClock(void)
{
  CLEAR_BIT(RCC->CRYP2CFGR, RCC_CRYP2CFGR_CRYP2EN);
}
#endif /* RCC_CRYP2CFGR_CRYP2EN */

#if defined(RCC_CRYP1CFGR_CRYP1EN)
/**
  * @brief  Disable CRYP1  peripheral clock
  * @rmtoll CRYP1         CRYP1EN         LL_RCC_CRYP1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CRYP1_DisableClock(void)
{
  CLEAR_BIT(RCC->CRYP1CFGR, RCC_CRYP1CFGR_CRYP1EN);
}
#endif /* RCC_CRYP1CFGR_CRYP1EN */
#if defined(RCC_RNGCFGR_RNGEN)
/**
  * @brief  Disable RNG  peripheral clock
  * @rmtoll RNG         RNGEN         LL_RCC_RNG_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RNG_DisableClock(void)
{
  CLEAR_BIT(RCC->RNGCFGR, RCC_RNGCFGR_RNGEN);
}
#endif /* RCC_RNGCFGR_RNGEN */

#if defined(RCC_HASHCFGR_HASHEN)
/**
  * @brief  Disable HASH  peripheral clock
  * @rmtoll HASH         HASHEN         LL_RCC_HASH_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HASH_DisableClock(void)
{
  CLEAR_BIT(RCC->HASHCFGR, RCC_HASHCFGR_HASHEN);
}
#endif /* RCC_HASHCFGR_HASHEN */

