zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_bus.h
#if defined(RCC_RNG1CFGR_RNG1EN)
/**
  * @brief  Disable RNG1  peripheral clock
  * @rmtoll RNG1         RNG1EN         LL_RCC_RNG1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RNG1_DisableClock(void)
{
  CLEAR_BIT(RCC->RNG1CFGR, RCC_RNG1CFGR_RNG1EN);
}
#endif /* RCC_RNG1CFGR_RNG1EN */

#if defined(RCC_RNG2CFGR_RNG2EN)
/**
  * @brief  Disable RNG2  peripheral clock
  * @rmtoll RNG         RNG2EN         LL_RCC_RNG2_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RNG2_DisableClock(void)
{
  CLEAR_BIT(RCC->RNG2CFGR, RCC_RNG2CFGR_RNG2EN);
}
#endif /* RCC_RNG2CFGR_RNG2EN */

#if defined(RCC_HASH1CFGR_HASH1EN)
/**
  * @brief  Disable HASH1  peripheral clock
  * @rmtoll HASH1         HASH1EN         LL_RCC_HASH1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HASH1_DisableClock(void)
{
  CLEAR_BIT(RCC->HASH1CFGR, RCC_HASH1CFGR_HASH1EN);
}
#endif /*RCC_HASH1CFGR_HASH1EN */

#if defined(RCC_RNG2CFGR_RNG2EN)
/**
  * @brief  Disable HASH2  peripheral clock
  * @rmtoll HASH2         HASH2EN         LL_RCC_HASH2_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HASH2_DisableClock(void)
{
  CLEAR_BIT(RCC->HASH2CFGR, RCC_HASH2CFGR_HASH2EN);
}
#endif /* RCC_HASH2CFGR_HASH2EN */

/**
  * @brief  Disable BKPSRAM  peripheral clock
  * @rmtoll BKPSRAM         BKPSRAMEN         LL_RCC_BKPSRAM_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_BKPSRAM_DisableClock(void)
{
  CLEAR_BIT(RCC->BKPSRAMCFGR, RCC_BKPSRAMCFGR_BKPSRAMEN);
}

/**
  * @brief  Enable SYSRAM peripheral clocks enable during CSleep mode
  * @rmtoll SYSRAM         SYSRAMLPEN         LL_RCC_SYSRAM_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SYSRAM_EnableClockSleep(void)
{
  SET_BIT(RCC->SYSRAMCFGR, RCC_SYSRAMCFGR_SYSRAMLPEN);
}

/**
  * @brief  Enable PKA peripheral clocks enable during CSleep mode
  * @rmtoll PKA         PKALPEN         LL_RCC_PKA_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PKA_EnableClockSleep(void)
{
  SET_BIT(RCC->PKACFGR, RCC_PKACFGR_PKALPEN);
}

/**
  * @brief  Enable SAES peripheral clocks enable during CSleep mode
  * @rmtoll SAES         SAESLPEN         LL_RCC_SAES_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAES_EnableClockSleep(void)
{
  SET_BIT(RCC->SAESCFGR, RCC_SAESCFGR_SAESLPEN);
}
#if defined(RCC_CRYP2CFGR_CRYP2LPEN)
/**
  * @brief  Enable CRYP2 peripheral clocks enable during CSleep mode
  * @rmtoll CRYP2         CRYP2LPEN         LL_RCC_CRYP2_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CRYP2_EnableClockSleep(void)
{
  SET_BIT(RCC->CRYP2CFGR, RCC_CRYP2CFGR_CRYP2LPEN);
}
#endif /* RCC_CRYP2CFGR_CRYP2LPEN */

#if defined(RCC_CRYP1CFGR_CRYP1LPEN)
/**
  * @brief  Enable CRYP1 peripheral clocks enable during CSleep mode
  * @rmtoll CRYP1         CRYP1LPEN         LL_RCC_CRYP1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CRYP1_EnableClockSleep(void)
{
  SET_BIT(RCC->CRYP1CFGR, RCC_CRYP1CFGR_CRYP1LPEN);
}
#endif /* RCC_CRYP1CFGR_CRYP1LPEN */

#if defined(RCC_RNGCFGR_RNGLPEN)
/**
  * @brief  Enable RNG peripheral clocks enable during CSleep mode
  * @rmtoll RNG         RNGLPEN         LL_RCC_RNG_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RNG_EnableClockSleep(void)
{
  SET_BIT(RCC->RNGCFGR, RCC_RNGCFGR_RNGLPEN);
}
#endif /* RCC_RNGCFGR_RNGLPEN */

#if defined(RCC_RNG1CFGR_RNG1LPEN)
/**
  * @brief  Enable RNG1 peripheral clocks enable during CSleep mode
  * @rmtoll RNG         RNG1LPEN         LL_RCC_RNG1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RNG1_EnableClockSleep(void)
{
  SET_BIT(RCC->RNG1CFGR, RCC_RNG1CFGR_RNG1LPEN);
}
#endif /* RCC_RNG1CFGR_RNG1LPEN */

#if defined(RCC_RNG2CFGR_RNG2LPEN)
/**
  * @brief  Enable RNG2 peripheral clocks enable during CSleep mode
  * @rmtoll RNG2         RNG2LPEN         LL_RCC_RNG2_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RNG2_EnableClockSleep(void)
{
  SET_BIT(RCC->RNG2CFGR, RCC_RNG2CFGR_RNG2LPEN);
}
#endif /* RCC_RNG2CFGR_RNG2LPEN */

#if defined(RCC_HASHCFGR_HASHLPEN)
/**
  * @brief  Enable HASH peripheral clocks enable during CSleep mode
  * @rmtoll HASH         HASHLPEN         LL_RCC_HASH_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HASH_EnableClockSleep(void)
{
  SET_BIT(RCC->HASHCFGR, RCC_HASHCFGR_HASHLPEN);
}
#endif /* RCC_HASHCFGR_HASHLPEN */

#if defined(RCC_HASH1CFGR_HASH1LPEN)
/**
  * @brief  Enable HASH1 peripheral clocks enable during CSleep mode
  * @rmtoll HASH1         HASH1LPEN         LL_RCC_HASH1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HASH1_EnableClockSleep(void)
{
  SET_BIT(RCC->HASH1CFGR, RCC_HASH1CFGR_HASH1LPEN);
}
#endif /* RCC_HASH1CFGR_HASH1LPEN */

#if defined(RCC_HASH2CFGR_HASH2LPEN)
/**
  * @brief  Enable HASH2 peripheral clocks enable during CSleep mode
  * @rmtoll HASH2         HASH2LPEN         LL_RCC_HASH2_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HASH2_EnableClockSleep(void)
{
  SET_BIT(RCC->HASH2CFGR, RCC_HASH2CFGR_HASH2LPEN);
}
#endif /* RCC_HASH2CFGR_HASH2LPEN */

/**
  * @brief  Enable BKPSRAM peripheral clocks enable during CSleep mode
  * @rmtoll BKPSRAM         BKPSRAMLPEN         LL_RCC_BKPSRAM_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_BKPSRAM_EnableClockSleep(void)
{
  SET_BIT(RCC->BKPSRAMCFGR, RCC_BKPSRAMCFGR_BKPSRAMLPEN);
}

/**
  * @brief  Disable SYSRAM peripheral clocks during CSleep mode
  * @rmtoll SYSRAM         SYSRAMLPEN         LL_RCC_SYSRAM_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SYSRAM_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->SYSRAMCFGR, RCC_SYSRAMCFGR_SYSRAMLPEN);
}

/**
  * @brief  Disable PKA peripheral clocks during CSleep mode
  * @rmtoll PKA         PKALPEN         LL_RCC_PKA_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PKA_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->PKACFGR, RCC_PKACFGR_PKALPEN);
}

/**
  * @brief  Disable SAES peripheral clocks during CSleep mode
  * @rmtoll SAES         SAESLPEN         LL_RCC_SAES_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAES_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->SAESCFGR, RCC_SAESCFGR_SAESLPEN);
}

#if defined(RCC_CRYP2CFGR_CRYP2LPEN)
/**
  * @brief  Disable CRYP2 peripheral clocks during CSleep mode
  * @rmtoll CRYP2         CRYP2LPEN         LL_RCC_CRYP2_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CRYP2_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->CRYP2CFGR, RCC_CRYP2CFGR_CRYP2LPEN);
}
#endif /* RCC_CRYP2CFGR_CRYP2LPEN */

#if defined(RCC_CRYP1CFGR_CRYP1LPEN)
/**
  * @brief  Disable CRYP1 peripheral clocks during CSleep mode
  * @rmtoll CRYP1         CRYP1LPEN         LL_RCC_CRYP1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CRYP1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->CRYP1CFGR, RCC_CRYP1CFGR_CRYP1LPEN);
}
#endif /* RCC_CRYP1CFGR_CRYP1LPEN */

