zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_bus.h
#if defined(RCC_RNGCFGR_RNGLPEN)
/**
  * @brief  Disable RNG peripheral clocks during CSleep mode
  * @rmtoll RNG         RNGLPEN         LL_RCC_RNG_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RNG_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->RNGCFGR, RCC_RNGCFGR_RNGLPEN);
}
#endif /* RCC_RNGCFGR_RNGLPEN  */

#if defined(RCC_RNG1CFGR_RNG1LPEN)
/**
  * @brief  Disable RNG1 peripheral clocks during CSleep mode
  * @rmtoll RNG1         RNG1LPEN         LL_RCC_RNG1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RNG1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->RNG1CFGR, RCC_RNG1CFGR_RNG1LPEN);
}
#endif /* RCC_RNG1CFGR_RNG1LPEN  */

#if defined(RCC_RNG2CFGR_RNG2LPEN)
/**
  * @brief  Disable RNG2 peripheral clocks during CSleep mode
  * @rmtoll RNG2         RNG2LPEN         LL_RCC_RNG2_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RNG2_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->RNG2CFGR, RCC_RNG2CFGR_RNG2LPEN);
}
#endif /* RCC_RNG2CFGR_RNG2LPEN  */

#if defined(RCC_HASHCFGR_HASHLPEN)
/**
  * @brief  Disable HASH peripheral clocks during CSleep mode
  * @rmtoll HASH         HASHLPEN         LL_RCC_HASH_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HASH_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->HASHCFGR, RCC_HASHCFGR_HASHLPEN);
}
#endif /* RCC_HASHCFGR_HASHLPEN  */

#if defined(RCC_HASH2CFGR_HASH2LPEN)
/**
  * @brief  Disable HASH2 peripheral clocks during CSleep mode
  * @rmtoll HASH2         HASH2LPEN         LL_RCC_HASH2_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HASH2_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->HASH2CFGR, RCC_HASH2CFGR_HASH2LPEN);
}
#endif /* RCC_HASH2CFGR_HASH2LPEN  */

#if defined(RCC_HASH1CFGR_HASH1LPEN)
/**
  * @brief  Disable HASH1 peripheral clocks during CSleep mode
  * @rmtoll HASH1         HASH1LPEN         LL_RCC_HASH1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HASH1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->HASH1CFGR, RCC_HASH1CFGR_HASH1LPEN);
}
#endif /*  RCC_HASH1CFGR_HASH1LPEN */

/**
  * @brief  Disable BKPSRAM peripheral clocks during CSleep mode
  * @rmtoll BKPSRAM         BKPSRAMLPEN         LL_RCC_BKPSRAM_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_BKPSRAM_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->BKPSRAMCFGR, RCC_BKPSRAMCFGR_BKPSRAMLPEN);
}

/**
  * @brief  Assert PKA reset
  * @rmtoll PKA         PKARST         LL_RCC_PKA_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PKA_ForceReset(void)
{
  SET_BIT(RCC->PKACFGR, RCC_PKACFGR_PKARST);
}

/**
  * @brief  Assert SAES reset
  * @rmtoll SAES         SAESRST         LL_RCC_SAES_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAES_ForceReset(void)
{
  SET_BIT(RCC->SAESCFGR, RCC_SAESCFGR_SAESRST);
}
#if defined(RCC_CRYP2CFGR_CRYP2RST)
/**
  * @brief  Assert CRYP2 reset
  * @rmtoll CRYP2         CRYP2RST         LL_RCC_CRYP2_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CRYP2_ForceReset(void)
{
  SET_BIT(RCC->CRYP2CFGR, RCC_CRYP2CFGR_CRYP2RST);
}
#endif /* RCC_CRYP2CFGR_CRYP2RST */

#if defined(RCC_CRYP1CFGR_CRYP1RST)
/**
  * @brief  Assert CRYP1 reset
  * @rmtoll CRYP1         CRYP1RST         LL_RCC_CRYP1_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CRYP1_ForceReset(void)
{
  SET_BIT(RCC->CRYP1CFGR, RCC_CRYP1CFGR_CRYP1RST);
}
#endif /* RCC_CRYP1CFGR_CRYP1RST */
#if defined(RCC_RNGCFGR_RNGRST)
/**
  * @brief  Assert RNG reset
  * @rmtoll RNG         RNGRST         LL_RCC_RNG_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RNG_ForceReset(void)
{
  SET_BIT(RCC->RNGCFGR, RCC_RNGCFGR_RNGRST);
}
#endif /* RCC_RNGCFGR_RNGRST */

#if defined(RCC_RNG1CFGR_RNG1RST)
/**
  * @brief  Assert RNG1 reset
  * @rmtoll RNG1         RNG1RST         LL_RCC_RNG1_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RNG1_ForceReset(void)
{
  SET_BIT(RCC->RNG1CFGR, RCC_RNG1CFGR_RNG1RST);
}
#endif /* RCC_RNG1CFGR_RNG1RST */

#if defined(RCC_RNG2CFGR_RNG2RST)
/**
  * @brief  Assert RNG2 reset
  * @rmtoll RNG2         RNG2RST         LL_RCC_RNG2_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RNG2_ForceReset(void)
{
  SET_BIT(RCC->RNG2CFGR, RCC_RNG2CFGR_RNG2RST);
}
#endif /* RCC_RNG2CFGR_RNG2RST */

#if defined(RCC_HASHCFGR_HASHRST)
/**
  * @brief  Assert HASH reset
  * @rmtoll HASH         HASHRST         LL_RCC_HASH_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HASH_ForceReset(void)
{
  SET_BIT(RCC->HASHCFGR, RCC_HASHCFGR_HASHRST);
}
#endif /* RCC_HASHCFGR_HASHRST */

#if defined(RCC_HASH1CFGR_HASH1RST)
/**
  * @brief  Assert HASH1 reset
  * @rmtoll HASH1         HASH1RST         LL_RCC_HASH1_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HASH1_ForceReset(void)
{
  SET_BIT(RCC->HASH1CFGR, RCC_HASH1CFGR_HASH1RST);
}
#endif /* RCC_HASH1CFGR_HASH1RST */

#if defined(RCC_HASH2CFGR_HASH2RST)
/**
  * @brief  Assert HASH2 reset
  * @rmtoll HASH2         HASH2RST         LL_RCC_HASH2_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HASH2_ForceReset(void)
{
  SET_BIT(RCC->HASH2CFGR, RCC_HASH2CFGR_HASH2RST);
}
#endif /* RCC_HASH2CFGR_HASH2RST */

/**
  * @brief  Release PKA reset
  * @rmtoll PKA         PKARST         LL_RCC_PKA_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PKA_ReleaseReset(void)
{
  CLEAR_BIT(RCC->PKACFGR, RCC_PKACFGR_PKARST);
}

/**
  * @brief  Release SAES reset
  * @rmtoll SAES         SAESRST         LL_RCC_SAES_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAES_ReleaseReset(void)
{
  CLEAR_BIT(RCC->SAESCFGR, RCC_SAESCFGR_SAESRST);
}
#if defined(RCC_CRYP2CFGR_CRYP2RST)
/**
  * @brief  Release CRYP2 reset
  * @rmtoll CRYP2         CRYP2RST         LL_RCC_CRYP2_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CRYP2_ReleaseReset(void)
{
  CLEAR_BIT(RCC->CRYP2CFGR, RCC_CRYP2CFGR_CRYP2RST);
}
#endif /* RCC_CRYP2CFGR_CRYP2RST */

#if defined(RCC_CRYP1CFGR_CRYP1RST)
/**
  * @brief  Release CRYP1 reset
  * @rmtoll CRYP1         CRYP1RST         LL_RCC_CRYP1_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CRYP1_ReleaseReset(void)
{
  CLEAR_BIT(RCC->CRYP1CFGR, RCC_CRYP1CFGR_CRYP1RST);
}
#endif /* RCC_CRYP1CFGR_CRYP1RST */
#if defined(RCC_RNGCFGR_RNGRST)
/**
  * @brief  Release RNG reset
  * @rmtoll RNG         RNGRST         LL_RCC_RNG_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RNG_ReleaseReset(void)
{
  CLEAR_BIT(RCC->RNGCFGR, RCC_RNGCFGR_RNGRST);
}
#endif /* RCC_RNGCFGR_RNGRST */

#if defined(RCC_RNG1CFGR_RNG1RST)
/**
  * @brief  Release RNG1 reset
  * @rmtoll RNG1         RNG1RST         LL_RCC_RNG1_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RNG1_ReleaseReset(void)
{
  CLEAR_BIT(RCC->RNG1CFGR, RCC_RNG1CFGR_RNG1RST);
}
#endif /* RCC_RNG1CFGR_RNG1RST */

