zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_bus.h
#if defined(RCC_RNG2CFGR_RNG2RST)
/**
  * @brief  Release RNG2 reset
  * @rmtoll RNG2         RNG2RST         LL_RCC_RNG2_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RNG2_ReleaseReset(void)
{
  CLEAR_BIT(RCC->RNG2CFGR, RCC_RNG2CFGR_RNG2RST);
}
#endif /* RCC_RNG2CFGR_RNG2RST */

#if defined(RCC_HASHCFGR_HASHRST)
/**
  * @brief  Release HASH reset
  * @rmtoll HASH         HASHRST         LL_RCC_HASH_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HASH_ReleaseReset(void)
{
  CLEAR_BIT(RCC->HASHCFGR, RCC_HASHCFGR_HASHRST);
}
#endif /* RCC_HASHCFGR_HASHRST */

#if defined(RCC_HASH1CFGR_HASH1RST)
/**
  * @brief  Release HASH1 reset
  * @rmtoll HASH1         HASH1RST         LL_RCC_HASH1_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HASH1_ReleaseReset(void)
{
  CLEAR_BIT(RCC->HASH1CFGR, RCC_HASH1CFGR_HASH1RST);
}
#endif /* RCC_HASH1CFGR_HASH1RST */

#if defined(RCC_HASH2CFGR_HASH2RST)
/**
  * @brief  Release HASH2 reset
  * @rmtoll HASH2         HASH2RST         LL_RCC_HASH2_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HASH2_ReleaseReset(void)
{
  CLEAR_BIT(RCC->HASH2CFGR, RCC_HASH2CFGR_HASH2RST);
}
#endif /* RCC_HASH2CFGR_HASH2RST */

/**
  * @}
  */

/** @defgroup BUS_LL_EF_AHB4 AHB4
  * @{
  */
#if defined(RCC_GPIOKCFGR_GPIOxEN)
/**
  * @brief  Enable GPIOK  peripheral clock
  * @rmtoll GPIOK         GPIOKEN         LL_RCC_GPIOK_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOK_EnableClock(void)
{
  SET_BIT(RCC->GPIOKCFGR, RCC_GPIOKCFGR_GPIOxEN);
}
#endif /* RCC_GPIOKCFGR_GPIOxEN */

#if defined(RCC_GPIOJCFGR_GPIOxEN)
/**
  * @brief  Enable GPIOJ  peripheral clock
  * @rmtoll GPIOJ         GPIOJEN         LL_RCC_GPIOJ_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOJ_EnableClock(void)
{
  SET_BIT(RCC->GPIOJCFGR, RCC_GPIOJCFGR_GPIOxEN);
}
#endif /* RCC_GPIOJCFGR_GPIOxEN */

/**
  * @brief  Enable GPIOI  peripheral clock
  * @rmtoll GPIOI         GPIOIEN         LL_RCC_GPIOI_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOI_EnableClock(void)
{
  SET_BIT(RCC->GPIOICFGR, RCC_GPIOICFGR_GPIOxEN);
}

/**
  * @brief  Enable GPIOH  peripheral clock
  * @rmtoll GPIOH         GPIOHEN         LL_RCC_GPIOH_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOH_EnableClock(void)
{
  SET_BIT(RCC->GPIOHCFGR, RCC_GPIOHCFGR_GPIOxEN);
}

/**
  * @brief  Enable GPIOG  peripheral clock
  * @rmtoll GPIOG         GPIOGEN         LL_RCC_GPIOG_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOG_EnableClock(void)
{
  SET_BIT(RCC->GPIOGCFGR, RCC_GPIOGCFGR_GPIOxEN);
}

/**
  * @brief  Enable GPIOF  peripheral clock
  * @rmtoll GPIOF         GPIOFEN         LL_RCC_GPIOF_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOF_EnableClock(void)
{
  SET_BIT(RCC->GPIOFCFGR, RCC_GPIOFCFGR_GPIOxEN);
}

/**
  * @brief  Enable GPIOE  peripheral clock
  * @rmtoll GPIOE         GPIOEEN         LL_RCC_GPIOE_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOE_EnableClock(void)
{
  SET_BIT(RCC->GPIOECFGR, RCC_GPIOECFGR_GPIOxEN);
}

/**
  * @brief  Enable GPIOD  peripheral clock
  * @rmtoll GPIOD         GPIODEN         LL_RCC_GPIOD_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOD_EnableClock(void)
{
  SET_BIT(RCC->GPIODCFGR, RCC_GPIODCFGR_GPIOxEN);
}

/**
  * @brief  Enable GPIOC  peripheral clock
  * @rmtoll GPIOC         GPIOCEN         LL_RCC_GPIOC_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOC_EnableClock(void)
{
  SET_BIT(RCC->GPIOCCFGR, RCC_GPIOCCFGR_GPIOxEN);
}

/**
  * @brief  Enable GPIOB  peripheral clock
  * @rmtoll GPIOB         GPIOBEN         LL_RCC_GPIOB_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOB_EnableClock(void)
{
  SET_BIT(RCC->GPIOBCFGR, RCC_GPIOBCFGR_GPIOxEN);
}

/**
  * @brief  Enable GPIOA  peripheral clock
  * @rmtoll GPIOA         GPIOAEN         LL_RCC_GPIOA_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOA_EnableClock(void)
{
  SET_BIT(RCC->GPIOACFGR, RCC_GPIOACFGR_GPIOxEN);
}

#if defined(RCC_GPIOKCFGR_GPIOxEN)
/**
  * @brief  Disable GPIOK  peripheral clock
  * @rmtoll GPIOK         GPIOKEN         LL_RCC_GPIOK_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOK_DisableClock(void)
{
  CLEAR_BIT(RCC->GPIOKCFGR, RCC_GPIOKCFGR_GPIOxEN);
}
#endif /* RCC_GPIOKCFGR_GPIOxEN */

#if defined(RCC_GPIOJCFGR_GPIOxEN)

/**
  * @brief  Disable GPIOJ  peripheral clock
  * @rmtoll GPIOJ         GPIOJEN         LL_RCC_GPIOJ_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOJ_DisableClock(void)
{
  CLEAR_BIT(RCC->GPIOJCFGR, RCC_GPIOJCFGR_GPIOxEN);
}
#endif /* RCC_GPIOJCFGR_GPIOxEN */

/**
  * @brief  Disable GPIOI  peripheral clock
  * @rmtoll GPIOI         GPIOIEN         LL_RCC_GPIOI_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOI_DisableClock(void)
{
  CLEAR_BIT(RCC->GPIOICFGR, RCC_GPIOICFGR_GPIOxEN);
}

/**
  * @brief  Disable GPIOH  peripheral clock
  * @rmtoll GPIOH         GPIOHEN         LL_RCC_GPIOH_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOH_DisableClock(void)
{
  CLEAR_BIT(RCC->GPIOHCFGR, RCC_GPIOHCFGR_GPIOxEN);
}

/**
  * @brief  Disable GPIOG  peripheral clock
  * @rmtoll GPIOG         GPIOGEN         LL_RCC_GPIOG_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOG_DisableClock(void)
{
  CLEAR_BIT(RCC->GPIOGCFGR, RCC_GPIOGCFGR_GPIOxEN);
}

/**
  * @brief  Disable GPIOF  peripheral clock
  * @rmtoll GPIOF         GPIOFEN         LL_RCC_GPIOF_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOF_DisableClock(void)
{
  CLEAR_BIT(RCC->GPIOFCFGR, RCC_GPIOFCFGR_GPIOxEN);
}

/**
  * @brief  Disable GPIOE  peripheral clock
  * @rmtoll GPIOE         GPIOEEN         LL_RCC_GPIOE_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOE_DisableClock(void)
{
  CLEAR_BIT(RCC->GPIOECFGR, RCC_GPIOECFGR_GPIOxEN);
}

/**
  * @brief  Disable GPIOD  peripheral clock
  * @rmtoll GPIOD         GPIODEN         LL_RCC_GPIOD_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOD_DisableClock(void)
{
  CLEAR_BIT(RCC->GPIODCFGR, RCC_GPIODCFGR_GPIOxEN);
}

/**
  * @brief  Disable GPIOC  peripheral clock
  * @rmtoll GPIOC         GPIOCEN         LL_RCC_GPIOC_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOC_DisableClock(void)
{
  CLEAR_BIT(RCC->GPIOCCFGR, RCC_GPIOCCFGR_GPIOxEN);
}

/**
  * @brief  Disable GPIOB  peripheral clock
  * @rmtoll GPIOB         GPIOBEN         LL_RCC_GPIOB_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOB_DisableClock(void)
{
  CLEAR_BIT(RCC->GPIOBCFGR, RCC_GPIOBCFGR_GPIOxEN);
}

/**
  * @brief  Disable GPIOA  peripheral clock
  * @rmtoll GPIOA         GPIOAEN         LL_RCC_GPIOA_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOA_DisableClock(void)
{
  CLEAR_BIT(RCC->GPIOACFGR, RCC_GPIOACFGR_GPIOxEN);
}

