zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_bus.h
#if defined(RCC_GPIOKCFGR_GPIOxLPEN)
/**
  * @brief  Enable GPIOK peripheral clocks enable during CSleep mode
  * @rmtoll GPIOK         GPIOKLPEN         LL_RCC_GPIOK_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOK_EnableClockSleep(void)
{
  SET_BIT(RCC->GPIOKCFGR, RCC_GPIOKCFGR_GPIOxLPEN);
}
#endif /* RCC_GPIOKCFGR_GPIOxLPEN */

#if defined(RCC_GPIOJCFGR_GPIOxLPEN)
/**
  * @brief  Enable GPIOJ peripheral clocks enable during CSleep mode
  * @rmtoll GPIOJ         GPIOJLPEN         LL_RCC_GPIOJ_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOJ_EnableClockSleep(void)
{
  SET_BIT(RCC->GPIOJCFGR, RCC_GPIOJCFGR_GPIOxLPEN);
}
#endif /* RCC_GPIOJCFGR_GPIOxLPEN */

/**
  * @brief  Enable GPIOI peripheral clocks enable during CSleep mode
  * @rmtoll GPIOI         GPIOILPEN         LL_RCC_GPIOI_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOI_EnableClockSleep(void)
{
  SET_BIT(RCC->GPIOICFGR, RCC_GPIOICFGR_GPIOxLPEN);
}

/**
  * @brief  Enable GPIOH peripheral clocks enable during CSleep mode
  * @rmtoll GPIOH         GPIOHLPEN         LL_RCC_GPIOH_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOH_EnableClockSleep(void)
{
  SET_BIT(RCC->GPIOHCFGR, RCC_GPIOHCFGR_GPIOxLPEN);
}

/**
  * @brief  Enable GPIOG peripheral clocks enable during CSleep mode
  * @rmtoll GPIOG         GPIOGLPEN         LL_RCC_GPIOG_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOG_EnableClockSleep(void)
{
  SET_BIT(RCC->GPIOGCFGR, RCC_GPIOGCFGR_GPIOxLPEN);
}

/**
  * @brief  Enable GPIOF peripheral clocks enable during CSleep mode
  * @rmtoll GPIOF         GPIOFLPEN         LL_RCC_GPIOF_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOF_EnableClockSleep(void)
{
  SET_BIT(RCC->GPIOFCFGR, RCC_GPIOFCFGR_GPIOxLPEN);
}

/**
  * @brief  Enable GPIOE peripheral clocks enable during CSleep mode
  * @rmtoll GPIOE         GPIOELPEN         LL_RCC_GPIOE_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOE_EnableClockSleep(void)
{
  SET_BIT(RCC->GPIOECFGR, RCC_GPIOECFGR_GPIOxLPEN);
}

/**
  * @brief  Enable GPIOD peripheral clocks enable during CSleep mode
  * @rmtoll GPIOD         GPIODLPEN         LL_RCC_GPIOD_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOD_EnableClockSleep(void)
{
  SET_BIT(RCC->GPIODCFGR, RCC_GPIODCFGR_GPIOxLPEN);
}

/**
  * @brief  Enable GPIOC peripheral clocks enable during CSleep mode
  * @rmtoll GPIOC         GPIOCLPEN         LL_RCC_GPIOC_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOC_EnableClockSleep(void)
{
  SET_BIT(RCC->GPIOCCFGR, RCC_GPIOCCFGR_GPIOxLPEN);
}

/**
  * @brief  Enable GPIOB peripheral clocks enable during CSleep mode
  * @rmtoll GPIOB         GPIOBLPEN         LL_RCC_GPIOB_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOB_EnableClockSleep(void)
{
  SET_BIT(RCC->GPIOBCFGR, RCC_GPIOBCFGR_GPIOxLPEN);
}

/**
  * @brief  Enable GPIOA peripheral clocks enable during CSleep mode
  * @rmtoll GPIOA         GPIOALPEN         LL_RCC_GPIOA_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOA_EnableClockSleep(void)
{
  SET_BIT(RCC->GPIOACFGR, RCC_GPIOACFGR_GPIOxLPEN);
}

#if defined(RCC_GPIOKCFGR_GPIOxLPEN)
/**
  * @brief  Disable GPIOK peripheral clocks during CSleep mode
  * @rmtoll GPIOK         GPIOKLPEN         LL_RCC_GPIOK_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOK_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->GPIOKCFGR, RCC_GPIOKCFGR_GPIOxLPEN);
}
#endif /* RCC_GPIOKCFGR_GPIOxLPEN */

#if defined(RCC_GPIOJCFGR_GPIOxLPEN)
/**
  * @brief  Disable GPIOJ peripheral clocks during CSleep mode
  * @rmtoll GPIOJ         GPIOJLPEN         LL_RCC_GPIOJ_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOJ_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->GPIOJCFGR, RCC_GPIOJCFGR_GPIOxLPEN);
}
#endif /* RCC_GPIOJCFGR_GPIOxLPEN */

/**
  * @brief  Disable GPIOI peripheral clocks during CSleep mode
  * @rmtoll GPIOI         GPIOILPEN         LL_RCC_GPIOI_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOI_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->GPIOICFGR, RCC_GPIOICFGR_GPIOxLPEN);
}

/**
  * @brief  Disable GPIOH peripheral clocks during CSleep mode
  * @rmtoll GPIOH         GPIOHLPEN         LL_RCC_GPIOH_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOH_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->GPIOHCFGR, RCC_GPIOHCFGR_GPIOxLPEN);
}

/**
  * @brief  Disable GPIOG peripheral clocks during CSleep mode
  * @rmtoll GPIOG         GPIOGLPEN         LL_RCC_GPIOG_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOG_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->GPIOGCFGR, RCC_GPIOGCFGR_GPIOxLPEN);
}

/**
  * @brief  Disable GPIOF peripheral clocks during CSleep mode
  * @rmtoll GPIOF         GPIOFLPEN         LL_RCC_GPIOF_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOF_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->GPIOFCFGR, RCC_GPIOFCFGR_GPIOxLPEN);
}

/**
  * @brief  Disable GPIOE peripheral clocks during CSleep mode
  * @rmtoll GPIOE         GPIOELPEN         LL_RCC_GPIOE_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOE_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->GPIOECFGR, RCC_GPIOECFGR_GPIOxLPEN);
}

/**
  * @brief  Disable GPIOD peripheral clocks during CSleep mode
  * @rmtoll GPIOD         GPIODLPEN         LL_RCC_GPIOD_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOD_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->GPIODCFGR, RCC_GPIODCFGR_GPIOxLPEN);
}

/**
  * @brief  Disable GPIOC peripheral clocks during CSleep mode
  * @rmtoll GPIOC         GPIOCLPEN         LL_RCC_GPIOC_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOC_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->GPIOCCFGR, RCC_GPIOCCFGR_GPIOxLPEN);
}

/**
  * @brief  Disable GPIOB peripheral clocks during CSleep mode
  * @rmtoll GPIOB         GPIOBLPEN         LL_RCC_GPIOB_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOB_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->GPIOBCFGR, RCC_GPIOBCFGR_GPIOxLPEN);
}

/**
  * @brief  Disable GPIOA peripheral clocks during CSleep mode
  * @rmtoll GPIOA         GPIOALPEN         LL_RCC_GPIOA_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOA_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->GPIOACFGR, RCC_GPIOACFGR_GPIOxLPEN);
}

#if defined(RCC_GPIOKCFGR_GPIOxRST)
/**
  * @brief  Assert GPIOK reset
  * @rmtoll GPIOK         GPIOKRST         LL_RCC_GPIOK_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOK_ForceReset(void)
{
  SET_BIT(RCC->GPIOKCFGR, RCC_GPIOKCFGR_GPIOxRST);
}
#endif /* RCC_GPIOKCFGR_GPIOxRST */

#if defined(RCC_GPIOJCFGR_GPIOxRST)
/**
  * @brief  Assert GPIOJ reset
  * @rmtoll GPIOJ         GPIOJRST         LL_RCC_GPIOJ_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOJ_ForceReset(void)
{
  SET_BIT(RCC->GPIOJCFGR, RCC_GPIOJCFGR_GPIOxRST);
}
#endif /* RCC_GPIOJCFGR_GPIOxRST */

/**
  * @brief  Assert GPIOI reset
  * @rmtoll GPIOI         GPIOIRST         LL_RCC_GPIOI_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOI_ForceReset(void)
{
  SET_BIT(RCC->GPIOICFGR, RCC_GPIOICFGR_GPIOxRST);
}

/**
  * @brief  Assert GPIOH reset
  * @rmtoll GPIOH         GPIOHRST         LL_RCC_GPIOH_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOH_ForceReset(void)
{
  SET_BIT(RCC->GPIOHCFGR, RCC_GPIOHCFGR_GPIOxRST);
}

/**
  * @brief  Assert GPIOG reset
  * @rmtoll GPIOG         GPIOGRST         LL_RCC_GPIOG_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOG_ForceReset(void)
{
  SET_BIT(RCC->GPIOGCFGR, RCC_GPIOGCFGR_GPIOxRST);
}

/**
  * @brief  Assert GPIOF reset
  * @rmtoll GPIOF         GPIOFRST         LL_RCC_GPIOF_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOF_ForceReset(void)
{
  SET_BIT(RCC->GPIOFCFGR, RCC_GPIOFCFGR_GPIOxRST);
}

/**
  * @brief  Assert GPIOE reset
  * @rmtoll GPIOE         GPIOERST         LL_RCC_GPIOE_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOE_ForceReset(void)
{
  SET_BIT(RCC->GPIOECFGR, RCC_GPIOECFGR_GPIOxRST);
}

/**
  * @brief  Assert GPIOD reset
  * @rmtoll GPIOD         GPIODRST         LL_RCC_GPIOD_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOD_ForceReset(void)
{
  SET_BIT(RCC->GPIODCFGR, RCC_GPIODCFGR_GPIOxRST);
}

/**
  * @brief  Assert GPIOC reset
  * @rmtoll GPIOC         GPIOCRST         LL_RCC_GPIOC_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOC_ForceReset(void)
{
  SET_BIT(RCC->GPIOCCFGR, RCC_GPIOCCFGR_GPIOxRST);
}

/**
  * @brief  Assert GPIOB reset
  * @rmtoll GPIOB         GPIOBRST         LL_RCC_GPIOB_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOB_ForceReset(void)
{
  SET_BIT(RCC->GPIOBCFGR, RCC_GPIOBCFGR_GPIOxRST);
}

/**
  * @brief  Assert GPIOA reset
  * @rmtoll GPIOA         GPIOARST         LL_RCC_GPIOA_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOA_ForceReset(void)
{
  SET_BIT(RCC->GPIOACFGR, RCC_GPIOACFGR_GPIOxRST);
}

#if defined(RCC_GPIOKCFGR_GPIOxRST)
/**
  * @brief  Release GPIOK reset
  * @rmtoll GPIOK         GPIOKRST         LL_RCC_GPIOK_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOK_ReleaseReset(void)
{
  CLEAR_BIT(RCC->GPIOKCFGR, RCC_GPIOKCFGR_GPIOxRST);
}
#endif /* RCC_GPIOKCFGR_GPIOxRST */

#if defined(RCC_GPIOJCFGR_GPIOxRST)
/**
  * @brief  Release GPIOJ reset
  * @rmtoll GPIOJ         GPIOJRST         LL_RCC_GPIOJ_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOJ_ReleaseReset(void)
{
  CLEAR_BIT(RCC->GPIOJCFGR, RCC_GPIOJCFGR_GPIOxRST);
}
#endif /* RCC_GPIOJCFGR_GPIOxRST */

/**
  * @brief  Release GPIOI reset
  * @rmtoll GPIOI         GPIOIRST         LL_RCC_GPIOI_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOI_ReleaseReset(void)
{
  CLEAR_BIT(RCC->GPIOICFGR, RCC_GPIOICFGR_GPIOxRST);
}

/**
  * @brief  Release GPIOH reset
  * @rmtoll GPIOH         GPIOHRST         LL_RCC_GPIOH_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOH_ReleaseReset(void)
{
  CLEAR_BIT(RCC->GPIOHCFGR, RCC_GPIOHCFGR_GPIOxRST);
}

/**
  * @brief  Release GPIOG reset
  * @rmtoll GPIOG         GPIOGRST         LL_RCC_GPIOG_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOG_ReleaseReset(void)
{
  CLEAR_BIT(RCC->GPIOGCFGR, RCC_GPIOGCFGR_GPIOxRST);
}

/**
  * @brief  Release GPIOF reset
  * @rmtoll GPIOF         GPIOFRST         LL_RCC_GPIOF_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOF_ReleaseReset(void)
{
  CLEAR_BIT(RCC->GPIOFCFGR, RCC_GPIOFCFGR_GPIOxRST);
}

/**
  * @brief  Release GPIOE reset
  * @rmtoll GPIOE         GPIOERST         LL_RCC_GPIOE_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOE_ReleaseReset(void)
{
  CLEAR_BIT(RCC->GPIOECFGR, RCC_GPIOECFGR_GPIOxRST);
}

/**
  * @brief  Release GPIOD reset
  * @rmtoll GPIOD         GPIODRST         LL_RCC_GPIOD_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOD_ReleaseReset(void)
{
  CLEAR_BIT(RCC->GPIODCFGR, RCC_GPIODCFGR_GPIOxRST);
}

/**
  * @brief  Release GPIOC reset
  * @rmtoll GPIOC         GPIOCRST         LL_RCC_GPIOC_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOC_ReleaseReset(void)
{
  CLEAR_BIT(RCC->GPIOCCFGR, RCC_GPIOCCFGR_GPIOxRST);
}

/**
  * @brief  Release GPIOB reset
  * @rmtoll GPIOB         GPIOBRST         LL_RCC_GPIOB_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOB_ReleaseReset(void)
{
  CLEAR_BIT(RCC->GPIOBCFGR, RCC_GPIOBCFGR_GPIOxRST);
}

/**
  * @brief  Release GPIOA reset
  * @rmtoll GPIOA         GPIOARST         LL_RCC_GPIOA_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOA_ReleaseReset(void)
{
  CLEAR_BIT(RCC->GPIOACFGR, RCC_GPIOACFGR_GPIOxRST);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_AHB5 AHB5
  * @{
  */
/**
  * @brief  Enable SDMMC1  peripheral clock
  * @rmtoll SDMMC1         SDMMC1EN         LL_RCC_SDMMC1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SDMMC1_EnableClock(void)
{
  SET_BIT(RCC->SDMMC1CFGR, RCC_SDMMC1CFGR_SDMMC1EN);
}

/**
  * @brief  Enable SDMMC2  peripheral clock
  * @rmtoll SDMMC2         SDMMC2EN         LL_RCC_SDMMC2_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SDMMC2_EnableClock(void)
{
  SET_BIT(RCC->SDMMC2CFGR, RCC_SDMMC2CFGR_SDMMC2EN);
}

/**
  * @brief  Enable SDMMC3  peripheral clock
  * @rmtoll SDMMC3         SDMMC3EN         LL_RCC_SDMMC3_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SDMMC3_EnableClock(void)
{
  SET_BIT(RCC->SDMMC3CFGR, RCC_SDMMC3CFGR_SDMMC3EN);
}

#if defined(RCC_USB3DRDCFGR_USB3DRDEN)
/**
  * @brief  Enable USB3DRD  peripheral clock
  * @rmtoll USB3DRD         USB3DRDEN         LL_RCC_USB3DRD_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB3DRD_EnableClock(void)
{
  SET_BIT(RCC->USB3DRDCFGR, RCC_USB3DRDCFGR_USB3DRDEN);
}
#endif /* RCC_USB3DRDCFGR_USB3DRDEN */


/**
  * @brief  Enable USB2PHY  peripheral clock
  * @rmtoll USB2PHY         USB2PHYEN         LL_RCC_USB2PHY_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB2PHY1_EnableClock(void)
{
  SET_BIT(RCC->USB2PHY1CFGR, RCC_USB2PHY1CFGR_USB2PHY1EN);
}

/**
  * @brief  Enable USB2PHY  peripheral clock
  * @rmtoll USB2PHY         USB2PHYEN         LL_RCC_USB2PHY_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB2PHY2_EnableClock(void)
{
  SET_BIT(RCC->USB2PHY2CFGR, RCC_USB2PHY2CFGR_USB2PHY2EN);
}

/**
  * @brief  Enable FMC  peripheral clock
  * @rmtoll FMC         FMCEN         LL_RCC_FMC_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_FMC_EnableClock(void)
{
  SET_BIT(RCC->FMCCFGR, RCC_FMCCFGR_FMCEN);
}

/**
  * @brief  Enable ETH1  peripheral clock
  * @rmtoll ETH1         ETH1EN         LL_RCC_ETH1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ETH1_EnableClock(void)
{
  SET_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1EN);
}

/**
  * @brief  Enable ETH2  peripheral clock
  * @rmtoll ETH2         ETH2EN         LL_RCC_ETH2_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ETH2_EnableClock(void)
{
  SET_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2EN);
}
#if defined(RCC_GPUCFGR_GPUEN)
/**
  * @brief  Enable GPU  peripheral clock
  * @rmtoll GPU         GPUEN         LL_RCC_GPU_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPU_EnableClock(void)
{
  SET_BIT(RCC->GPUCFGR, RCC_GPUCFGR_GPUEN);
}
#endif /* RCC_GPUCFGR_GPUEN */
/**
  * @brief  Disable SDMMC1  peripheral clock
  * @rmtoll SDMMC1         SDMMC1EN         LL_RCC_SDMMC1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SDMMC1_DisableClock(void)
{
  CLEAR_BIT(RCC->SDMMC1CFGR, RCC_SDMMC1CFGR_SDMMC1EN);
}

/**
  * @brief  Disable SDMMC2  peripheral clock
  * @rmtoll SDMMC2         SDMMC2EN         LL_RCC_SDMMC2_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SDMMC2_DisableClock(void)
{
  CLEAR_BIT(RCC->SDMMC2CFGR, RCC_SDMMC2CFGR_SDMMC2EN);
}

/**
  * @brief  Disable SDMMC3  peripheral clock
  * @rmtoll SDMMC3         SDMMC3EN         LL_RCC_SDMMC3_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SDMMC3_DisableClock(void)
{
  CLEAR_BIT(RCC->SDMMC3CFGR, RCC_SDMMC3CFGR_SDMMC3EN);
}

#if defined(RCC_USB3DRDCFGR_USB3DRDEN)
/**
  * @brief  Disable USB3DRD  peripheral clock
  * @rmtoll USB3DRD         USB3DRDEN         LL_RCC_USB3DRD_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB3DRD_DisableClock(void)
{
  CLEAR_BIT(RCC->USB3DRDCFGR, RCC_USB3DRDCFGR_USB3DRDEN);
}
#endif /* RCC_USB3DRDCFGR_USB3DRDEN */


/**
  * @brief  Disable USB2PHY  peripheral clock
  * @rmtoll USB2PHY         USB2PHYEN         LL_RCC_USB2PHY_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB2PHY1_DisableClock(void)
{
  CLEAR_BIT(RCC->USB2PHY1CFGR, RCC_USB2PHY1CFGR_USB2PHY1EN);
}

/**
  * @brief  Disable USB2PHY  peripheral clock
  * @rmtoll USB2PHY         USB2PHYEN         LL_RCC_USB2PHY_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB2PHY2_DisableClock(void)
{
  CLEAR_BIT(RCC->USB2PHY2CFGR, RCC_USB2PHY2CFGR_USB2PHY2EN);
}

/**
  * @brief  Disable FMC  peripheral clock
  * @rmtoll FMC         FMCEN         LL_RCC_FMC_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_FMC_DisableClock(void)
{
  CLEAR_BIT(RCC->FMCCFGR, RCC_FMCCFGR_FMCEN);
}

/**
  * @brief  Disable ETH1  peripheral clock
  * @rmtoll ETH1         ETH1EN         LL_RCC_ETH1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ETH1_DisableClock(void)
{
  CLEAR_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1EN);
}

/**
  * @brief  Disable ETH2  peripheral clock
  * @rmtoll ETH2         ETH2EN         LL_RCC_ETH2_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ETH2_DisableClock(void)
{
  CLEAR_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2EN);
}
#if defined(RCC_GPUCFGR_GPUEN)
/**
  * @brief  Disable GPU  peripheral clock
  * @rmtoll GPU         GPUEN         LL_RCC_GPU_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPU_DisableClock(void)
{
  CLEAR_BIT(RCC->GPUCFGR, RCC_GPUCFGR_GPUEN);
}
#endif /* RCC_GPUCFGR_GPUEN */
/**
  * @brief  Enable SDMMC1 peripheral clocks enable during CSleep mode
  * @rmtoll SDMMC1         SDMMC1LPEN         LL_RCC_SDMMC1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SDMMC1_EnableClockSleep(void)
{
  SET_BIT(RCC->SDMMC1CFGR, RCC_SDMMC1CFGR_SDMMC1LPEN);
}

/**
  * @brief  Enable SDMMC2 peripheral clocks enable during CSleep mode
  * @rmtoll SDMMC2         SDMMC2LPEN         LL_RCC_SDMMC2_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SDMMC2_EnableClockSleep(void)
{
  SET_BIT(RCC->SDMMC2CFGR, RCC_SDMMC2CFGR_SDMMC2LPEN);
}

/**
  * @brief  Enable SDMMC3 peripheral clocks enable during CSleep mode
  * @rmtoll SDMMC3         SDMMC3LPEN         LL_RCC_SDMMC3_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SDMMC3_EnableClockSleep(void)
{
  SET_BIT(RCC->SDMMC3CFGR, RCC_SDMMC3CFGR_SDMMC3LPEN);
}

