zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_bus.h
#if defined(RCC_USB3DRDCFGR_USB3DRDLPEN)
/**
  * @brief  Enable USB3DRD peripheral clocks enable during CSleep mode
  * @rmtoll USB3DRD         USB3DRDLPEN         LL_RCC_USB3DRD_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB3DRD_EnableClockSleep(void)
{
  SET_BIT(RCC->USB3DRDCFGR, RCC_USB3DRDCFGR_USB3DRDLPEN);
}
#endif /* RCC_USB3DRDCFGR_USB3DRDLPEN */


/**
  * @brief  Enable USB2PHY peripheral clocks enable during CSleep mode
  * @rmtoll USB2PHY         USB2PHYLPEN         LL_RCC_USB2PHY_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB2PHY1_EnableClockSleep(void)
{
  SET_BIT(RCC->USB2PHY1CFGR, RCC_USB2PHY1CFGR_USB2PHY1LPEN);
}

/**
  * @brief  Enable USB2PHY peripheral clocks enable during CSleep mode
  * @rmtoll USB2PHY         USB2PHYLPEN         LL_RCC_USB2PHY_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB2PHY2_EnableClockSleep(void)
{
  SET_BIT(RCC->USB2PHY2CFGR, RCC_USB2PHY2CFGR_USB2PHY2LPEN);
}

/**
  * @brief  Enable FMC peripheral clocks enable during CSleep mode
  * @rmtoll FMC         FMCLPEN         LL_RCC_FMC_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_FMC_EnableClockSleep(void)
{
  SET_BIT(RCC->FMCCFGR, RCC_FMCCFGR_FMCLPEN);
}

/**
  * @brief  Enable ETH1 peripheral clocks enable during CSleep mode
  * @rmtoll ETH1         ETH1LPEN         LL_RCC_ETH1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ETH1_EnableClockSleep(void)
{
  SET_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1LPEN);
}

/**
  * @brief  Enable ETH2 peripheral clocks enable during CSleep mode
  * @rmtoll ETH2         ETH2LPEN         LL_RCC_ETH2_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ETH2_EnableClockSleep(void)
{
  SET_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2LPEN);
}
#if defined(RCC_GPUCFGR_GPULPEN)
/**
  * @brief  Enable GPU peripheral clocks enable during CSleep mode
  * @rmtoll GPU         GPULPEN         LL_RCC_GPU_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPU_EnableClockSleep(void)
{
  SET_BIT(RCC->GPUCFGR, RCC_GPUCFGR_GPULPEN);
}
#endif /* RCC_GPUCFGR_GPULPEN */
/**
  * @brief  Disable SDMMC1 peripheral clocks during CSleep mode
  * @rmtoll SDMMC1         SDMMC1LPEN         LL_RCC_SDMMC1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SDMMC1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->SDMMC1CFGR, RCC_SDMMC1CFGR_SDMMC1LPEN);
}

/**
  * @brief  Disable SDMMC2 peripheral clocks during CSleep mode
  * @rmtoll SDMMC2         SDMMC2LPEN         LL_RCC_SDMMC2_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SDMMC2_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->SDMMC2CFGR, RCC_SDMMC2CFGR_SDMMC2LPEN);
}

/**
  * @brief  Disable SDMMC3 peripheral clocks during CSleep mode
  * @rmtoll SDMMC3         SDMMC3LPEN         LL_RCC_SDMMC3_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SDMMC3_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->SDMMC3CFGR, RCC_SDMMC3CFGR_SDMMC3LPEN);
}

#if defined(RCC_USB3DRDCFGR_USB3DRDLPEN)
/**
  * @brief  Disable USB3DRD peripheral clocks during CSleep mode
  * @rmtoll USB3DRD         USB3DRDLPEN         LL_RCC_USB3DRD_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB3DRD_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->USB3DRDCFGR, RCC_USB3DRDCFGR_USB3DRDLPEN);
}
#endif /* RCC_USB3DRDCFGR_USB3DRDLPEN */

/**
  * @brief  Disable USB2PHY peripheral clocks during CSleep mode
  * @rmtoll USB2PHY         USB2PHYLPEN         LL_RCC_USB2PHY_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB2PHY1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->USB2PHY1CFGR, RCC_USB2PHY1CFGR_USB2PHY1LPEN);
}

/**
  * @brief  Disable USB2PHY peripheral clocks during CSleep mode
  * @rmtoll USB2PHY         USB2PHYLPEN         LL_RCC_USB2PHY_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB2PHY2_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->USB2PHY2CFGR, RCC_USB2PHY2CFGR_USB2PHY2LPEN);
}

/**
  * @brief  Disable FMC peripheral clocks during CSleep mode
  * @rmtoll FMC         FMCLPEN         LL_RCC_FMC_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_FMC_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->FMCCFGR, RCC_FMCCFGR_FMCLPEN);
}

/**
  * @brief  Disable ETH1 peripheral clocks during CSleep mode
  * @rmtoll ETH1         ETH1LPEN         LL_RCC_ETH1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ETH1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1LPEN);
}

/**
  * @brief  Disable ETH2 peripheral clocks during CSleep mode
  * @rmtoll ETH2         ETH2LPEN         LL_RCC_ETH2_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ETH2_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2LPEN);
}
#if defined(RCC_GPUCFGR_GPULPEN)
/**
  * @brief  Disable GPU peripheral clocks during CSleep mode
  * @rmtoll GPU         GPULPEN         LL_RCC_GPU_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPU_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->GPUCFGR, RCC_GPUCFGR_GPULPEN);
}
#endif /* RCC_GPUCFGR_GPULPEN */
/**
  * @brief  Assert SDMMC1 reset
  * @rmtoll SDMMC1         SDMMC1RST         LL_RCC_SDMMC1_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SDMMC1_ForceReset(void)
{
  SET_BIT(RCC->SDMMC1CFGR, RCC_SDMMC1CFGR_SDMMC1RST);
}

/**
  * @brief  Assert SDMMC2 reset
  * @rmtoll SDMMC2         SDMMC2RST         LL_RCC_SDMMC2_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SDMMC2_ForceReset(void)
{
  SET_BIT(RCC->SDMMC2CFGR, RCC_SDMMC2CFGR_SDMMC2RST);
}

/**
  * @brief  Assert SDMMC3 reset
  * @rmtoll SDMMC3         SDMMC3RST         LL_RCC_SDMMC3_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SDMMC3_ForceReset(void)
{
  SET_BIT(RCC->SDMMC3CFGR, RCC_SDMMC3CFGR_SDMMC3RST);
}

#if defined(RCC_USB3DRDCFGR_USB3DRDRST)
/**
  * @brief  Assert USB3DRD reset
  * @rmtoll USB3DRD         USB3DRDRST         LL_RCC_USB3DRD_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB3DRD_ForceReset(void)
{
  SET_BIT(RCC->USB3DRDCFGR, RCC_USB3DRDCFGR_USB3DRDRST);
}
#endif /* RCC_USB3DRDCFGR_USB3DRDRST */


/**
  * @brief  Assert USB2PHY reset
  * @rmtoll USB2PHY         USB2PHYRST         LL_RCC_USB2PHY_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB2PHY1_ForceReset(void)
{
  SET_BIT(RCC->USB2PHY1CFGR, RCC_USB2PHY1CFGR_USB2PHY1RST);
}

/**
  * @brief  Assert USB2PHY reset
  * @rmtoll USB2PHY         USB2PHYRST         LL_RCC_USB2PHY_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB2PHY2_ForceReset(void)
{
  SET_BIT(RCC->USB2PHY2CFGR, RCC_USB2PHY2CFGR_USB2PHY2RST);
}

/**
  * @brief  Assert FMC reset
  * @rmtoll FMC         FMCRST         LL_RCC_FMC_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_FMC_ForceReset(void)
{
  SET_BIT(RCC->FMCCFGR, RCC_FMCCFGR_FMCRST);
}

/**
  * @brief  Assert ETH1 reset
  * @rmtoll ETH1         ETH1RST         LL_RCC_ETH1_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ETH1_ForceReset(void)
{
  SET_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1RST);
}

/**
  * @brief  Assert ETH2 reset
  * @rmtoll ETH2         ETH2RST         LL_RCC_ETH2_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ETH2_ForceReset(void)
{
  SET_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2RST);
}
#if defined(RCC_GPUCFGR_GPURST)
/**
  * @brief  Assert GPU reset
  * @rmtoll GPU         GPURST         LL_RCC_GPU_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPU_ForceReset(void)
{
  SET_BIT(RCC->GPUCFGR, RCC_GPUCFGR_GPURST);
}
#endif /* RCC_GPUCFGR_GPURST */
/**
  * @brief  Release SDMMC1 reset
  * @rmtoll SDMMC1         SDMMC1RST         LL_RCC_SDMMC1_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SDMMC1_ReleaseReset(void)
{
  CLEAR_BIT(RCC->SDMMC1CFGR, RCC_SDMMC1CFGR_SDMMC1RST);
}

/**
  * @brief  Release SDMMC2 reset
  * @rmtoll SDMMC2         SDMMC2RST         LL_RCC_SDMMC2_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SDMMC2_ReleaseReset(void)
{
  CLEAR_BIT(RCC->SDMMC2CFGR, RCC_SDMMC2CFGR_SDMMC2RST);
}

/**
  * @brief  Release SDMMC3 reset
  * @rmtoll SDMMC3         SDMMC3RST         LL_RCC_SDMMC3_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SDMMC3_ReleaseReset(void)
{
  CLEAR_BIT(RCC->SDMMC3CFGR, RCC_SDMMC3CFGR_SDMMC3RST);
}

#if defined(RCC_USB3DRDCFGR_USB3DRDRST)
/**
  * @brief  Release USB3DRD reset
  * @rmtoll USB3DRD         USB3DRDRST         LL_RCC_USB3DRD_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB3DRD_ReleaseReset(void)
{
  CLEAR_BIT(RCC->USB3DRDCFGR, RCC_USB3DRDCFGR_USB3DRDRST);
}
#endif /* RCC_USB3DRDCFGR_USB3DRDRST */


/**
  * @brief  Release USB2PHY reset
  * @rmtoll USB2PHY         USB2PHYRST         LL_RCC_USB2PHY_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB2PHY1_ReleaseReset(void)
{
  CLEAR_BIT(RCC->USB2PHY1CFGR, RCC_USB2PHY1CFGR_USB2PHY1RST);
}

/**
  * @brief  Release USB2PHY reset
  * @rmtoll USB2PHY         USB2PHYRST         LL_RCC_USB2PHY_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB2PHY2_ReleaseReset(void)
{
  CLEAR_BIT(RCC->USB2PHY2CFGR, RCC_USB2PHY2CFGR_USB2PHY2RST);
}

/**
  * @brief  Release FMC reset
  * @rmtoll FMC         FMCRST         LL_RCC_FMC_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_FMC_ReleaseReset(void)
{
  CLEAR_BIT(RCC->FMCCFGR, RCC_FMCCFGR_FMCRST);
}

/**
  * @brief  Release ETH1 reset
  * @rmtoll ETH1         ETH1RST         LL_RCC_ETH1_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ETH1_ReleaseReset(void)
{
  CLEAR_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1RST);
}

/**
  * @brief  Release ETH2 reset
  * @rmtoll ETH2         ETH2RST         LL_RCC_ETH2_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ETH2_ReleaseReset(void)
{
  CLEAR_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2RST);
}
#if defined(RCC_GPUCFGR_GPURST)
/**
  * @brief  Release GPU reset
  * @rmtoll GPU         GPURST         LL_RCC_GPU_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPU_ReleaseReset(void)
{
  CLEAR_BIT(RCC->GPUCFGR, RCC_GPUCFGR_GPURST);
}
#endif /* RCC_GPUCFGR_GPURST */
/**
  * @}
  */

/** @defgroup BUS_LL_EF_AHB6 AHB6
  * @{
  */

/**
  * @}
  */

