zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_bus.h
/** @defgroup BUS_LL_EF_AHSMARTRUN AHB Smartrun
  * @{
  */
#if defined(RCC_C3CFGR_C3EN)
/**
  * @brief  Enable C3CFGR,  peripheral clock
  * @rmtoll C3         C3EN         LL_RCC_C3_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_C3_EnableClock(void)
{
  SET_BIT(RCC->C3CFGR, RCC_C3CFGR_C3EN);
}
#endif /* RCC_C3CFGR_C3EN */

#if defined(RCC_LPDMACFGR_LPDMAEN)
/**
  * @brief  Enable LPDMA  peripheral clock
  * @rmtoll LPDMA         LPDMAEN         LL_RCC_LPDMA_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPDMA_EnableClock(void)
{
  SET_BIT(RCC->LPDMACFGR, RCC_LPDMACFGR_LPDMAEN);
}
#endif /* RCC_LPDMACFGR_LPDMAEN */

#if defined(RCC_LPSRAM2CFGR_LPSRAM2EN)
/**
  * @brief  Enable LPSRAM2  peripheral clock
  * @rmtoll LPSRAM2         LPSRAM2EN         LL_RCC_LPSRAM2_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPSRAM2_EnableClock(void)
{
  SET_BIT(RCC->LPSRAM2CFGR, RCC_LPSRAM2CFGR_LPSRAM2EN);
}
#endif /* RCC_LPSRAM2CFGR_LPSRAM2EN */

#if defined(RCC_LPSRAM1CFGR_LPSRAM1EN)
/**
  * @brief  Enable LPSRAM1  peripheral clock
  * @rmtoll LPSRAM1         LPSRAM1EN         LL_RCC_LPSRAM1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPSRAM1_EnableClock(void)
{
  SET_BIT(RCC->LPSRAM1CFGR, RCC_LPSRAM1CFGR_LPSRAM1EN);
}
#endif /* RCC_LPSRAM1CFGR_LPSRAM1EN */

#if defined(RCC_LPSRAM3CFGR_LPSRAM3EN)
/**
  * @brief  Enable LPSRAM3  peripheral clock
  * @rmtoll LPSRAM3         LPSRAM3EN         LL_RCC_LPSRAM3_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPSRAM3_EnableClock(void)
{
  SET_BIT(RCC->LPSRAM3CFGR, RCC_LPSRAM3CFGR_LPSRAM3EN);
}
#endif /* RCC_LPSRAM3CFGR_LPSRAM3EN */

#if defined(RCC_IPCC2CFGR_IPCC2EN)
/**
  * @brief  Enable IPCC2  peripheral clock
  * @rmtoll IPCC2         IPCC2EN         LL_RCC_IPCC2_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IPCC2_EnableClock(void)
{
  SET_BIT(RCC->IPCC2CFGR, RCC_IPCC2CFGR_IPCC2EN);
}
#endif /*RCC_IPCC2CFGR_IPCC2EN*/

#if defined(RCC_HSEMCFGR_HSEMEN)
/**
  * @brief  Enable HSEM  peripheral clock
  * @rmtoll HSEM         HSEMEN         LL_RCC_HSEM_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSEM_EnableClock(void)
{
  SET_BIT(RCC->HSEMCFGR, RCC_HSEMCFGR_HSEMEN);
}
#endif /* RCC_HSEMCFGR_HSEMEN */

#if defined(RCC_ADF1CFGR_ADF1EN)
/**
  * @brief  Enable ADF1  peripheral clock
  * @rmtoll ADF1         ADF1EN         LL_RCC_ADF1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADF1_EnableClock(void)
{
  SET_BIT(RCC->ADF1CFGR, RCC_ADF1CFGR_ADF1EN);
}
#endif /* RCC_ADF1CFGR_ADF1EN */
/**
  * @brief  Enable GPIOZ  peripheral clock
  * @rmtoll GPIOZ         GPIOZEN         LL_RCC_GPIOZ_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOZ_EnableClock(void)
{
  SET_BIT(RCC->GPIOZCFGR, RCC_GPIOZCFGR_GPIOZEN);
}

#if defined(RCC_C3CFGR_C3EN)
/**
  * @brief  Disable C3CFGR,  peripheral clock
  * @rmtoll C3         C3EN         LL_RCC_C3_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_C3_DisableClock(void)
{
  CLEAR_BIT(RCC->C3CFGR, RCC_C3CFGR_C3EN);
}
#endif /* RCC_C3CFGR_C3EN */

#if defined(RCC_LPDMACFGR_LPDMAEN)
/**
  * @brief  Disable LPDMA  peripheral clock
  * @rmtoll LPDMA         LPDMAEN         LL_RCC_LPDMA_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPDMA_DisableClock(void)
{
  CLEAR_BIT(RCC->LPDMACFGR, RCC_LPDMACFGR_LPDMAEN);
}
#endif /* RCC_LPDMACFGR_LPDMAEN */

#if defined(RCC_LPSRAM2CFGR_LPSRAM2EN)
/**
  * @brief  Disable LPSRAM2  peripheral clock
  * @rmtoll LPSRAM2         LPSRAM2EN         LL_RCC_LPSRAM2_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPSRAM2_DisableClock(void)
{
  CLEAR_BIT(RCC->LPSRAM2CFGR, RCC_LPSRAM2CFGR_LPSRAM2EN);
}
#endif /* RCC_LPSRAM2CFGR_LPSRAM2EN */

#if defined(RCC_LPSRAM1CFGR_LPSRAM1EN)
/**
  * @brief  Disable LPSRAM1  peripheral clock
  * @rmtoll LPSRAM1         LPSRAM1EN         LL_RCC_LPSRAM1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPSRAM1_DisableClock(void)
{
  CLEAR_BIT(RCC->LPSRAM1CFGR, RCC_LPSRAM1CFGR_LPSRAM1EN);
}
#endif /* RCC_LPSRAM1CFGR_LPSRAM1EN */

#if defined(RCC_LPSRAM3CFGR_LPSRAM3EN)
/**
  * @brief  Disable LPSRAM3  peripheral clock
  * @rmtoll LPSRAM3         LPSRAM3EN         LL_RCC_LPSRAM3_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPSRAM3_DisableClock(void)
{
  CLEAR_BIT(RCC->LPSRAM3CFGR, RCC_LPSRAM3CFGR_LPSRAM3EN);
}
#endif /* RCC_LPSRAM3CFGR_LPSRAM3EN */

#if defined(RCC_IPCC2CFGR_IPCC2EN)
/**
  * @brief  Disable IPCC2  peripheral clock
  * @rmtoll IPCC2         IPCC2EN         LL_RCC_IPCC2_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IPCC2_DisableClock(void)
{
  CLEAR_BIT(RCC->IPCC2CFGR, RCC_IPCC2CFGR_IPCC2EN);
}
#endif /* RCC_IPCC2CFGR_IPCC2EN */

#if defined(RCC_HSEMCFGR_HSEMEN)
/**
  * @brief  Disable HSEM  peripheral clock
  * @rmtoll HSEM         HSEMEN         LL_RCC_HSEM_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSEM_DisableClock(void)
{
  CLEAR_BIT(RCC->HSEMCFGR, RCC_HSEMCFGR_HSEMEN);
}
#endif /* RCC_HSEMCFGR_HSEMEN */

#if defined(RCC_ADF1CFGR_ADF1EN)
/**
  * @brief  Disable ADF1  peripheral clock
  * @rmtoll ADF1         ADF1EN         LL_RCC_ADF1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADF1_DisableClock(void)
{
  CLEAR_BIT(RCC->ADF1CFGR, RCC_ADF1CFGR_ADF1EN);
}
#endif /* RCC_ADF1CFGR_ADF1EN */
/**
  * @brief  Disable GPIOZ  peripheral clock
  * @rmtoll GPIOZ         GPIOZEN         LL_RCC_GPIOZ_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOZ_DisableClock(void)
{
  CLEAR_BIT(RCC->GPIOZCFGR, RCC_GPIOZCFGR_GPIOZEN);
}

#if defined(RCC_C3CFGR_C3LPEN)
/**
  * @brief  Enable C3CFGR, peripheral clocks enable during CSleep mode
  * @rmtoll C3         C3LPEN         LL_RCC_C3_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_C3_EnableClockSleep(void)
{
  SET_BIT(RCC->C3CFGR, RCC_C3CFGR_C3LPEN);
}
#endif /* RCC_C3CFGR_C3LPEN */

#if defined(RCC_LPDMACFGR_LPDMALPEN)
/**
  * @brief  Enable LPDMA peripheral clocks enable during CSleep mode
  * @rmtoll LPDMA         LPDMALPEN         LL_RCC_LPDMA_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPDMA_EnableClockSleep(void)
{
  SET_BIT(RCC->LPDMACFGR, RCC_LPDMACFGR_LPDMALPEN);
}
#endif /* RCC_LPDMACFGR_LPDMALPEN  */

#if defined(RCC_LPDMACFGR_LPDMAAMEN)
/**
  * @brief  Enable LPDMA peripheral clocks during Autonomous mode
  * @rmtoll LPDMA         LPDMAAMEN         LL_RCC_LPDMA_EnableClockAutonomous
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPDMA_EnableClockAutonomous(void)
{
  SET_BIT(RCC->LPDMACFGR, RCC_LPDMACFGR_LPDMAAMEN);
}
#endif /* RCC_LPDMACFGR_LPDMAAMEN */

#if defined(RCC_LPSRAM2CFGR_LPSRAM2LPEN)
/**
  * @brief  Enable LPSRAM2 peripheral clocks enable during CSleep mode
  * @rmtoll LPSRAM2         LPSRAM2LPEN         LL_RCC_LPSRAM2_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPSRAM2_EnableClockSleep(void)
{
  SET_BIT(RCC->LPSRAM2CFGR, RCC_LPSRAM2CFGR_LPSRAM2LPEN);
}
#endif /* RCC_LPSRAM2CFGR_LPSRAM2LPEN */

#if defined(RCC_LPSRAM1CFGR_LPSRAM1LPEN)
/**
  * @brief  Enable LPSRAM1 peripheral clocks enable during CSleep mode
  * @rmtoll LPSRAM1         LPSRAM1LPEN         LL_RCC_LPSRAM1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPSRAM1_EnableClockSleep(void)
{
  SET_BIT(RCC->LPSRAM1CFGR, RCC_LPSRAM1CFGR_LPSRAM1LPEN);
}
#endif /* RCC_LPSRAM1CFGR_LPSRAM1LPEN */

#if defined(RCC_LPSRAM3CFGR_LPSRAM3LPEN )
/**
  * @brief  Enable LPSRAM3 peripheral clocks enable during CSleep mode
  * @rmtoll LPSRAM3         LPSRAM3LPEN         LL_RCC_LPSRAM3_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPSRAM3_EnableClockSleep(void)
{
  SET_BIT(RCC->LPSRAM3CFGR, RCC_LPSRAM3CFGR_LPSRAM3LPEN);
}
#endif /* RCC_LPSRAM3CFGR_LPSRAM3LPEN */

#if defined(RCC_IPCC2CFGR_IPCC2LPEN)
/**
  * @brief  Enable IPCC2 peripheral clocks enable during CSleep mode
  * @rmtoll IPCC2         IPCC2LPEN         LL_RCC_IPCC2_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IPCC2_EnableClockSleep(void)
{
  SET_BIT(RCC->IPCC2CFGR, RCC_IPCC2CFGR_IPCC2LPEN);
}
#endif /* RCC_IPCC2CFGR_IPCC2LPEN */

#if defined(RCC_HSEMCFGR_HSEMLPEN)
/**
  * @brief  Enable HSEM peripheral clocks enable during CSleep mode
  * @rmtoll HSEM         HSEMLPEN         LL_RCC_HSEM_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSEM_EnableClockSleep(void)
{
  SET_BIT(RCC->HSEMCFGR, RCC_HSEMCFGR_HSEMLPEN);
}
#endif /* RCC_HSEMCFGR_HSEMLPEN */

