zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_bus.h
#if defined(RCC_ADF1CFGR_ADF1LPEN)
/**
  * @brief  Enable ADF1 peripheral clocks enable during CSleep mode
  * @rmtoll ADF1         ADF1LPEN         LL_RCC_ADF1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADF1_EnableClockSleep(void)
{
  SET_BIT(RCC->ADF1CFGR, RCC_ADF1CFGR_ADF1LPEN);
}
#endif /* RCC_ADF1CFGR_ADF1LPEN */
/**
  * @brief  Enable GPIOZ peripheral clocks enable during CSleep mode
  * @rmtoll GPIOZ         GPIOZLPEN         LL_RCC_GPIOZ_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOZ_EnableClockSleep(void)
{
  SET_BIT(RCC->GPIOZCFGR, RCC_GPIOZCFGR_GPIOZLPEN);
}

#if defined(RCC_C3CFGR_C3LPEN)
/**
  * @brief  Disable C3CFGR, peripheral clocks during CSleep mode
  * @rmtoll C3         C3LPEN         LL_RCC_C3_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_C3_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->C3CFGR, RCC_C3CFGR_C3LPEN);
}
#endif /*  RCC_C3CFGR_C3LPEN */

#if defined(RCC_LPDMACFGR_LPDMALPEN)
/**
  * @brief  Disable LPDMA peripheral clocks during CSleep mode
  * @rmtoll LPDMA         LPDMALPEN         LL_RCC_LPDMA_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPDMA_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->LPDMACFGR, RCC_LPDMACFGR_LPDMALPEN);
}
#endif /* RCC_LPDMACFGR_LPDMALPEN  */

#if defined(RCC_LPDMACFGR_LPDMAAMEN)
/**
  * @brief  Disable LPDMA peripheral clocks during Autonomous mode
  * @rmtoll LPDMA         LPDMAAMEN         LL_RCC_LPDMA_EnableClockAutonomous
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPDMA_DisableClockAutonomous(void)
{
  CLEAR_BIT(RCC->LPDMACFGR, RCC_LPDMACFGR_LPDMAAMEN);
}
#endif /* RCC_LPDMACFGR_LPDMAAMEN  */

#if defined(RCC_LPSRAM2CFGR_LPSRAM2LPEN)
/**
  * @brief  Disable LPSRAM2 peripheral clocks during CSleep mode
  * @rmtoll LPSRAM2         LPSRAM2LPEN         LL_RCC_LPSRAM2_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPSRAM2_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->LPSRAM2CFGR, RCC_LPSRAM2CFGR_LPSRAM2LPEN);
}
#endif /*  RCC_LPSRAM2CFGR_LPSRAM2LPEN */

#if defined(RCC_LPSRAM1CFGR_LPSRAM1LPEN)
/**
  * @brief  Disable LPSRAM1 peripheral clocks during CSleep mode
  * @rmtoll LPSRAM1         LPSRAM1LPEN         LL_RCC_LPSRAM1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPSRAM1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->LPSRAM1CFGR, RCC_LPSRAM1CFGR_LPSRAM1LPEN);
}
#endif /*  RCC_LPSRAM1CFGR_LPSRAM1LPEN */

#if defined(RCC_LPSRAM3CFGR_LPSRAM3LPEN)
/**
  * @brief  Disable LPSRAM3 peripheral clocks during CSleep mode
  * @rmtoll LPSRAM3         LPSRAM3LPEN         LL_RCC_LPSRAM3_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPSRAM3_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->LPSRAM3CFGR, RCC_LPSRAM3CFGR_LPSRAM3LPEN);
}
#endif /* RCC_LPSRAM3CFGR_LPSRAM3LPEN  */

#if defined(RCC_IPCC2CFGR_IPCC2LPEN)
/**
  * @brief  Disable IPCC2 peripheral clocks during CSleep mode
  * @rmtoll IPCC2         IPCC2LPEN         LL_RCC_IPCC2_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IPCC2_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->IPCC2CFGR, RCC_IPCC2CFGR_IPCC2LPEN);
}
#endif /* RCC_IPCC2CFGR_IPCC2LPEN  */

#if defined(RCC_HSEMCFGR_HSEMLPEN)
/**
  * @brief  Disable HSEM peripheral clocks during CSleep mode
  * @rmtoll HSEM         HSEMLPEN         LL_RCC_HSEM_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSEM_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->HSEMCFGR, RCC_HSEMCFGR_HSEMLPEN);
}
#endif /*  RCC_HSEMCFGR_HSEMLPEN */

#if defined(RCC_ADF1CFGR_ADF1LPEN)
/**
  * @brief  Disable ADF1 peripheral clocks during CSleep mode
  * @rmtoll ADF1         ADF1LPEN         LL_RCC_ADF1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADF1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->ADF1CFGR, RCC_ADF1CFGR_ADF1LPEN);
}
#endif /* RCC_ADF1CFGR_ADF1LPEN */
/**
  * @brief  Disable GPIOZ peripheral clocks during CSleep mode
  * @rmtoll GPIOZ         GPIOZLPEN         LL_RCC_GPIOZ_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOZ_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->GPIOZCFGR, RCC_GPIOZCFGR_GPIOZLPEN);
}

#if defined(RCC_C3CFGR_C3RST)
/**
  * @brief  Assert C3CFGR, reset
  * @rmtoll C3         C3RST         LL_RCC_C3_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_C3_ForceReset(void)
{
  SET_BIT(RCC->C3CFGR, RCC_C3CFGR_C3RST);
}
#endif /* RCC_C3CFGR_C3RST */

#if defined(RCC_LPDMACFGR_LPDMARST)
/**
  * @brief  Assert LPDMA reset
  * @rmtoll LPDMA         LPDMARST         LL_RCC_LPDMA_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPDMA_ForceReset(void)
{
  SET_BIT(RCC->LPDMACFGR, RCC_LPDMACFGR_LPDMARST);
}
#endif /* RCC_LPDMACFGR_LPDMARST */

#if defined(RCC_IPCC2CFGR_IPCC2RST)
/**
  * @brief  Assert IPCC2 reset
  * @rmtoll IPCC2         IPCC2RST         LL_RCC_IPCC2_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IPCC2_ForceReset(void)
{
  SET_BIT(RCC->IPCC2CFGR, RCC_IPCC2CFGR_IPCC2RST);
}
#endif /* RCC_IPCC2CFGR_IPCC2RST */

#if defined(RCC_HSEMCFGR_HSEMRST)
/**
  * @brief  Assert HSEM reset
  * @rmtoll HSEM         HSEMRST         LL_RCC_HSEM_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSEM_ForceReset(void)
{
  SET_BIT(RCC->HSEMCFGR, RCC_HSEMCFGR_HSEMRST);
}
#endif /* RCC_HSEMCFGR_HSEMRST */

#if defined(RCC_ADF1CFGR_ADF1RST)
/**
  * @brief  Assert ADF1 reset
  * @rmtoll ADF1         ADF1RST         LL_RCC_ADF1_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADF1_ForceReset(void)
{
  SET_BIT(RCC->ADF1CFGR, RCC_ADF1CFGR_ADF1RST);
}
#endif /* RCC_ADF1CFGR_ADF1RST */
/**
  * @brief  Assert GPIOZ reset
  * @rmtoll GPIOZ         GPIOZRST         LL_RCC_GPIOZ_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOZ_ForceReset(void)
{
  SET_BIT(RCC->GPIOZCFGR, RCC_GPIOZCFGR_GPIOZRST);
}

#if defined(RCC_C3CFGR_C3RST)
/**
  * @brief  Release C3CFGR, reset
  * @rmtoll C3         C3RST         LL_RCC_C3_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_C3_ReleaseReset(void)
{
  CLEAR_BIT(RCC->C3CFGR, RCC_C3CFGR_C3RST);
}
#endif /*  RCC_C3CFGR_C3RST */

