zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_bus.h
#if defined(RCC_LPDMACFGR_LPDMARST)
/**
  * @brief  Release LPDMA reset
  * @rmtoll LPDMA         LPDMARST         LL_RCC_LPDMA_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPDMA_ReleaseReset(void)
{
  CLEAR_BIT(RCC->LPDMACFGR, RCC_LPDMACFGR_LPDMARST);
}
#endif /* RCC_LPDMACFGR_LPDMARST  */

#if defined(RCC_IPCC2CFGR_IPCC2RST)
/**
  * @brief  Release IPCC2 reset
  * @rmtoll IPCC2         IPCC2RST         LL_RCC_IPCC2_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IPCC2_ReleaseReset(void)
{
  CLEAR_BIT(RCC->IPCC2CFGR, RCC_IPCC2CFGR_IPCC2RST);
}
#endif /*  RCC_IPCC2CFGR_IPCC2RST */

#if defined(RCC_HSEMCFGR_HSEMRST)
/**
  * @brief  Release HSEM reset
  * @rmtoll HSEM         HSEMRST         LL_RCC_HSEM_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSEM_ReleaseReset(void)
{
  CLEAR_BIT(RCC->HSEMCFGR, RCC_HSEMCFGR_HSEMRST);
}
#endif /* RCC_HSEMCFGR_HSEMRST  */

#if defined(RCC_ADF1CFGR_ADF1RST)
/**
  * @brief  Release ADF1 reset
  * @rmtoll ADF1         ADF1RST         LL_RCC_ADF1_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ADF1_ReleaseReset(void)
{
  CLEAR_BIT(RCC->ADF1CFGR, RCC_ADF1CFGR_ADF1RST);
}
#endif /* RCC_ADF1CFGR_ADF1RST */
/**
  * @brief  Release GPIOZ reset
  * @rmtoll GPIOZ         GPIOZRST         LL_RCC_GPIOZ_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GPIOZ_ReleaseReset(void)
{
  CLEAR_BIT(RCC->GPIOZCFGR, RCC_GPIOZCFGR_GPIOZRST);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_AXI AXI
  * @{
  */
#if defined(RCC_STMCFGR_STMEN)
/**
  * @brief  Enable STM  peripheral clock
  * @rmtoll STM         STMEN         LL_RCC_STM_EnableClock
  * @retval None
 */
__STATIC_INLINE void LL_RCC_STM_EnableClock(void)
{
  SET_BIT(RCC->STMCFGR, RCC_STMCFGR_STMEN);
}
#endif /* RCC_STMCFGR_STMEN */

#if defined(RCC_PCIECFGR_PCIEEN)
/**
  * @brief  Enable PCIE  peripheral clock
  * @rmtoll PCIE         PCIEEN         LL_RCC_PCIE_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PCIE_EnableClock(void)
{
  SET_BIT(RCC->PCIECFGR, RCC_PCIECFGR_PCIEEN);
}
#endif /* RCC_PCIECFGR_PCIEEN */

#if defined(RCC_CSICFGR_CSIEN)
/**
  * @brief  Enable CSI  peripheral clock
  * @rmtoll CSI         CSIEN         LL_RCC_CSI_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CSI_EnableClock(void)
{
  SET_BIT(RCC->CSICFGR, RCC_CSICFGR_CSIEN);
}
#endif /* RCC_CSICFGR_CSIEN */

#if defined(RCC_CSI2CFGR_CSI2EN)
/**
  * @brief  Enable CSI2  peripheral clock
  * @rmtoll CSI2         CSI2EN         LL_RCC_CSI2_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CSI2_EnableClock(void)
{
  SET_BIT(RCC->CSI2CFGR, RCC_CSI2CFGR_CSI2EN);
}
#endif /* RCC_CSI2CFGR_CSI2EN */

#if defined(RCC_STMCFGR_STMEN)
/**
  * @brief  Disable STM  peripheral clock
  * @rmtoll STM         STMEN         LL_RCC_STM_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_STM_DisableClock(void)
{
  CLEAR_BIT(RCC->STMCFGR, RCC_STMCFGR_STMEN);
}
#endif /* RCC_STMCFGR_STMEN */

#if defined(RCC_PCIECFGR_PCIEEN)
/**
  * @brief  Disable PCIE  peripheral clock
  * @rmtoll PCIE         PCIEEN         LL_RCC_PCIE_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PCIE_DisableClock(void)
{
  CLEAR_BIT(RCC->PCIECFGR, RCC_PCIECFGR_PCIEEN);
}
#endif /* RCC_PCIECFGR_PCIEEN */

#if defined(RCC_CSICFGR_CSIEN)
/**
  * @brief  Disable CSI  peripheral clock
  * @rmtoll CSI         CSIEN         LL_RCC_CSI_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CSI_DisableClock(void)
{
  CLEAR_BIT(RCC->CSICFGR, RCC_CSICFGR_CSIEN);
}
#endif /* RCC_CSICFGR_CSIEN */

#if defined(RCC_CSI2CFGR_CSI2EN)
/**
  * @brief  Disable CSI2  peripheral clock
  * @rmtoll CSI2         CSI2EN         LL_RCC_CSI2_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CSI2_DisableClock(void)
{
  CLEAR_BIT(RCC->CSI2CFGR, RCC_CSI2CFGR_CSI2EN);
}
#endif /* RCC_CSI2CFGR_CSI2EN */

#if defined(RCC_STMCFGR_STMLPEN)
/**
  * @brief  Enable STM peripheral clocks enable during CSleep mode
  * @rmtoll STM         STMLPEN         LL_RCC_STM_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_STM_EnableClockSleep(void)
{
  SET_BIT(RCC->STMCFGR, RCC_STMCFGR_STMLPEN);
}
#endif /* RCC_STMCFGR_STMLPEN */

#if defined(RCC_PCIECFGR_PCIELPEN)
/**
  * @brief  Enable PCIE peripheral clocks enable during CSleep mode
  * @rmtoll PCIE         PCIELPEN         LL_RCC_PCIE_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PCIE_EnableClockSleep(void)
{
  SET_BIT(RCC->PCIECFGR, RCC_PCIECFGR_PCIELPEN);
}
#endif /* RCC_PCIECFGR_PCIELPEN */

#if defined(RCC_CSICFGR_CSILPEN)
/**
  * @brief  Enable CSI peripheral clocks enable during CSleep mode
  * @rmtoll CSI         CSILPEN         LL_RCC_CSI_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CSI_EnableClockSleep(void)
{
  SET_BIT(RCC->CSICFGR, RCC_CSICFGR_CSILPEN);
}
#endif /* RCC_CSICFGR_CSILPEN */

#if defined(RCC_CSI2CFGR_CSI2LPEN)
/**
  * @brief  Enable CSI2 peripheral clocks enable during CSleep mode
  * @rmtoll CSI2         CSI2LPEN         LL_RCC_CSI2_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CSI2_EnableClockSleep(void)
{
  SET_BIT(RCC->CSI2CFGR, RCC_CSI2CFGR_CSI2LPEN);
}
#endif /* RCC_CSI2CFGR_CSI2LPEN */

#if defined(RCC_STMCFGR_STMLPEN)
/**
  * @brief  Disable STM peripheral clocks during CSleep mode
  * @rmtoll STM         STMLPEN         LL_RCC_STM_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_STM_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->STMCFGR, RCC_STMCFGR_STMLPEN);
}
#endif /* RCC_STMCFGR_STMLPEN */

#if defined(RCC_PCIECFGR_PCIELPEN)
/**
  * @brief  Disable PCIE peripheral clocks during CSleep mode
  * @rmtoll PCIE         PCIELPEN         LL_RCC_PCIE_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PCIE_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->PCIECFGR, RCC_PCIECFGR_PCIELPEN);
}
#endif /* RCC_PCIECFGR_PCIELPEN */

#if defined(RCC_CSICFGR_CSILPEN)
/**
  * @brief  Disable CSI peripheral clocks during CSleep mode
  * @rmtoll CSI         CSILPEN         LL_RCC_CSI_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CSI_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->CSICFGR, RCC_CSICFGR_CSILPEN);
}
#endif /* RCC_CSICFGR_CSILPEN */

#if defined(RCC_CSI2CFGR_CSI2LPEN)
/**
  * @brief  Disable CSI2 peripheral clocks during CSleep mode
  * @rmtoll CSI2         CSI2LPEN         LL_RCC_CSI2_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CSI2_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->CSI2CFGR, RCC_CSI2CFGR_CSI2LPEN);
}
#endif /* RCC_CSI2CFGR_CSI2LPEN */

