zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_bus.h
#if defined(RCC_PCIECFGR_PCIERST)
/**
  * @brief  Assert PCIE reset
  * @rmtoll PCIE         PCIERST         LL_RCC_PCIE_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PCIE_ForceReset(void)
{
  SET_BIT(RCC->PCIECFGR, RCC_PCIECFGR_PCIERST);
}
#endif /* RCC_PCIECFGR_PCIERST */

#if defined(RCC_CSICFGR_CSIRST)
/**
  * @brief  Assert CSI reset
  * @rmtoll CSI         CSIRST         LL_RCC_CSI_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CSI_ForceReset(void)
{
  SET_BIT(RCC->CSICFGR, RCC_CSICFGR_CSIRST);
}
#endif /* RCC_CSICFGR_CSIRST */

#if defined(RCC_CSI2CFGR_CSI2RST)
/**
  * @brief  Assert CSI2 reset
  * @rmtoll CSI2         CSI2RST         LL_RCC_CSI2_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CSI2_ForceReset(void)
{
  SET_BIT(RCC->CSI2CFGR, RCC_CSI2CFGR_CSI2RST);
}
#endif /* RCC_CSI2CFGR_CSI2RST */

#if defined(RCC_PCIECFGR_PCIERST)
/**
  * @brief  Release PCIE reset
  * @rmtoll PCIE         PCIERST         LL_RCC_PCIE_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PCIE_ReleaseReset(void)
{
  CLEAR_BIT(RCC->PCIECFGR, RCC_PCIECFGR_PCIERST);
}
#endif /* RCC_PCIECFGR_PCIERST */

#if defined(RCC_CSICFGR_CSIRST)
/**
  * @brief  Release CSI reset
  * @rmtoll CSI         CSIRST         LL_RCC_CSI_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CSI_ReleaseReset(void)
{
  CLEAR_BIT(RCC->CSICFGR, RCC_CSICFGR_CSIRST);
}
#endif /* RCC_CSICFGR_CSIRST */

#if defined(RCC_CSI2CFGR_CSI2RST)
/**
  * @brief  Release CSI2 reset
  * @rmtoll CSI2         CSI2RST         LL_RCC_CSI2_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CSI2_ReleaseReset(void)
{
  CLEAR_BIT(RCC->CSI2CFGR, RCC_CSI2CFGR_CSI2RST);
}
#endif /* RCC_CSI2CFGR_CSI2RST */

/**
  * @}
  */

/** @defgroup BUS_LL_EF_MLAHB MLAHB
  * @{
  */
/**
  * @brief  Enable SRAM1  peripheral clock
  * @rmtoll SRAM1         SRAM1EN         LL_RCC_SRAM1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SRAM1_EnableClock(void)
{
  SET_BIT(RCC->SRAM1CFGR, RCC_SRAM1CFGR_SRAM1EN);
}

#if defined(RCC_SRAM2CFGR_SRAM2EN)
/**
  * @brief  Enable SRAM2  peripheral clock
  * @rmtoll SRAM2         SRAM2EN         LL_RCC_SRAM2_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SRAM2_EnableClock(void)
{
  SET_BIT(RCC->SRAM2CFGR, RCC_SRAM2CFGR_SRAM2EN);
}
#endif /* RCC_SRAM2CFGR_SRAM2EN */

/**
  * @brief  Enable RETRAM  peripheral clock
  * @rmtoll RETRAM         RETRAMEN         LL_RCC_RETRAM_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RETRAM_EnableClock(void)
{
  SET_BIT(RCC->RETRAMCFGR, RCC_RETRAMCFGR_RETRAMEN);
}

/**
  * @brief  Enable OSPI1  peripheral clock
  * @rmtoll OSPI1         OSPI1EN         LL_RCC_OSPI1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_OSPI1_EnableClock(void)
{
  SET_BIT(RCC->OSPI1CFGR, RCC_OSPI1CFGR_OSPI1EN);
}
#if defined(RCC_OSPI2CFGR_OSPI2EN)
/**
  * @brief  Enable OSPI2  peripheral clock
  * @rmtoll OSPI2         OSPI2EN         LL_RCC_OSPI2_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_OSPI2_EnableClock(void)
{
  SET_BIT(RCC->OSPI2CFGR, RCC_OSPI2CFGR_OSPI2EN);
}
#endif /* RCC_OSPI2CFGR_OSPI2EN */
/**
  * @brief  Disable SRAM1  peripheral clock
  * @rmtoll SRAM1         SRAM1EN         LL_RCC_SRAM1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SRAM1_DisableClock(void)
{
  CLEAR_BIT(RCC->SRAM1CFGR, RCC_SRAM1CFGR_SRAM1EN);
}

#if defined(RCC_SRAM2CFGR_SRAM2EN)
/**
  * @brief  Disable SRAM2  peripheral clock
  * @rmtoll SRAM2         SRAM2EN         LL_RCC_SRAM2_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SRAM2_DisableClock(void)
{
  CLEAR_BIT(RCC->SRAM2CFGR, RCC_SRAM2CFGR_SRAM2EN);
}
#endif /* RCC_SRAM2CFGR_SRAM2EN */

/**
  * @brief  Disable RETRAM  peripheral clock
  * @rmtoll RETRAM         RETRAMEN         LL_RCC_RETRAM_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RETRAM_DisableClock(void)
{
  CLEAR_BIT(RCC->RETRAMCFGR, RCC_RETRAMCFGR_RETRAMEN);
}

/**
  * @brief  Disable OSPI1  peripheral clock
  * @rmtoll OSPI1         OSPI1EN         LL_RCC_OSPI1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_OSPI1_DisableClock(void)
{
  CLEAR_BIT(RCC->OSPI1CFGR, RCC_OSPI1CFGR_OSPI1EN);
}
#if defined(RCC_OSPI2CFGR_OSPI2EN)
/**
  * @brief  Disable OSPI2  peripheral clock
  * @rmtoll OSPI2         OSPI2EN         LL_RCC_OSPI2_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_OSPI2_DisableClock(void)
{
  CLEAR_BIT(RCC->OSPI2CFGR, RCC_OSPI2CFGR_OSPI2EN);
}
#endif /* RCC_OSPI2CFGR_OSPI2EN */
/**
  * @brief  Enable SRAM1 peripheral clocks enable during CSleep mode
  * @rmtoll SRAM1         SRAM1LPEN         LL_RCC_SRAM1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SRAM1_EnableClockSleep(void)
{
  SET_BIT(RCC->SRAM1CFGR, RCC_SRAM1CFGR_SRAM1LPEN);
}

#if defined(RCC_SRAM2CFGR_SRAM2LPEN)
/**
  * @brief  Enable SRAM2 peripheral clocks enable during CSleep mode
  * @rmtoll SRAM2         SRAM2LPEN         LL_RCC_SRAM2_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SRAM2_EnableClockSleep(void)
{
  SET_BIT(RCC->SRAM2CFGR, RCC_SRAM2CFGR_SRAM2LPEN);
}
#endif /* RCC_SRAM2CFGR_SRAM2LPEN */

/**
  * @brief  Enable RETRAM peripheral clocks enable during CSleep mode
  * @rmtoll RETRAM         RETRAMLPEN         LL_RCC_RETRAM_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RETRAM_EnableClockSleep(void)
{
  SET_BIT(RCC->RETRAMCFGR, RCC_RETRAMCFGR_RETRAMLPEN);
}

/**
  * @brief  Enable OSPI1 peripheral clocks enable during CSleep mode
  * @rmtoll OSPI1         OSPI1LPEN         LL_RCC_OSPI1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_OSPI1_EnableClockSleep(void)
{
  SET_BIT(RCC->OSPI1CFGR, RCC_OSPI1CFGR_OSPI1LPEN);
}
#if defined(RCC_OSPI2CFGR_OSPI2LPEN)
/**
  * @brief  Enable OSPI2 peripheral clocks enable during CSleep mode
  * @rmtoll OSPI2         OSPI2LPEN         LL_RCC_OSPI2_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_OSPI2_EnableClockSleep(void)
{
  SET_BIT(RCC->OSPI2CFGR, RCC_OSPI2CFGR_OSPI2LPEN);
}
#endif /* RCC_OSPI2CFGR_OSPI2LPEN */
/**
  * @brief  Disable SRAM1 peripheral clocks during CSleep mode
  * @rmtoll SRAM1         SRAM1LPEN         LL_RCC_SRAM1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SRAM1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->SRAM1CFGR, RCC_SRAM1CFGR_SRAM1LPEN);
}

#if defined(RCC_SRAM2CFGR_SRAM2LPEN)
/**
  * @brief  Disable SRAM2 peripheral clocks during CSleep mode
  * @rmtoll SRAM2         SRAM2LPEN         LL_RCC_SRAM2_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SRAM2_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->SRAM2CFGR, RCC_SRAM2CFGR_SRAM2LPEN);
}
#endif /* RCC_SRAM2CFGR_SRAM2LPEN */

/**
  * @brief  Disable RETRAM peripheral clocks during CSleep mode
  * @rmtoll RETRAM         RETRAMLPEN         LL_RCC_RETRAM_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RETRAM_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->RETRAMCFGR, RCC_RETRAMCFGR_RETRAMLPEN);
}

/**
  * @brief  Disable OSPI1 peripheral clocks during CSleep mode
  * @rmtoll OSPI1         OSPI1LPEN         LL_RCC_OSPI1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_OSPI1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->OSPI1CFGR, RCC_OSPI1CFGR_OSPI1LPEN);
}
#if defined(RCC_OSPI2CFGR_OSPI2LPEN)
/**
  * @brief  Disable OSPI2 peripheral clocks during CSleep mode
  * @rmtoll OSPI2         OSPI2LPEN         LL_RCC_OSPI2_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_OSPI2_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->OSPI2CFGR, RCC_OSPI2CFGR_OSPI2LPEN);
}
#endif /* RCC_OSPI2CFGR_OSPI2LPEN */
/**
  * @brief  Assert OSPI1 reset
  * @rmtoll OSPI1         OSPI1RST         LL_RCC_OSPI1_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_OSPI1_ForceReset(void)
{
  SET_BIT(RCC->OSPI1CFGR, RCC_OSPI1CFGR_OSPI1RST);
}
#if defined(RCC_OSPI2CFGR_OSPI2RST)
/**
  * @brief  Assert OSPI2 reset
  * @rmtoll OSPI2         OSPI2RST         LL_RCC_OSPI2_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_OSPI2_ForceReset(void)
{
  SET_BIT(RCC->OSPI2CFGR, RCC_OSPI2CFGR_OSPI2RST);
}
#endif /* RCC_OSPI2CFGR_OSPI2RST */
/**
  * @brief  Release OSPI1 reset
  * @rmtoll OSPI1         OSPI1RST         LL_RCC_OSPI1_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_OSPI1_ReleaseReset(void)
{
  CLEAR_BIT(RCC->OSPI1CFGR, RCC_OSPI1CFGR_OSPI1RST);
}
#if defined(RCC_OSPI2CFGR_OSPI2RST)
/**
  * @brief  Release OSPI2 reset
  * @rmtoll OSPI2         OSPI2RST         LL_RCC_OSPI2_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_OSPI2_ReleaseReset(void)
{
  CLEAR_BIT(RCC->OSPI2CFGR, RCC_OSPI2CFGR_OSPI2RST);
}
#endif /* RCC_OSPI2CFGR_OSPI2RST */
/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB1 APB1
  * @{
  */
/**
  * @brief  Enable TIM11  peripheral clock
  * @rmtoll TIM11         TIM11EN         LL_RCC_TIM11_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM11_EnableClock(void)
{
  SET_BIT(RCC->TIM11CFGR, RCC_TIM11CFGR_TIM11EN);
}

/**
  * @brief  Enable TIM10  peripheral clock
  * @rmtoll TIM10         TIM10EN         LL_RCC_TIM10_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM10_EnableClock(void)
{
  SET_BIT(RCC->TIM10CFGR, RCC_TIM10CFGR_TIM10EN);
}

/**
  * @brief  Enable I3C2  peripheral clock
  * @rmtoll I3C2         I3C2EN         LL_RCC_I3C2_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C2_EnableClock(void)
{
  SET_BIT(RCC->I3C2CFGR, RCC_I3C2CFGR_I3C2EN);
}

#if defined(RCC_I3C3CFGR_I3C3EN)
/**
  * @brief  Enable I3C3  peripheral clock
  * @rmtoll I3C3         I3C3EN         LL_RCC_I3C3_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C3_EnableClock(void)
{
  SET_BIT(RCC->I3C3CFGR, RCC_I3C3CFGR_I3C3EN);
}
#endif /* RCC_I3C3CFGR_I3C3EN */

#if defined(RCC_I2C7CFGR_I2C7EN)
/**
  * @brief  Enable I2C7  peripheral clock
  * @rmtoll I2C7         I2C7EN         LL_RCC_I2C7_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C7_EnableClock(void)
{
  SET_BIT(RCC->I2C7CFGR, RCC_I2C7CFGR_I2C7EN);
}
#endif /* RCC_I2C7CFGR_I2C7EN */

/**
  * @brief  Enable I3C1  peripheral clock
  * @rmtoll I3C1         I3C1EN         LL_RCC_I3C1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C1_EnableClock(void)
{
  SET_BIT(RCC->I3C1CFGR, RCC_I3C1CFGR_I3C1EN);
}

#if defined(RCC_I2C5CFGR_I2C5EN)
/**
  * @brief  Enable I2C5  peripheral clock
  * @rmtoll I2C5         I2C5EN         LL_RCC_I2C5_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C5_EnableClock(void)
{
  SET_BIT(RCC->I2C5CFGR, RCC_I2C5CFGR_I2C5EN);
}
#endif /* RCC_I2C5CFGR_I2C5EN */

#if defined(RCC_I2C6CFGR_I2C6EN)
/**
  * @brief  Enable I2C6  peripheral clock
  * @rmtoll I2C6         I2C6EN         LL_RCC_I2C6_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C6_EnableClock(void)
{
  SET_BIT(RCC->I2C6CFGR, RCC_I2C6CFGR_I2C6EN);
}
#endif /* RCC_I2C6CFGR_I2C6EN */

#if defined(RCC_I2C3CFGR_I2C3EN)
/**
  * @brief  Enable I2C3  peripheral clock
  * @rmtoll I2C3         I2C3EN         LL_RCC_I2C3_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C3_EnableClock(void)
{
  SET_BIT(RCC->I2C3CFGR, RCC_I2C3CFGR_I2C3EN);
}
#endif /* RCC_I2C3CFGR_I2C3EN */

#if defined(RCC_I2C4CFGR_I2C4EN)
/**
  * @brief  Enable I2C4  peripheral clock
  * @rmtoll I2C4         I2C4EN         LL_RCC_I2C4_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C4_EnableClock(void)
{
  SET_BIT(RCC->I2C4CFGR, RCC_I2C4CFGR_I2C4EN);
}
#endif /* RCC_I2C4CFGR_I2C4EN */

/**
  * @brief  Enable I2C1  peripheral clock
  * @rmtoll I2C1         I2C1EN         LL_RCC_I2C1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C1_EnableClock(void)
{
  SET_BIT(RCC->I2C1CFGR, RCC_I2C1CFGR_I2C1EN);
}

/**
  * @brief  Enable I2C2  peripheral clock
  * @rmtoll I2C2         I2C2EN         LL_RCC_I2C2_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C2_EnableClock(void)
{
  SET_BIT(RCC->I2C2CFGR, RCC_I2C2CFGR_I2C2EN);
}

/**
  * @brief  Enable UART4  peripheral clock
  * @rmtoll UART4         UART4EN         LL_RCC_UART4_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART4_EnableClock(void)
{
  SET_BIT(RCC->UART4CFGR, RCC_UART4CFGR_UART4EN);
}

/**
  * @brief  Enable UART5  peripheral clock
  * @rmtoll UART5         UART5EN         LL_RCC_UART5_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART5_EnableClock(void)
{
  SET_BIT(RCC->UART5CFGR, RCC_UART5CFGR_UART5EN);
}

/**
  * @brief  Enable USART2  peripheral clock
  * @rmtoll USART2         USART2EN         LL_RCC_USART2_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART2_EnableClock(void)
{
  SET_BIT(RCC->USART2CFGR, RCC_USART2CFGR_USART2EN);
}

/**
  * @brief  Enable USART3  peripheral clock
  * @rmtoll USART3         USART3EN         LL_RCC_USART3_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART3_EnableClock(void)
{
  SET_BIT(RCC->USART3CFGR, RCC_USART3CFGR_USART3EN);
}

/**
  * @brief  Enable SPI3  peripheral clock
  * @rmtoll SPI3         SPI3EN         LL_RCC_SPI3_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI3_EnableClock(void)
{
  SET_BIT(RCC->SPI3CFGR, RCC_SPI3CFGR_SPI3EN);
}

/**
  * @brief  Enable SPDIFRX  peripheral clock
  * @rmtoll SPDIFRX         SPDIFRXEN         LL_RCC_SPDIFRX_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPDIFRX_EnableClock(void)
{
  SET_BIT(RCC->SPDIFRXCFGR, RCC_SPDIFRXCFGR_SPDIFRXEN);
}

/**
  * @brief  Enable LPTIM2  peripheral clock
  * @rmtoll LPTIM2         LPTIM2EN         LL_RCC_LPTIM2_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM2_EnableClock(void)
{
  SET_BIT(RCC->LPTIM2CFGR, RCC_LPTIM2CFGR_LPTIM2EN);
}

/**
  * @brief  Enable SPI2  peripheral clock
  * @rmtoll SPI2         SPI2EN         LL_RCC_SPI2_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI2_EnableClock(void)
{
  SET_BIT(RCC->SPI2CFGR, RCC_SPI2CFGR_SPI2EN);
}

/**
  * @brief  Enable TIM14  peripheral clock
  * @rmtoll TIM14         TIM14EN         LL_RCC_TIM14_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM14_EnableClock(void)
{
  SET_BIT(RCC->TIM14CFGR, RCC_TIM14CFGR_TIM14EN);
}

/**
  * @brief  Enable LPTIM1  peripheral clock
  * @rmtoll LPTIM1         LPTIM1EN         LL_RCC_LPTIM1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM1_EnableClock(void)
{
  SET_BIT(RCC->LPTIM1CFGR, RCC_LPTIM1CFGR_LPTIM1EN);
}

/**
  * @brief  Enable TIM12  peripheral clock
  * @rmtoll TIM12         TIM12EN         LL_RCC_TIM12_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM12_EnableClock(void)
{
  SET_BIT(RCC->TIM12CFGR, RCC_TIM12CFGR_TIM12EN);
}

/**
  * @brief  Enable TIM13  peripheral clock
  * @rmtoll TIM13         TIM13EN         LL_RCC_TIM13_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM13_EnableClock(void)
{
  SET_BIT(RCC->TIM13CFGR, RCC_TIM13CFGR_TIM13EN);
}

/**
  * @brief  Enable TIM6  peripheral clock
  * @rmtoll TIM6         TIM6EN         LL_RCC_TIM6_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM6_EnableClock(void)
{
  SET_BIT(RCC->TIM6CFGR, RCC_TIM6CFGR_TIM6EN);
}

/**
  * @brief  Enable TIM7  peripheral clock
  * @rmtoll TIM7         TIM7EN         LL_RCC_TIM7_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM7_EnableClock(void)
{
  SET_BIT(RCC->TIM7CFGR, RCC_TIM7CFGR_TIM7EN);
}

/**
  * @brief  Enable TIM4  peripheral clock
  * @rmtoll TIM4         TIM4EN         LL_RCC_TIM4_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM4_EnableClock(void)
{
  SET_BIT(RCC->TIM4CFGR, RCC_TIM4CFGR_TIM4EN);
}

/**
  * @brief  Enable TIM5  peripheral clock
  * @rmtoll TIM5         TIM5EN         LL_RCC_TIM5_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM5_EnableClock(void)
{
  SET_BIT(RCC->TIM5CFGR, RCC_TIM5CFGR_TIM5EN);
}

/**
  * @brief  Enable TIM2  peripheral clock
  * @rmtoll TIM2         TIM2EN         LL_RCC_TIM2_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM2_EnableClock(void)
{
  SET_BIT(RCC->TIM2CFGR, RCC_TIM2CFGR_TIM2EN);
}

/**
  * @brief  Enable TIM3  peripheral clock
  * @rmtoll TIM3         TIM3EN         LL_RCC_TIM3_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM3_EnableClock(void)
{
  SET_BIT(RCC->TIM3CFGR, RCC_TIM3CFGR_TIM3EN);
}

/**
  * @brief  Disable TIM11  peripheral clock
  * @rmtoll TIM11         TIM11EN         LL_RCC_TIM11_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM11_DisableClock(void)
{
  CLEAR_BIT(RCC->TIM11CFGR, RCC_TIM11CFGR_TIM11EN);
}

/**
  * @brief  Disable TIM10  peripheral clock
  * @rmtoll TIM10         TIM10EN         LL_RCC_TIM10_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM10_DisableClock(void)
{
  CLEAR_BIT(RCC->TIM10CFGR, RCC_TIM10CFGR_TIM10EN);
}

/**
  * @brief  Disable I3C2  peripheral clock
  * @rmtoll I3C2         I3C2EN         LL_RCC_I3C2_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C2_DisableClock(void)
{
  CLEAR_BIT(RCC->I3C2CFGR, RCC_I3C2CFGR_I3C2EN);
}

#if defined(RCC_I3C3CFGR_I3C3EN)
/**
  * @brief  Disable I3C3  peripheral clock
  * @rmtoll I3C3         I3C3EN         LL_RCC_I3C3_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C3_DisableClock(void)
{
  CLEAR_BIT(RCC->I3C3CFGR, RCC_I3C3CFGR_I3C3EN);
}
#endif /* RCC_I3C3CFGR_I3C3EN */

#if defined(RCC_I2C7CFGR_I2C7EN)
/**
  * @brief  Disable I2C7  peripheral clock
  * @rmtoll I2C7         I2C7EN         LL_RCC_I2C7_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C7_DisableClock(void)
{
  CLEAR_BIT(RCC->I2C7CFGR, RCC_I2C7CFGR_I2C7EN);
}
#endif /* RCC_I2C7CFGR_I2C7EN */

/**
  * @brief  Disable I3C1  peripheral clock
  * @rmtoll I3C1         I3C1EN         LL_RCC_I3C1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C1_DisableClock(void)
{
  CLEAR_BIT(RCC->I3C1CFGR, RCC_I3C1CFGR_I3C1EN);
}

#if defined(RCC_I2C5CFGR_I2C5EN)
/**
  * @brief  Disable I2C5  peripheral clock
  * @rmtoll I2C5         I2C5EN         LL_RCC_I2C5_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C5_DisableClock(void)
{
  CLEAR_BIT(RCC->I2C5CFGR, RCC_I2C5CFGR_I2C5EN);
}
#endif /* RCC_I2C5CFGR_I2C5EN */

#if defined(RCC_I2C6CFGR_I2C6EN)
/**
  * @brief  Disable I2C6  peripheral clock
  * @rmtoll I2C6         I2C6EN         LL_RCC_I2C6_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C6_DisableClock(void)
{
  CLEAR_BIT(RCC->I2C6CFGR, RCC_I2C6CFGR_I2C6EN);
}
#endif /* RCC_I2C6CFGR_I2C6EN */

#if defined(RCC_I2C3CFGR_I2C3EN)
/**
  * @brief  Disable I2C3  peripheral clock
  * @rmtoll I2C3         I2C3EN         LL_RCC_I2C3_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C3_DisableClock(void)
{
  CLEAR_BIT(RCC->I2C3CFGR, RCC_I2C3CFGR_I2C3EN);
}
#endif /* RCC_I2C3CFGR_I2C3EN */

#if defined(RCC_I2C4CFGR_I2C4EN)
/**
  * @brief  Disable I2C4  peripheral clock
  * @rmtoll I2C4         I2C4EN         LL_RCC_I2C4_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C4_DisableClock(void)
{
  CLEAR_BIT(RCC->I2C4CFGR, RCC_I2C4CFGR_I2C4EN);
}
#endif /* RCC_I2C4CFGR_I2C4EN */

/**
  * @brief  Disable I2C1  peripheral clock
  * @rmtoll I2C1         I2C1EN         LL_RCC_I2C1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C1_DisableClock(void)
{
  CLEAR_BIT(RCC->I2C1CFGR, RCC_I2C1CFGR_I2C1EN);
}

/**
  * @brief  Disable I2C2  peripheral clock
  * @rmtoll I2C2         I2C2EN         LL_RCC_I2C2_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C2_DisableClock(void)
{
  CLEAR_BIT(RCC->I2C2CFGR, RCC_I2C2CFGR_I2C2EN);
}

/**
  * @brief  Disable UART4  peripheral clock
  * @rmtoll UART4         UART4EN         LL_RCC_UART4_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART4_DisableClock(void)
{
  CLEAR_BIT(RCC->UART4CFGR, RCC_UART4CFGR_UART4EN);
}

/**
  * @brief  Disable UART5  peripheral clock
  * @rmtoll UART5         UART5EN         LL_RCC_UART5_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART5_DisableClock(void)
{
  CLEAR_BIT(RCC->UART5CFGR, RCC_UART5CFGR_UART5EN);
}

/**
  * @brief  Disable USART2  peripheral clock
  * @rmtoll USART2         USART2EN         LL_RCC_USART2_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART2_DisableClock(void)
{
  CLEAR_BIT(RCC->USART2CFGR, RCC_USART2CFGR_USART2EN);
}

/**
  * @brief  Disable USART3  peripheral clock
  * @rmtoll USART3         USART3EN         LL_RCC_USART3_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART3_DisableClock(void)
{
  CLEAR_BIT(RCC->USART3CFGR, RCC_USART3CFGR_USART3EN);
}

/**
  * @brief  Disable SPI3  peripheral clock
  * @rmtoll SPI3         SPI3EN         LL_RCC_SPI3_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI3_DisableClock(void)
{
  CLEAR_BIT(RCC->SPI3CFGR, RCC_SPI3CFGR_SPI3EN);
}

/**
  * @brief  Disable SPDIFRX  peripheral clock
  * @rmtoll SPDIFRX         SPDIFRXEN         LL_RCC_SPDIFRX_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPDIFRX_DisableClock(void)
{
  CLEAR_BIT(RCC->SPDIFRXCFGR, RCC_SPDIFRXCFGR_SPDIFRXEN);
}

/**
  * @brief  Disable LPTIM2  peripheral clock
  * @rmtoll LPTIM2         LPTIM2EN         LL_RCC_LPTIM2_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM2_DisableClock(void)
{
  CLEAR_BIT(RCC->LPTIM2CFGR, RCC_LPTIM2CFGR_LPTIM2EN);
}

/**
  * @brief  Disable SPI2  peripheral clock
  * @rmtoll SPI2         SPI2EN         LL_RCC_SPI2_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI2_DisableClock(void)
{
  CLEAR_BIT(RCC->SPI2CFGR, RCC_SPI2CFGR_SPI2EN);
}

/**
  * @brief  Disable TIM14  peripheral clock
  * @rmtoll TIM14         TIM14EN         LL_RCC_TIM14_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM14_DisableClock(void)
{
  CLEAR_BIT(RCC->TIM14CFGR, RCC_TIM14CFGR_TIM14EN);
}

/**
  * @brief  Disable LPTIM1  peripheral clock
  * @rmtoll LPTIM1         LPTIM1EN         LL_RCC_LPTIM1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM1_DisableClock(void)
{
  CLEAR_BIT(RCC->LPTIM1CFGR, RCC_LPTIM1CFGR_LPTIM1EN);
}

/**
  * @brief  Disable TIM12  peripheral clock
  * @rmtoll TIM12         TIM12EN         LL_RCC_TIM12_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM12_DisableClock(void)
{
  CLEAR_BIT(RCC->TIM12CFGR, RCC_TIM12CFGR_TIM12EN);
}

/**
  * @brief  Disable TIM13  peripheral clock
  * @rmtoll TIM13         TIM13EN         LL_RCC_TIM13_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM13_DisableClock(void)
{
  CLEAR_BIT(RCC->TIM13CFGR, RCC_TIM13CFGR_TIM13EN);
}

/**
  * @brief  Disable TIM6  peripheral clock
  * @rmtoll TIM6         TIM6EN         LL_RCC_TIM6_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM6_DisableClock(void)
{
  CLEAR_BIT(RCC->TIM6CFGR, RCC_TIM6CFGR_TIM6EN);
}

/**
  * @brief  Disable TIM7  peripheral clock
  * @rmtoll TIM7         TIM7EN         LL_RCC_TIM7_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM7_DisableClock(void)
{
  CLEAR_BIT(RCC->TIM7CFGR, RCC_TIM7CFGR_TIM7EN);
}

/**
  * @brief  Disable TIM4  peripheral clock
  * @rmtoll TIM4         TIM4EN         LL_RCC_TIM4_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM4_DisableClock(void)
{
  CLEAR_BIT(RCC->TIM4CFGR, RCC_TIM4CFGR_TIM4EN);
}

/**
  * @brief  Disable TIM5  peripheral clock
  * @rmtoll TIM5         TIM5EN         LL_RCC_TIM5_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM5_DisableClock(void)
{
  CLEAR_BIT(RCC->TIM5CFGR, RCC_TIM5CFGR_TIM5EN);
}

/**
  * @brief  Disable TIM2  peripheral clock
  * @rmtoll TIM2         TIM2EN         LL_RCC_TIM2_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM2_DisableClock(void)
{
  CLEAR_BIT(RCC->TIM2CFGR, RCC_TIM2CFGR_TIM2EN);
}

