zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_bus.h
/**
  * @brief  Disable TIM3  peripheral clock
  * @rmtoll TIM3         TIM3EN         LL_RCC_TIM3_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM3_DisableClock(void)
{
  CLEAR_BIT(RCC->TIM3CFGR, RCC_TIM3CFGR_TIM3EN);
}

/**
  * @brief  Enable TIM11 peripheral clocks enable during CSleep mode
  * @rmtoll TIM11         TIM11LPEN         LL_RCC_TIM11_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM11_EnableClockSleep(void)
{
  SET_BIT(RCC->TIM11CFGR, RCC_TIM11CFGR_TIM11LPEN);
}

/**
  * @brief  Enable TIM10 peripheral clocks enable during CSleep mode
  * @rmtoll TIM10         TIM10LPEN         LL_RCC_TIM10_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM10_EnableClockSleep(void)
{
  SET_BIT(RCC->TIM10CFGR, RCC_TIM10CFGR_TIM10LPEN);
}

/**
  * @brief  Enable I3C2 peripheral clocks enable during CSleep mode
  * @rmtoll I3C2         I3C2LPEN         LL_RCC_I3C2_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C2_EnableClockSleep(void)
{
  SET_BIT(RCC->I3C2CFGR, RCC_I3C2CFGR_I3C2LPEN);
}

#if defined(RCC_I3C3CFGR_I3C3LPEN)
/**
  * @brief  Enable I3C3 peripheral clocks enable during CSleep mode
  * @rmtoll I3C3         I3C3LPEN         LL_RCC_I3C3_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C3_EnableClockSleep(void)
{
  SET_BIT(RCC->I3C3CFGR, RCC_I3C3CFGR_I3C3LPEN);
}
#endif /* RCC_I3C3CFGR_I3C3LPEN */

#if defined(RCC_I2C7CFGR_I2C7LPEN)
/**
  * @brief  Enable I2C7 peripheral clocks enable during CSleep mode
  * @rmtoll I2C7         I2C7LPEN         LL_RCC_I2C7_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C7_EnableClockSleep(void)
{
  SET_BIT(RCC->I2C7CFGR, RCC_I2C7CFGR_I2C7LPEN);
}
#endif /* RCC_I2C7CFGR_I2C7LPEN */

/**
  * @brief  Enable I3C1 peripheral clocks enable during CSleep mode
  * @rmtoll I3C1         I3C1LPEN         LL_RCC_I3C1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C1_EnableClockSleep(void)
{
  SET_BIT(RCC->I3C1CFGR, RCC_I3C1CFGR_I3C1LPEN);
}

#if defined(RCC_I2C5CFGR_I2C5LPEN)
/**
  * @brief  Enable I2C5 peripheral clocks enable during CSleep mode
  * @rmtoll I2C5         I2C5LPEN         LL_RCC_I2C5_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C5_EnableClockSleep(void)
{
  SET_BIT(RCC->I2C5CFGR, RCC_I2C5CFGR_I2C5LPEN);
}
#endif /* RCC_I2C5CFGR_I2C5LPEN */

#if defined(RCC_I2C6CFGR_I2C6LPEN)
/**
  * @brief  Enable I2C6 peripheral clocks enable during CSleep mode
  * @rmtoll I2C6         I2C6LPEN         LL_RCC_I2C6_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C6_EnableClockSleep(void)
{
  SET_BIT(RCC->I2C6CFGR, RCC_I2C6CFGR_I2C6LPEN);
}
#endif /* RCC_I2C6CFGR_I2C6LPEN */

#if defined(RCC_I2C3CFGR_I2C3LPEN)
/**
  * @brief  Enable I2C3 peripheral clocks enable during CSleep mode
  * @rmtoll I2C3         I2C3LPEN         LL_RCC_I2C3_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C3_EnableClockSleep(void)
{
  SET_BIT(RCC->I2C3CFGR, RCC_I2C3CFGR_I2C3LPEN);
}
#endif /* RCC_I2C3CFGR_I2C3LPEN */

#if defined(RCC_I2C4CFGR_I2C4LPEN)
/**
  * @brief  Enable I2C4 peripheral clocks enable during CSleep mode
  * @rmtoll I2C4         I2C4LPEN         LL_RCC_I2C4_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C4_EnableClockSleep(void)
{
  SET_BIT(RCC->I2C4CFGR, RCC_I2C4CFGR_I2C4LPEN);
}
#endif /* RCC_I2C4CFGR_I2C4LPEN */

/**
  * @brief  Enable I2C1 peripheral clocks enable during CSleep mode
  * @rmtoll I2C1         I2C1LPEN         LL_RCC_I2C1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C1_EnableClockSleep(void)
{
  SET_BIT(RCC->I2C1CFGR, RCC_I2C1CFGR_I2C1LPEN);
}

/**
  * @brief  Enable I2C2 peripheral clocks enable during CSleep mode
  * @rmtoll I2C2         I2C2LPEN         LL_RCC_I2C2_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C2_EnableClockSleep(void)
{
  SET_BIT(RCC->I2C2CFGR, RCC_I2C2CFGR_I2C2LPEN);
}

/**
  * @brief  Enable UART4 peripheral clocks enable during CSleep mode
  * @rmtoll UART4         UART4LPEN         LL_RCC_UART4_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART4_EnableClockSleep(void)
{
  SET_BIT(RCC->UART4CFGR, RCC_UART4CFGR_UART4LPEN);
}

/**
  * @brief  Enable UART5 peripheral clocks enable during CSleep mode
  * @rmtoll UART5         UART5LPEN         LL_RCC_UART5_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART5_EnableClockSleep(void)
{
  SET_BIT(RCC->UART5CFGR, RCC_UART5CFGR_UART5LPEN);
}

/**
  * @brief  Enable USART2 peripheral clocks enable during CSleep mode
  * @rmtoll USART2         USART2LPEN         LL_RCC_USART2_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART2_EnableClockSleep(void)
{
  SET_BIT(RCC->USART2CFGR, RCC_USART2CFGR_USART2LPEN);
}

/**
  * @brief  Enable USART3 peripheral clocks enable during CSleep mode
  * @rmtoll USART3         USART3LPEN         LL_RCC_USART3_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART3_EnableClockSleep(void)
{
  SET_BIT(RCC->USART3CFGR, RCC_USART3CFGR_USART3LPEN);
}

/**
  * @brief  Enable SPI3 peripheral clocks enable during CSleep mode
  * @rmtoll SPI3         SPI3LPEN         LL_RCC_SPI3_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI3_EnableClockSleep(void)
{
  SET_BIT(RCC->SPI3CFGR, RCC_SPI3CFGR_SPI3LPEN);
}

/**
  * @brief  Enable SPDIFRX peripheral clocks enable during CSleep mode
  * @rmtoll SPDIFRX         SPDIFRXLPEN         LL_RCC_SPDIFRX_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPDIFRX_EnableClockSleep(void)
{
  SET_BIT(RCC->SPDIFRXCFGR, RCC_SPDIFRXCFGR_SPDIFRXLPEN);
}

/**
  * @brief  Enable LPTIM2 peripheral clocks enable during CSleep mode
  * @rmtoll LPTIM2         LPTIM2LPEN         LL_RCC_LPTIM2_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM2_EnableClockSleep(void)
{
  SET_BIT(RCC->LPTIM2CFGR, RCC_LPTIM2CFGR_LPTIM2LPEN);
}

/**
  * @brief  Enable SPI2 peripheral clocks enable during CSleep mode
  * @rmtoll SPI2         SPI2LPEN         LL_RCC_SPI2_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI2_EnableClockSleep(void)
{
  SET_BIT(RCC->SPI2CFGR, RCC_SPI2CFGR_SPI2LPEN);
}

/**
  * @brief  Enable TIM14 peripheral clocks enable during CSleep mode
  * @rmtoll TIM14         TIM14LPEN         LL_RCC_TIM14_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM14_EnableClockSleep(void)
{
  SET_BIT(RCC->TIM14CFGR, RCC_TIM14CFGR_TIM14LPEN);
}

/**
  * @brief  Enable LPTIM1 peripheral clocks enable during CSleep mode
  * @rmtoll LPTIM1         LPTIM1LPEN         LL_RCC_LPTIM1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM1_EnableClockSleep(void)
{
  SET_BIT(RCC->LPTIM1CFGR, RCC_LPTIM1CFGR_LPTIM1LPEN);
}

/**
  * @brief  Enable TIM12 peripheral clocks enable during CSleep mode
  * @rmtoll TIM12         TIM12LPEN         LL_RCC_TIM12_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM12_EnableClockSleep(void)
{
  SET_BIT(RCC->TIM12CFGR, RCC_TIM12CFGR_TIM12LPEN);
}

/**
  * @brief  Enable TIM13 peripheral clocks enable during CSleep mode
  * @rmtoll TIM13         TIM13LPEN         LL_RCC_TIM13_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM13_EnableClockSleep(void)
{
  SET_BIT(RCC->TIM13CFGR, RCC_TIM13CFGR_TIM13LPEN);
}

/**
  * @brief  Enable TIM6 peripheral clocks enable during CSleep mode
  * @rmtoll TIM6         TIM6LPEN         LL_RCC_TIM6_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM6_EnableClockSleep(void)
{
  SET_BIT(RCC->TIM6CFGR, RCC_TIM6CFGR_TIM6LPEN);
}

/**
  * @brief  Enable TIM7 peripheral clocks enable during CSleep mode
  * @rmtoll TIM7         TIM7LPEN         LL_RCC_TIM7_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM7_EnableClockSleep(void)
{
  SET_BIT(RCC->TIM7CFGR, RCC_TIM7CFGR_TIM7LPEN);
}

/**
  * @brief  Enable TIM4 peripheral clocks enable during CSleep mode
  * @rmtoll TIM4         TIM4LPEN         LL_RCC_TIM4_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM4_EnableClockSleep(void)
{
  SET_BIT(RCC->TIM4CFGR, RCC_TIM4CFGR_TIM4LPEN);
}

/**
  * @brief  Enable TIM5 peripheral clocks enable during CSleep mode
  * @rmtoll TIM5         TIM5LPEN         LL_RCC_TIM5_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM5_EnableClockSleep(void)
{
  SET_BIT(RCC->TIM5CFGR, RCC_TIM5CFGR_TIM5LPEN);
}

/**
  * @brief  Enable TIM2 peripheral clocks enable during CSleep mode
  * @rmtoll TIM2         TIM2LPEN         LL_RCC_TIM2_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM2_EnableClockSleep(void)
{
  SET_BIT(RCC->TIM2CFGR, RCC_TIM2CFGR_TIM2LPEN);
}

/**
  * @brief  Enable TIM3 peripheral clocks enable during CSleep mode
  * @rmtoll TIM3         TIM3LPEN         LL_RCC_TIM3_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM3_EnableClockSleep(void)
{
  SET_BIT(RCC->TIM3CFGR, RCC_TIM3CFGR_TIM3LPEN);
}

/**
  * @brief  Disable TIM11 peripheral clocks during CSleep mode
  * @rmtoll TIM11         TIM11LPEN         LL_RCC_TIM11_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM11_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->TIM11CFGR, RCC_TIM11CFGR_TIM11LPEN);
}

/**
  * @brief  Disable TIM10 peripheral clocks during CSleep mode
  * @rmtoll TIM10         TIM10LPEN         LL_RCC_TIM10_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM10_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->TIM10CFGR, RCC_TIM10CFGR_TIM10LPEN);
}

/**
  * @brief  Disable I3C2 peripheral clocks during CSleep mode
  * @rmtoll I3C2         I3C2LPEN         LL_RCC_I3C2_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C2_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->I3C2CFGR, RCC_I3C2CFGR_I3C2LPEN);
}

#if defined(RCC_I3C3CFGR_I3C3LPEN)
/**
  * @brief  Disable I3C3 peripheral clocks during CSleep mode
  * @rmtoll I3C3         I3C3LPEN         LL_RCC_I3C3_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C3_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->I3C3CFGR, RCC_I3C3CFGR_I3C3LPEN);
}
#endif /* RCC_I3C3CFGR_I3C3LPEN */

#if defined(RCC_I2C7CFGR_I2C7LPEN)
/**
  * @brief  Disable I2C7 peripheral clocks during CSleep mode
  * @rmtoll I2C7         I2C7LPEN         LL_RCC_I2C7_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C7_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->I2C7CFGR, RCC_I2C7CFGR_I2C7LPEN);
}
#endif /* RCC_I2C7CFGR_I2C7LPEN */

/**
  * @brief  Disable I3C1 peripheral clocks during CSleep mode
  * @rmtoll I3C1         I3C1LPEN         LL_RCC_I3C1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->I3C1CFGR, RCC_I3C1CFGR_I3C1LPEN);
}

