zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_bus.h
#if defined(RCC_I2C5CFGR_I2C5LPEN)
/**
  * @brief  Disable I2C5 peripheral clocks during CSleep mode
  * @rmtoll I2C5         I2C5LPEN         LL_RCC_I2C5_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C5_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->I2C5CFGR, RCC_I2C5CFGR_I2C5LPEN);
}
#endif /* RCC_I2C5CFGR_I2C5LPEN */


#if defined(RCC_I2C6CFGR_I2C6LPEN)
/**
  * @brief  Disable I2C6 peripheral clocks during CSleep mode
  * @rmtoll I2C6         I2C6LPEN         LL_RCC_I2C6_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C6_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->I2C6CFGR, RCC_I2C6CFGR_I2C6LPEN);
}
#endif /* RCC_I2C6CFGR_I2C6LPEN */

#if defined(RCC_I2C3CFGR_I2C3LPEN)
/**
  * @brief  Disable I2C3 peripheral clocks during CSleep mode
  * @rmtoll I2C3         I2C3LPEN         LL_RCC_I2C3_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C3_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->I2C3CFGR, RCC_I2C3CFGR_I2C3LPEN);
}
#endif /* RCC_I2C3CFGR_I2C3LPEN */

#if defined(RCC_I2C4CFGR_I2C4LPEN)
/**
  * @brief  Disable I2C4 peripheral clocks during CSleep mode
  * @rmtoll I2C4         I2C4LPEN         LL_RCC_I2C4_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C4_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->I2C4CFGR, RCC_I2C4CFGR_I2C4LPEN);
}
#endif /* RCC_I2C4CFGR_I2C4LPEN */

/**
  * @brief  Disable I2C1 peripheral clocks during CSleep mode
  * @rmtoll I2C1         I2C1LPEN         LL_RCC_I2C1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->I2C1CFGR, RCC_I2C1CFGR_I2C1LPEN);
}

/**
  * @brief  Disable I2C2 peripheral clocks during CSleep mode
  * @rmtoll I2C2         I2C2LPEN         LL_RCC_I2C2_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C2_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->I2C2CFGR, RCC_I2C2CFGR_I2C2LPEN);
}

/**
  * @brief  Disable UART4 peripheral clocks during CSleep mode
  * @rmtoll UART4         UART4LPEN         LL_RCC_UART4_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART4_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->UART4CFGR, RCC_UART4CFGR_UART4LPEN);
}

/**
  * @brief  Disable UART5 peripheral clocks during CSleep mode
  * @rmtoll UART5         UART5LPEN         LL_RCC_UART5_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART5_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->UART5CFGR, RCC_UART5CFGR_UART5LPEN);
}

/**
  * @brief  Disable USART2 peripheral clocks during CSleep mode
  * @rmtoll USART2         USART2LPEN         LL_RCC_USART2_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART2_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->USART2CFGR, RCC_USART2CFGR_USART2LPEN);
}

/**
  * @brief  Disable USART3 peripheral clocks during CSleep mode
  * @rmtoll USART3         USART3LPEN         LL_RCC_USART3_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART3_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->USART3CFGR, RCC_USART3CFGR_USART3LPEN);
}

/**
  * @brief  Disable SPI3 peripheral clocks during CSleep mode
  * @rmtoll SPI3         SPI3LPEN         LL_RCC_SPI3_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI3_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->SPI3CFGR, RCC_SPI3CFGR_SPI3LPEN);
}

/**
  * @brief  Disable SPDIFRX peripheral clocks during CSleep mode
  * @rmtoll SPDIFRX         SPDIFRXLPEN         LL_RCC_SPDIFRX_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPDIFRX_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->SPDIFRXCFGR, RCC_SPDIFRXCFGR_SPDIFRXLPEN);
}

/**
  * @brief  Disable LPTIM2 peripheral clocks during CSleep mode
  * @rmtoll LPTIM2         LPTIM2LPEN         LL_RCC_LPTIM2_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM2_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->LPTIM2CFGR, RCC_LPTIM2CFGR_LPTIM2LPEN);
}

/**
  * @brief  Disable SPI2 peripheral clocks during CSleep mode
  * @rmtoll SPI2         SPI2LPEN         LL_RCC_SPI2_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI2_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->SPI2CFGR, RCC_SPI2CFGR_SPI2LPEN);
}

/**
  * @brief  Disable TIM14 peripheral clocks during CSleep mode
  * @rmtoll TIM14         TIM14LPEN         LL_RCC_TIM14_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM14_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->TIM14CFGR, RCC_TIM14CFGR_TIM14LPEN);
}

/**
  * @brief  Disable LPTIM1 peripheral clocks during CSleep mode
  * @rmtoll LPTIM1         LPTIM1LPEN         LL_RCC_LPTIM1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->LPTIM1CFGR, RCC_LPTIM1CFGR_LPTIM1LPEN);
}

/**
  * @brief  Disable TIM12 peripheral clocks during CSleep mode
  * @rmtoll TIM12         TIM12LPEN         LL_RCC_TIM12_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM12_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->TIM12CFGR, RCC_TIM12CFGR_TIM12LPEN);
}

/**
  * @brief  Disable TIM13 peripheral clocks during CSleep mode
  * @rmtoll TIM13         TIM13LPEN         LL_RCC_TIM13_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM13_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->TIM13CFGR, RCC_TIM13CFGR_TIM13LPEN);
}

/**
  * @brief  Disable TIM6 peripheral clocks during CSleep mode
  * @rmtoll TIM6         TIM6LPEN         LL_RCC_TIM6_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM6_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->TIM6CFGR, RCC_TIM6CFGR_TIM6LPEN);
}

/**
  * @brief  Disable TIM7 peripheral clocks during CSleep mode
  * @rmtoll TIM7         TIM7LPEN         LL_RCC_TIM7_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM7_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->TIM7CFGR, RCC_TIM7CFGR_TIM7LPEN);
}

/**
  * @brief  Disable TIM4 peripheral clocks during CSleep mode
  * @rmtoll TIM4         TIM4LPEN         LL_RCC_TIM4_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM4_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->TIM4CFGR, RCC_TIM4CFGR_TIM4LPEN);
}

/**
  * @brief  Disable TIM5 peripheral clocks during CSleep mode
  * @rmtoll TIM5         TIM5LPEN         LL_RCC_TIM5_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM5_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->TIM5CFGR, RCC_TIM5CFGR_TIM5LPEN);
}

/**
  * @brief  Disable TIM2 peripheral clocks during CSleep mode
  * @rmtoll TIM2         TIM2LPEN         LL_RCC_TIM2_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM2_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->TIM2CFGR, RCC_TIM2CFGR_TIM2LPEN);
}

/**
  * @brief  Disable TIM3 peripheral clocks during CSleep mode
  * @rmtoll TIM3         TIM3LPEN         LL_RCC_TIM3_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM3_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->TIM3CFGR, RCC_TIM3CFGR_TIM3LPEN);
}

/**
  * @brief  Assert TIM11 reset
  * @rmtoll TIM11         TIM11RST         LL_RCC_TIM11_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM11_ForceReset(void)
{
  SET_BIT(RCC->TIM11CFGR, RCC_TIM11CFGR_TIM11RST);
}

/**
  * @brief  Assert TIM10 reset
  * @rmtoll TIM10         TIM10RST         LL_RCC_TIM10_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM10_ForceReset(void)
{
  SET_BIT(RCC->TIM10CFGR, RCC_TIM10CFGR_TIM10RST);
}

/**
  * @brief  Assert I3C2 reset
  * @rmtoll I3C2         I3C2RST         LL_RCC_I3C2_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C2_ForceReset(void)
{
  SET_BIT(RCC->I3C2CFGR, RCC_I3C2CFGR_I3C2RST);
}

#if defined(RCC_I3C3CFGR_I3C3RST)
/**
  * @brief  Assert I3C3 reset
  * @rmtoll I3C3         I3C3RST         LL_RCC_I3C3_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C3_ForceReset(void)
{
  SET_BIT(RCC->I3C3CFGR, RCC_I3C3CFGR_I3C3RST);
}
#endif /* RCC_I3C3CFGR_I3C3RST */

