zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_bus.h
#if defined(RCC_I2C7CFGR_I2C7RST)
/**
  * @brief  Assert I2C7 reset
  * @rmtoll I2C7         I2C7RST         LL_RCC_I2C7_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C7_ForceReset(void)
{
  SET_BIT(RCC->I2C7CFGR, RCC_I2C7CFGR_I2C7RST);
}
#endif /* RCC_I2C7CFGR_I2C7RST */

/**
  * @brief  Assert I3C1 reset
  * @rmtoll I3C1         I3C1RST         LL_RCC_I3C1_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C1_ForceReset(void)
{
  SET_BIT(RCC->I3C1CFGR, RCC_I3C1CFGR_I3C1RST);
}

#if defined(RCC_I2C5CFGR_I2C5RST)
/**
  * @brief  Assert I2C5 reset
  * @rmtoll I2C5         I2C5RST         LL_RCC_I2C5_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C5_ForceReset(void)
{
  SET_BIT(RCC->I2C5CFGR, RCC_I2C5CFGR_I2C5RST);
}
#endif /* RCC_I2C5CFGR_I2C5RST */

#if defined(RCC_I2C6CFGR_I2C6RST)
/**
  * @brief  Assert I2C6 reset
  * @rmtoll I2C6         I2C6RST         LL_RCC_I2C6_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C6_ForceReset(void)
{
  SET_BIT(RCC->I2C6CFGR, RCC_I2C6CFGR_I2C6RST);
}
#endif /* RCC_I2C6CFGR_I2C6RST */

#if defined(RCC_I2C3CFGR_I2C3RST)
/**
  * @brief  Assert I2C3 reset
  * @rmtoll I2C3         I2C3RST         LL_RCC_I2C3_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C3_ForceReset(void)
{
  SET_BIT(RCC->I2C3CFGR, RCC_I2C3CFGR_I2C3RST);
}
#endif /* RCC_I2C3CFGR_I2C3RST */

#if defined(RCC_I2C4CFGR_I2C4RST)
/**
  * @brief  Assert I2C4 reset
  * @rmtoll I2C4         I2C4RST         LL_RCC_I2C4_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C4_ForceReset(void)
{
  SET_BIT(RCC->I2C4CFGR, RCC_I2C4CFGR_I2C4RST);
}
#endif /* RCC_I2C4CFGR_I2C4RST */

/**
  * @brief  Assert I2C1 reset
  * @rmtoll I2C1         I2C1RST         LL_RCC_I2C1_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C1_ForceReset(void)
{
  SET_BIT(RCC->I2C1CFGR, RCC_I2C1CFGR_I2C1RST);
}

/**
  * @brief  Assert I2C2 reset
  * @rmtoll I2C2         I2C2RST         LL_RCC_I2C2_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C2_ForceReset(void)
{
  SET_BIT(RCC->I2C2CFGR, RCC_I2C2CFGR_I2C2RST);
}

/**
  * @brief  Assert UART4 reset
  * @rmtoll UART4         UART4RST         LL_RCC_UART4_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART4_ForceReset(void)
{
  SET_BIT(RCC->UART4CFGR, RCC_UART4CFGR_UART4RST);
}

/**
  * @brief  Assert UART5 reset
  * @rmtoll UART5         UART5RST         LL_RCC_UART5_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART5_ForceReset(void)
{
  SET_BIT(RCC->UART5CFGR, RCC_UART5CFGR_UART5RST);
}

/**
  * @brief  Assert USART2 reset
  * @rmtoll USART2         USART2RST         LL_RCC_USART2_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART2_ForceReset(void)
{
  SET_BIT(RCC->USART2CFGR, RCC_USART2CFGR_USART2RST);
}

/**
  * @brief  Assert USART3 reset
  * @rmtoll USART3         USART3RST         LL_RCC_USART3_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART3_ForceReset(void)
{
  SET_BIT(RCC->USART3CFGR, RCC_USART3CFGR_USART3RST);
}

/**
  * @brief  Assert SPI3 reset
  * @rmtoll SPI3         SPI3RST         LL_RCC_SPI3_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI3_ForceReset(void)
{
  SET_BIT(RCC->SPI3CFGR, RCC_SPI3CFGR_SPI3RST);
}

/**
  * @brief  Assert SPDIFRX reset
  * @rmtoll SPDIFRX         SPDIFRXRST         LL_RCC_SPDIFRX_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPDIFRX_ForceReset(void)
{
  SET_BIT(RCC->SPDIFRXCFGR, RCC_SPDIFRXCFGR_SPDIFRXRST);
}

/**
  * @brief  Assert LPTIM2 reset
  * @rmtoll LPTIM2         LPTIM2RST         LL_RCC_LPTIM2_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM2_ForceReset(void)
{
  SET_BIT(RCC->LPTIM2CFGR, RCC_LPTIM2CFGR_LPTIM2RST);
}

/**
  * @brief  Assert SPI2 reset
  * @rmtoll SPI2         SPI2RST         LL_RCC_SPI2_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI2_ForceReset(void)
{
  SET_BIT(RCC->SPI2CFGR, RCC_SPI2CFGR_SPI2RST);
}

/**
  * @brief  Assert TIM14 reset
  * @rmtoll TIM14         TIM14RST         LL_RCC_TIM14_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM14_ForceReset(void)
{
  SET_BIT(RCC->TIM14CFGR, RCC_TIM14CFGR_TIM14RST);
}

/**
  * @brief  Assert LPTIM1 reset
  * @rmtoll LPTIM1         LPTIM1RST         LL_RCC_LPTIM1_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM1_ForceReset(void)
{
  SET_BIT(RCC->LPTIM1CFGR, RCC_LPTIM1CFGR_LPTIM1RST);
}

/**
  * @brief  Assert TIM12 reset
  * @rmtoll TIM12         TIM12RST         LL_RCC_TIM12_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM12_ForceReset(void)
{
  SET_BIT(RCC->TIM12CFGR, RCC_TIM12CFGR_TIM12RST);
}

/**
  * @brief  Assert TIM13 reset
  * @rmtoll TIM13         TIM13RST         LL_RCC_TIM13_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM13_ForceReset(void)
{
  SET_BIT(RCC->TIM13CFGR, RCC_TIM13CFGR_TIM13RST);
}

/**
  * @brief  Assert TIM6 reset
  * @rmtoll TIM6         TIM6RST         LL_RCC_TIM6_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM6_ForceReset(void)
{
  SET_BIT(RCC->TIM6CFGR, RCC_TIM6CFGR_TIM6RST);
}

/**
  * @brief  Assert TIM7 reset
  * @rmtoll TIM7         TIM7RST         LL_RCC_TIM7_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM7_ForceReset(void)
{
  SET_BIT(RCC->TIM7CFGR, RCC_TIM7CFGR_TIM7RST);
}

/**
  * @brief  Assert TIM4 reset
  * @rmtoll TIM4         TIM4RST         LL_RCC_TIM4_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM4_ForceReset(void)
{
  SET_BIT(RCC->TIM4CFGR, RCC_TIM4CFGR_TIM4RST);
}

/**
  * @brief  Assert TIM5 reset
  * @rmtoll TIM5         TIM5RST         LL_RCC_TIM5_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM5_ForceReset(void)
{
  SET_BIT(RCC->TIM5CFGR, RCC_TIM5CFGR_TIM5RST);
}

/**
  * @brief  Assert TIM2 reset
  * @rmtoll TIM2         TIM2RST         LL_RCC_TIM2_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM2_ForceReset(void)
{
  SET_BIT(RCC->TIM2CFGR, RCC_TIM2CFGR_TIM2RST);
}

/**
  * @brief  Assert TIM3 reset
  * @rmtoll TIM3         TIM3RST         LL_RCC_TIM3_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM3_ForceReset(void)
{
  SET_BIT(RCC->TIM3CFGR, RCC_TIM3CFGR_TIM3RST);
}

/**
  * @brief  Release TIM11 reset
  * @rmtoll TIM11         TIM11RST         LL_RCC_TIM11_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM11_ReleaseReset(void)
{
  CLEAR_BIT(RCC->TIM11CFGR, RCC_TIM11CFGR_TIM11RST);
}

/**
  * @brief  Release TIM10 reset
  * @rmtoll TIM10         TIM10RST         LL_RCC_TIM10_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM10_ReleaseReset(void)
{
  CLEAR_BIT(RCC->TIM10CFGR, RCC_TIM10CFGR_TIM10RST);
}

/**
  * @brief  Release I3C2 reset
  * @rmtoll I3C2         I3C2RST         LL_RCC_I3C2_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C2_ReleaseReset(void)
{
  CLEAR_BIT(RCC->I3C2CFGR, RCC_I3C2CFGR_I3C2RST);
}

#if defined(RCC_I3C3CFGR_I3C3RST)
/**
  * @brief  Release I3C3 reset
  * @rmtoll I3C3         I3C3RST         LL_RCC_I3C3_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C3_ReleaseReset(void)
{
  CLEAR_BIT(RCC->I3C3CFGR, RCC_I3C3CFGR_I3C3RST);
}
#endif /* RCC_I3C3CFGR_I3C3RST */

