zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_bus.h
#if defined(RCC_I2C7CFGR_I2C7RST)
/**
  * @brief  Release I2C7 reset
  * @rmtoll I2C7         I2C7RST         LL_RCC_I2C7_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C7_ReleaseReset(void)
{
  CLEAR_BIT(RCC->I2C7CFGR, RCC_I2C7CFGR_I2C7RST);
}
#endif /* RCC_I2C7CFGR_I2C7RST */

/**
  * @brief  Release I3C1 reset
  * @rmtoll I3C1         I3C1RST         LL_RCC_I3C1_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C1_ReleaseReset(void)
{
  CLEAR_BIT(RCC->I3C1CFGR, RCC_I3C1CFGR_I3C1RST);
}

#if defined(RCC_I2C5CFGR_I2C5RST)
/**
  * @brief  Release I2C5 reset
  * @rmtoll I2C5         I2C5RST         LL_RCC_I2C5_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C5_ReleaseReset(void)
{
  CLEAR_BIT(RCC->I2C5CFGR, RCC_I2C5CFGR_I2C5RST);
}
#endif /* RCC_I2C5CFGR_I2C5RST */

#if defined(RCC_I2C6CFGR_I2C6RST)
/**
  * @brief  Release I2C6 reset
  * @rmtoll I2C6         I2C6RST         LL_RCC_I2C6_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C6_ReleaseReset(void)
{
  CLEAR_BIT(RCC->I2C6CFGR, RCC_I2C6CFGR_I2C6RST);
}
#endif /* RCC_I2C6CFGR_I2C6RST */

#if defined(RCC_I2C3CFGR_I2C3RST)
/**
  * @brief  Release I2C3 reset
  * @rmtoll I2C3         I2C3RST         LL_RCC_I2C3_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C3_ReleaseReset(void)
{
  CLEAR_BIT(RCC->I2C3CFGR, RCC_I2C3CFGR_I2C3RST);
}
#endif /* RCC_I2C3CFGR_I2C3RST */

#if defined(RCC_I2C4CFGR_I2C4RST)
/**
  * @brief  Release I2C4 reset
  * @rmtoll I2C4         I2C4RST         LL_RCC_I2C4_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C4_ReleaseReset(void)
{
  CLEAR_BIT(RCC->I2C4CFGR, RCC_I2C4CFGR_I2C4RST);
}
#endif /* RCC_I2C4CFGR_I2C4RST */

/**
  * @brief  Release I2C1 reset
  * @rmtoll I2C1         I2C1RST         LL_RCC_I2C1_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C1_ReleaseReset(void)
{
  CLEAR_BIT(RCC->I2C1CFGR, RCC_I2C1CFGR_I2C1RST);
}

/**
  * @brief  Release I2C2 reset
  * @rmtoll I2C2         I2C2RST         LL_RCC_I2C2_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C2_ReleaseReset(void)
{
  CLEAR_BIT(RCC->I2C2CFGR, RCC_I2C2CFGR_I2C2RST);
}

/**
  * @brief  Release UART4 reset
  * @rmtoll UART4         UART4RST         LL_RCC_UART4_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART4_ReleaseReset(void)
{
  CLEAR_BIT(RCC->UART4CFGR, RCC_UART4CFGR_UART4RST);
}

/**
  * @brief  Release UART5 reset
  * @rmtoll UART5         UART5RST         LL_RCC_UART5_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART5_ReleaseReset(void)
{
  CLEAR_BIT(RCC->UART5CFGR, RCC_UART5CFGR_UART5RST);
}

/**
  * @brief  Release USART2 reset
  * @rmtoll USART2         USART2RST         LL_RCC_USART2_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART2_ReleaseReset(void)
{
  CLEAR_BIT(RCC->USART2CFGR, RCC_USART2CFGR_USART2RST);
}

/**
  * @brief  Release USART3 reset
  * @rmtoll USART3         USART3RST         LL_RCC_USART3_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART3_ReleaseReset(void)
{
  CLEAR_BIT(RCC->USART3CFGR, RCC_USART3CFGR_USART3RST);
}

/**
  * @brief  Release SPI3 reset
  * @rmtoll SPI3         SPI3RST         LL_RCC_SPI3_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI3_ReleaseReset(void)
{
  CLEAR_BIT(RCC->SPI3CFGR, RCC_SPI3CFGR_SPI3RST);
}

/**
  * @brief  Release SPDIFRX reset
  * @rmtoll SPDIFRX         SPDIFRXRST         LL_RCC_SPDIFRX_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPDIFRX_ReleaseReset(void)
{
  CLEAR_BIT(RCC->SPDIFRXCFGR, RCC_SPDIFRXCFGR_SPDIFRXRST);
}

/**
  * @brief  Release LPTIM2 reset
  * @rmtoll LPTIM2         LPTIM2RST         LL_RCC_LPTIM2_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM2_ReleaseReset(void)
{
  CLEAR_BIT(RCC->LPTIM2CFGR, RCC_LPTIM2CFGR_LPTIM2RST);
}

/**
  * @brief  Release SPI2 reset
  * @rmtoll SPI2         SPI2RST         LL_RCC_SPI2_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI2_ReleaseReset(void)
{
  CLEAR_BIT(RCC->SPI2CFGR, RCC_SPI2CFGR_SPI2RST);
}

/**
  * @brief  Release TIM14 reset
  * @rmtoll TIM14         TIM14RST         LL_RCC_TIM14_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM14_ReleaseReset(void)
{
  CLEAR_BIT(RCC->TIM14CFGR, RCC_TIM14CFGR_TIM14RST);
}

/**
  * @brief  Release LPTIM1 reset
  * @rmtoll LPTIM1         LPTIM1RST         LL_RCC_LPTIM1_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM1_ReleaseReset(void)
{
  CLEAR_BIT(RCC->LPTIM1CFGR, RCC_LPTIM1CFGR_LPTIM1RST);
}

/**
  * @brief  Release TIM12 reset
  * @rmtoll TIM12         TIM12RST         LL_RCC_TIM12_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM12_ReleaseReset(void)
{
  CLEAR_BIT(RCC->TIM12CFGR, RCC_TIM12CFGR_TIM12RST);
}

/**
  * @brief  Release TIM13 reset
  * @rmtoll TIM13         TIM13RST         LL_RCC_TIM13_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM13_ReleaseReset(void)
{
  CLEAR_BIT(RCC->TIM13CFGR, RCC_TIM13CFGR_TIM13RST);
}

/**
  * @brief  Release TIM6 reset
  * @rmtoll TIM6         TIM6RST         LL_RCC_TIM6_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM6_ReleaseReset(void)
{
  CLEAR_BIT(RCC->TIM6CFGR, RCC_TIM6CFGR_TIM6RST);
}

/**
  * @brief  Release TIM7 reset
  * @rmtoll TIM7         TIM7RST         LL_RCC_TIM7_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM7_ReleaseReset(void)
{
  CLEAR_BIT(RCC->TIM7CFGR, RCC_TIM7CFGR_TIM7RST);
}

/**
  * @brief  Release TIM4 reset
  * @rmtoll TIM4         TIM4RST         LL_RCC_TIM4_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM4_ReleaseReset(void)
{
  CLEAR_BIT(RCC->TIM4CFGR, RCC_TIM4CFGR_TIM4RST);
}

/**
  * @brief  Release TIM5 reset
  * @rmtoll TIM5         TIM5RST         LL_RCC_TIM5_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM5_ReleaseReset(void)
{
  CLEAR_BIT(RCC->TIM5CFGR, RCC_TIM5CFGR_TIM5RST);
}

/**
  * @brief  Release TIM2 reset
  * @rmtoll TIM2         TIM2RST         LL_RCC_TIM2_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM2_ReleaseReset(void)
{
  CLEAR_BIT(RCC->TIM2CFGR, RCC_TIM2CFGR_TIM2RST);
}

/**
  * @brief  Release TIM3 reset
  * @rmtoll TIM3         TIM3RST         LL_RCC_TIM3_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM3_ReleaseReset(void)
{
  CLEAR_BIT(RCC->TIM3CFGR, RCC_TIM3CFGR_TIM3RST);
}

#if defined(RCC_UART8CFGR_UART8EN)
/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB2 APB2
  * @{
  */
/**
  * @brief  Enable UART8  peripheral clock
  * @rmtoll UART8         UART8EN         LL_RCC_UART8_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART8_EnableClock(void)
{
  SET_BIT(RCC->UART8CFGR, RCC_UART8CFGR_UART8EN);
}
#endif /* RCC_UART8CFGR_UART8EN */

/**
  * @brief  Enable UART7  peripheral clock
  * @rmtoll UART7         UART7EN         LL_RCC_UART7_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART7_EnableClock(void)
{
  SET_BIT(RCC->UART7CFGR, RCC_UART7CFGR_UART7EN);
}

