zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_bus.h
#if defined(RCC_SPI7CFGR_SPI7EN)
/**
  * @brief  Enable SPI7  peripheral clock
  * @rmtoll SPI7         SPI7EN         LL_RCC_SPI7_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI7_EnableClock(void)
{
  SET_BIT(RCC->SPI7CFGR, RCC_SPI7CFGR_SPI7EN);
}
#endif /* RCC_SPI7CFGR_SPI7EN */

#if defined(RCC_SPI6CFGR_SPI6EN)
/**
  * @brief  Enable SPI6  peripheral clock
  * @rmtoll SPI6         SPI6EN         LL_RCC_SPI6_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI6_EnableClock(void)
{
  SET_BIT(RCC->SPI6CFGR, RCC_SPI6CFGR_SPI6EN);
}
#endif /* RCC_SPI6CFGR_SPI6EN */

/**
  * @brief  Enable SAI4  peripheral clock
  * @rmtoll SAI4         SAI4EN         LL_RCC_SAI4_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI4_EnableClock(void)
{
  SET_BIT(RCC->SAI4CFGR, RCC_SAI4CFGR_SAI4EN);
}

/**
  * @brief  Enable USART1  peripheral clock
  * @rmtoll USART1         USART1EN         LL_RCC_USART1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART1_EnableClock(void)
{
  SET_BIT(RCC->USART1CFGR, RCC_USART1CFGR_USART1EN);
}

#if defined(RCC_TIM20CFGR_TIM20EN)
/**
  * @brief  Enable TIM20  peripheral clock
  * @rmtoll TIM20         TIM20EN         LL_RCC_TIM20_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM20_EnableClock(void)
{
  SET_BIT(RCC->TIM20CFGR, RCC_TIM20CFGR_TIM20EN);
}
#endif /* RCC_TIM20CFGR_TIM20EN */

/**
  * @brief  Enable FDCAN  peripheral clock
  * @rmtoll FDCAN         FDCANEN         LL_RCC_FDCAN_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_FDCAN_EnableClock(void)
{
  SET_BIT(RCC->FDCANCFGR, RCC_FDCANCFGR_FDCANEN);
}

#if defined(RCC_UART9CFGR_UART9EN)
/**
  * @brief  Enable UART9  peripheral clock
  * @rmtoll UART9         UART9EN         LL_RCC_UART9_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART9_EnableClock(void)
{
  SET_BIT(RCC->UART9CFGR, RCC_UART9CFGR_UART9EN);
}
#endif /* RCC_UART9CFGR_UART9EN */

/**
  * @brief  Enable SAI3  peripheral clock
  * @rmtoll SAI3         SAI3EN         LL_RCC_SAI3_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI3_EnableClock(void)
{
  SET_BIT(RCC->SAI3CFGR, RCC_SAI3CFGR_SAI3EN);
}

/**
  * @brief  Enable SAI2  peripheral clock
  * @rmtoll SAI2         SAI2EN         LL_RCC_SAI2_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI2_EnableClock(void)
{
  SET_BIT(RCC->SAI2CFGR, RCC_SAI2CFGR_SAI2EN);
}

/**
  * @brief  Enable SAI1  peripheral clock
  * @rmtoll SAI1         SAI1EN         LL_RCC_SAI1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI1_EnableClock(void)
{
  SET_BIT(RCC->SAI1CFGR, RCC_SAI1CFGR_SAI1EN);
}

/**
  * @brief  Enable SPI5  peripheral clock
  * @rmtoll SPI5         SPI5EN         LL_RCC_SPI5_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI5_EnableClock(void)
{
  SET_BIT(RCC->SPI5CFGR, RCC_SPI5CFGR_SPI5EN);
}

/**
  * @brief  Enable TIM17  peripheral clock
  * @rmtoll TIM17         TIM17EN         LL_RCC_TIM17_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM17_EnableClock(void)
{
  SET_BIT(RCC->TIM17CFGR, RCC_TIM17CFGR_TIM17EN);
}

/**
  * @brief  Enable TIM16  peripheral clock
  * @rmtoll TIM16         TIM16EN         LL_RCC_TIM16_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM16_EnableClock(void)
{
  SET_BIT(RCC->TIM16CFGR, RCC_TIM16CFGR_TIM16EN);
}

/**
  * @brief  Enable TIM15  peripheral clock
  * @rmtoll TIM15         TIM15EN         LL_RCC_TIM15_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM15_EnableClock(void)
{
  SET_BIT(RCC->TIM15CFGR, RCC_TIM15CFGR_TIM15EN);
}

/**
  * @brief  Enable SPI4  peripheral clock
  * @rmtoll SPI4         SPI4EN         LL_RCC_SPI4_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI4_EnableClock(void)
{
  SET_BIT(RCC->SPI4CFGR, RCC_SPI4CFGR_SPI4EN);
}

/**
  * @brief  Enable SPI1  peripheral clock
  * @rmtoll SPI1         SPI1EN         LL_RCC_SPI1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI1_EnableClock(void)
{
  SET_BIT(RCC->SPI1CFGR, RCC_SPI1CFGR_SPI1EN);
}

/**
  * @brief  Enable USART6  peripheral clock
  * @rmtoll USART6         USART6EN         LL_RCC_USART6_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART6_EnableClock(void)
{
  SET_BIT(RCC->USART6CFGR, RCC_USART6CFGR_USART6EN);
}

/**
  * @brief  Enable TIM8  peripheral clock
  * @rmtoll TIM8         TIM8EN         LL_RCC_TIM8_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM8_EnableClock(void)
{
  SET_BIT(RCC->TIM8CFGR, RCC_TIM8CFGR_TIM8EN);
}

/**
  * @brief  Enable TIM1  peripheral clock
  * @rmtoll TIM1         TIM1EN         LL_RCC_TIM1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM1_EnableClock(void)
{
  SET_BIT(RCC->TIM1CFGR, RCC_TIM1CFGR_TIM1EN);
}

#if defined(RCC_UART8CFGR_UART8EN)
/**
  * @brief  Disable UART8  peripheral clock
  * @rmtoll UART8         UART8EN         LL_RCC_UART8_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART8_DisableClock(void)
{
  CLEAR_BIT(RCC->UART8CFGR, RCC_UART8CFGR_UART8EN);
}
#endif /* RCC_UART8CFGR_UART8EN */

/**
  * @brief  Disable UART7  peripheral clock
  * @rmtoll UART7         UART7EN         LL_RCC_UART7_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART7_DisableClock(void)
{
  CLEAR_BIT(RCC->UART7CFGR, RCC_UART7CFGR_UART7EN);
}

#if defined(RCC_SPI7CFGR_SPI7EN)
/**
  * @brief  Disable SPI7  peripheral clock
  * @rmtoll SPI7         SPI7EN         LL_RCC_SPI7_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI7_DisableClock(void)
{
  CLEAR_BIT(RCC->SPI7CFGR, RCC_SPI7CFGR_SPI7EN);
}
#endif /* RCC_SPI7CFGR_SPI7EN */

#if defined(RCC_SPI6CFGR_SPI6EN)
/**
  * @brief  Disable SPI6  peripheral clock
  * @rmtoll SPI6         SPI6EN         LL_RCC_SPI6_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI6_DisableClock(void)
{
  CLEAR_BIT(RCC->SPI6CFGR, RCC_SPI6CFGR_SPI6EN);
}
#endif /* RCC_SPI6CFGR_SPI6EN */

/**
  * @brief  Disable SAI4  peripheral clock
  * @rmtoll SAI4         SAI4EN         LL_RCC_SAI4_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI4_DisableClock(void)
{
  CLEAR_BIT(RCC->SAI4CFGR, RCC_SAI4CFGR_SAI4EN);
}

/**
  * @brief  Disable USART1  peripheral clock
  * @rmtoll USART1         USART1EN         LL_RCC_USART1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART1_DisableClock(void)
{
  CLEAR_BIT(RCC->USART1CFGR, RCC_USART1CFGR_USART1EN);
}

