zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_bus.h
#if defined(RCC_TIM20CFGR_TIM20EN)
/**
  * @brief  Disable TIM20  peripheral clock
  * @rmtoll TIM20         TIM20EN         LL_RCC_TIM20_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM20_DisableClock(void)
{
  CLEAR_BIT(RCC->TIM20CFGR, RCC_TIM20CFGR_TIM20EN);
}
#endif /* RCC_TIM20CFGR_TIM20EN*/

/**
  * @brief  Disable FDCAN  peripheral clock
  * @rmtoll FDCAN         FDCANEN         LL_RCC_FDCAN_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_FDCAN_DisableClock(void)
{
  CLEAR_BIT(RCC->FDCANCFGR, RCC_FDCANCFGR_FDCANEN);
}

#if defined(RCC_UART9CFGR_UART9EN)
/**
  * @brief  Disable UART9  peripheral clock
  * @rmtoll UART9         UART9EN         LL_RCC_UART9_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART9_DisableClock(void)
{
  CLEAR_BIT(RCC->UART9CFGR, RCC_UART9CFGR_UART9EN);
}
#endif /* RCC_UART9CFGR_UART9EN */

/**
  * @brief  Disable SAI3  peripheral clock
  * @rmtoll SAI3         SAI3EN         LL_RCC_SAI3_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI3_DisableClock(void)
{
  CLEAR_BIT(RCC->SAI3CFGR, RCC_SAI3CFGR_SAI3EN);
}

/**
  * @brief  Disable SAI2  peripheral clock
  * @rmtoll SAI2         SAI2EN         LL_RCC_SAI2_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI2_DisableClock(void)
{
  CLEAR_BIT(RCC->SAI2CFGR, RCC_SAI2CFGR_SAI2EN);
}

/**
  * @brief  Disable SAI1  peripheral clock
  * @rmtoll SAI1         SAI1EN         LL_RCC_SAI1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI1_DisableClock(void)
{
  CLEAR_BIT(RCC->SAI1CFGR, RCC_SAI1CFGR_SAI1EN);
}

/**
  * @brief  Disable SPI5  peripheral clock
  * @rmtoll SPI5         SPI5EN         LL_RCC_SPI5_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI5_DisableClock(void)
{
  CLEAR_BIT(RCC->SPI5CFGR, RCC_SPI5CFGR_SPI5EN);
}

/**
  * @brief  Disable TIM17  peripheral clock
  * @rmtoll TIM17         TIM17EN         LL_RCC_TIM17_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM17_DisableClock(void)
{
  CLEAR_BIT(RCC->TIM17CFGR, RCC_TIM17CFGR_TIM17EN);
}

/**
  * @brief  Disable TIM16  peripheral clock
  * @rmtoll TIM16         TIM16EN         LL_RCC_TIM16_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM16_DisableClock(void)
{
  CLEAR_BIT(RCC->TIM16CFGR, RCC_TIM16CFGR_TIM16EN);
}

/**
  * @brief  Disable TIM15  peripheral clock
  * @rmtoll TIM15         TIM15EN         LL_RCC_TIM15_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM15_DisableClock(void)
{
  CLEAR_BIT(RCC->TIM15CFGR, RCC_TIM15CFGR_TIM15EN);
}

/**
  * @brief  Disable SPI4  peripheral clock
  * @rmtoll SPI4         SPI4EN         LL_RCC_SPI4_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI4_DisableClock(void)
{
  CLEAR_BIT(RCC->SPI4CFGR, RCC_SPI4CFGR_SPI4EN);
}

/**
  * @brief  Disable SPI1  peripheral clock
  * @rmtoll SPI1         SPI1EN         LL_RCC_SPI1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI1_DisableClock(void)
{
  CLEAR_BIT(RCC->SPI1CFGR, RCC_SPI1CFGR_SPI1EN);
}

/**
  * @brief  Disable USART6  peripheral clock
  * @rmtoll USART6         USART6EN         LL_RCC_USART6_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART6_DisableClock(void)
{
  CLEAR_BIT(RCC->USART6CFGR, RCC_USART6CFGR_USART6EN);
}

/**
  * @brief  Disable TIM8  peripheral clock
  * @rmtoll TIM8         TIM8EN         LL_RCC_TIM8_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM8_DisableClock(void)
{
  CLEAR_BIT(RCC->TIM8CFGR, RCC_TIM8CFGR_TIM8EN);
}

/**
  * @brief  Disable TIM1  peripheral clock
  * @rmtoll TIM1         TIM1EN         LL_RCC_TIM1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM1_DisableClock(void)
{
  CLEAR_BIT(RCC->TIM1CFGR, RCC_TIM1CFGR_TIM1EN);
}

#if defined(RCC_UART8CFGR_UART8LPEN)
/**
  * @brief  Enable UART8 peripheral clocks enable during CSleep mode
  * @rmtoll UART8         UART8LPEN         LL_RCC_UART8_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART8_EnableClockSleep(void)
{
  SET_BIT(RCC->UART8CFGR, RCC_UART8CFGR_UART8LPEN);
}
#endif /* RCC_UART8CFGR_UART8LPEN */

/**
  * @brief  Enable UART7 peripheral clocks enable during CSleep mode
  * @rmtoll UART7         UART7LPEN         LL_RCC_UART7_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART7_EnableClockSleep(void)
{
  SET_BIT(RCC->UART7CFGR, RCC_UART7CFGR_UART7LPEN);
}

#if defined(RCC_SPI7CFGR_SPI7LPEN)
/**
  * @brief  Enable SPI7 peripheral clocks enable during CSleep mode
  * @rmtoll SPI7         SPI7LPEN         LL_RCC_SPI7_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI7_EnableClockSleep(void)
{
  SET_BIT(RCC->SPI7CFGR, RCC_SPI7CFGR_SPI7LPEN);
}
#endif /* RCC_SPI7CFGR_SPI7LPEN */

#if defined(RCC_SPI6CFGR_SPI6LPEN)
/**
  * @brief  Enable SPI6 peripheral clocks enable during CSleep mode
  * @rmtoll SPI6         SPI6LPEN         LL_RCC_SPI6_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI6_EnableClockSleep(void)
{
  SET_BIT(RCC->SPI6CFGR, RCC_SPI6CFGR_SPI6LPEN);
}
#endif /* RCC_SPI6CFGR_SPI6LPEN */

/**
  * @brief  Enable SAI4 peripheral clocks enable during CSleep mode
  * @rmtoll SAI4         SAI4LPEN         LL_RCC_SAI4_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI4_EnableClockSleep(void)
{
  SET_BIT(RCC->SAI4CFGR, RCC_SAI4CFGR_SAI4LPEN);
}

/**
  * @brief  Enable USART1 peripheral clocks enable during CSleep mode
  * @rmtoll USART1         USART1LPEN         LL_RCC_USART1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART1_EnableClockSleep(void)
{
  SET_BIT(RCC->USART1CFGR, RCC_USART1CFGR_USART1LPEN);
}

#if defined(RCC_TIM20CFGR_TIM20LPEN)
/**
  * @brief  Enable TIM20 peripheral clocks enable during CSleep mode
  * @rmtoll TIM20         TIM20LPEN         LL_RCC_TIM20_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM20_EnableClockSleep(void)
{
  SET_BIT(RCC->TIM20CFGR, RCC_TIM20CFGR_TIM20LPEN);
}
#endif /* RCC_TIM20CFGR_TIM20LPEN */

/**
  * @brief  Enable FDCAN peripheral clocks enable during CSleep mode
  * @rmtoll FDCAN         FDCANLPEN         LL_RCC_FDCAN_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_FDCAN_EnableClockSleep(void)
{
  SET_BIT(RCC->FDCANCFGR, RCC_FDCANCFGR_FDCANLPEN);
}

#if defined(RCC_UART9CFGR_UART9LPEN)
/**
  * @brief  Enable UART9 peripheral clocks enable during CSleep mode
  * @rmtoll UART9         UART9LPEN         LL_RCC_UART9_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART9_EnableClockSleep(void)
{
  SET_BIT(RCC->UART9CFGR, RCC_UART9CFGR_UART9LPEN);
}
#endif /* RCC_UART9CFGR_UART9LPEN */

/**
  * @brief  Enable SAI3 peripheral clocks enable during CSleep mode
  * @rmtoll SAI3         SAI3LPEN         LL_RCC_SAI3_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI3_EnableClockSleep(void)
{
  SET_BIT(RCC->SAI3CFGR, RCC_SAI3CFGR_SAI3LPEN);
}

/**
  * @brief  Enable SAI2 peripheral clocks enable during CSleep mode
  * @rmtoll SAI2         SAI2LPEN         LL_RCC_SAI2_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI2_EnableClockSleep(void)
{
  SET_BIT(RCC->SAI2CFGR, RCC_SAI2CFGR_SAI2LPEN);
}

/**
  * @brief  Enable SAI1 peripheral clocks enable during CSleep mode
  * @rmtoll SAI1         SAI1LPEN         LL_RCC_SAI1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI1_EnableClockSleep(void)
{
  SET_BIT(RCC->SAI1CFGR, RCC_SAI1CFGR_SAI1LPEN);
}

/**
  * @brief  Enable SPI5 peripheral clocks enable during CSleep mode
  * @rmtoll SPI5         SPI5LPEN         LL_RCC_SPI5_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI5_EnableClockSleep(void)
{
  SET_BIT(RCC->SPI5CFGR, RCC_SPI5CFGR_SPI5LPEN);
}

/**
  * @brief  Enable TIM17 peripheral clocks enable during CSleep mode
  * @rmtoll TIM17         TIM17LPEN         LL_RCC_TIM17_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM17_EnableClockSleep(void)
{
  SET_BIT(RCC->TIM17CFGR, RCC_TIM17CFGR_TIM17LPEN);
}

/**
  * @brief  Enable TIM16 peripheral clocks enable during CSleep mode
  * @rmtoll TIM16         TIM16LPEN         LL_RCC_TIM16_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM16_EnableClockSleep(void)
{
  SET_BIT(RCC->TIM16CFGR, RCC_TIM16CFGR_TIM16LPEN);
}

/**
  * @brief  Enable TIM15 peripheral clocks enable during CSleep mode
  * @rmtoll TIM15         TIM15LPEN         LL_RCC_TIM15_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM15_EnableClockSleep(void)
{
  SET_BIT(RCC->TIM15CFGR, RCC_TIM15CFGR_TIM15LPEN);
}

/**
  * @brief  Enable SPI4 peripheral clocks enable during CSleep mode
  * @rmtoll SPI4         SPI4LPEN         LL_RCC_SPI4_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI4_EnableClockSleep(void)
{
  SET_BIT(RCC->SPI4CFGR, RCC_SPI4CFGR_SPI4LPEN);
}

/**
  * @brief  Enable SPI1 peripheral clocks enable during CSleep mode
  * @rmtoll SPI1         SPI1LPEN         LL_RCC_SPI1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI1_EnableClockSleep(void)
{
  SET_BIT(RCC->SPI1CFGR, RCC_SPI1CFGR_SPI1LPEN);
}

/**
  * @brief  Enable USART6 peripheral clocks enable during CSleep mode
  * @rmtoll USART6         USART6LPEN         LL_RCC_USART6_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART6_EnableClockSleep(void)
{
  SET_BIT(RCC->USART6CFGR, RCC_USART6CFGR_USART6LPEN);
}

/**
  * @brief  Enable TIM8 peripheral clocks enable during CSleep mode
  * @rmtoll TIM8         TIM8LPEN         LL_RCC_TIM8_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM8_EnableClockSleep(void)
{
  SET_BIT(RCC->TIM8CFGR, RCC_TIM8CFGR_TIM8LPEN);
}

/**
  * @brief  Enable TIM1 peripheral clocks enable during CSleep mode
  * @rmtoll TIM1         TIM1LPEN         LL_RCC_TIM1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM1_EnableClockSleep(void)
{
  SET_BIT(RCC->TIM1CFGR, RCC_TIM1CFGR_TIM1LPEN);
}

#if defined(RCC_UART8CFGR_UART8LPEN)
/**
  * @brief  Disable UART8 peripheral clocks during CSleep mode
  * @rmtoll UART8         UART8LPEN         LL_RCC_UART8_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART8_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->UART8CFGR, RCC_UART8CFGR_UART8LPEN);
}
#endif /* RCC_UART8CFGR_UART8LPEN */

/**
  * @brief  Disable UART7 peripheral clocks during CSleep mode
  * @rmtoll UART7         UART7LPEN         LL_RCC_UART7_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART7_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->UART7CFGR, RCC_UART7CFGR_UART7LPEN);
}

#if defined(RCC_SPI7CFGR_SPI7LPEN)
/**
  * @brief  Disable SPI7 peripheral clocks during CSleep mode
  * @rmtoll SPI7         SPI7LPEN         LL_RCC_SPI7_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI7_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->SPI7CFGR, RCC_SPI7CFGR_SPI7LPEN);
}
#endif /* RCC_SPI7CFGR_SPI7LPEN */

#if defined(RCC_SPI6CFGR_SPI6LPEN)
/**
  * @brief  Disable SPI6 peripheral clocks during CSleep mode
  * @rmtoll SPI6         SPI6LPEN         LL_RCC_SPI6_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI6_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->SPI6CFGR, RCC_SPI6CFGR_SPI6LPEN);
}
#endif /* RCC_SPI6CFGR_SPI6LPEN */

/**
  * @brief  Disable SAI4 peripheral clocks during CSleep mode
  * @rmtoll SAI4         SAI4LPEN         LL_RCC_SAI4_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI4_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->SAI4CFGR, RCC_SAI4CFGR_SAI4LPEN);
}

/**
  * @brief  Disable USART1 peripheral clocks during CSleep mode
  * @rmtoll USART1         USART1LPEN         LL_RCC_USART1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->USART1CFGR, RCC_USART1CFGR_USART1LPEN);
}

#if defined(RCC_TIM20CFGR_TIM20LPEN)
/**
  * @brief  Disable TIM20 peripheral clocks during CSleep mode
  * @rmtoll TIM20         TIM20LPEN         LL_RCC_TIM20_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM20_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->TIM20CFGR, RCC_TIM20CFGR_TIM20LPEN);
}
#endif /* RCC_TIM20CFGR_TIM20LPEN */

/**
  * @brief  Disable FDCAN peripheral clocks during CSleep mode
  * @rmtoll FDCAN         FDCANLPEN         LL_RCC_FDCAN_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_FDCAN_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->FDCANCFGR, RCC_FDCANCFGR_FDCANLPEN);
}

#if defined(RCC_UART9CFGR_UART9LPEN)
/**
  * @brief  Disable UART9 peripheral clocks during CSleep mode
  * @rmtoll UART9         UART9LPEN         LL_RCC_UART9_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART9_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->UART9CFGR, RCC_UART9CFGR_UART9LPEN);
}
#endif /* RCC_UART9CFGR_UART9LPEN */

/**
  * @brief  Disable SAI3 peripheral clocks during CSleep mode
  * @rmtoll SAI3         SAI3LPEN         LL_RCC_SAI3_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI3_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->SAI3CFGR, RCC_SAI3CFGR_SAI3LPEN);
}

/**
  * @brief  Disable SAI2 peripheral clocks during CSleep mode
  * @rmtoll SAI2         SAI2LPEN         LL_RCC_SAI2_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI2_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->SAI2CFGR, RCC_SAI2CFGR_SAI2LPEN);
}

/**
  * @brief  Disable SAI1 peripheral clocks during CSleep mode
  * @rmtoll SAI1         SAI1LPEN         LL_RCC_SAI1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->SAI1CFGR, RCC_SAI1CFGR_SAI1LPEN);
}

/**
  * @brief  Disable SPI5 peripheral clocks during CSleep mode
  * @rmtoll SPI5         SPI5LPEN         LL_RCC_SPI5_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI5_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->SPI5CFGR, RCC_SPI5CFGR_SPI5LPEN);
}

/**
  * @brief  Disable TIM17 peripheral clocks during CSleep mode
  * @rmtoll TIM17         TIM17LPEN         LL_RCC_TIM17_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM17_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->TIM17CFGR, RCC_TIM17CFGR_TIM17LPEN);
}

/**
  * @brief  Disable TIM16 peripheral clocks during CSleep mode
  * @rmtoll TIM16         TIM16LPEN         LL_RCC_TIM16_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM16_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->TIM16CFGR, RCC_TIM16CFGR_TIM16LPEN);
}

/**
  * @brief  Disable TIM15 peripheral clocks during CSleep mode
  * @rmtoll TIM15         TIM15LPEN         LL_RCC_TIM15_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM15_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->TIM15CFGR, RCC_TIM15CFGR_TIM15LPEN);
}

/**
  * @brief  Disable SPI4 peripheral clocks during CSleep mode
  * @rmtoll SPI4         SPI4LPEN         LL_RCC_SPI4_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI4_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->SPI4CFGR, RCC_SPI4CFGR_SPI4LPEN);
}

/**
  * @brief  Disable SPI1 peripheral clocks during CSleep mode
  * @rmtoll SPI1         SPI1LPEN         LL_RCC_SPI1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->SPI1CFGR, RCC_SPI1CFGR_SPI1LPEN);
}

/**
  * @brief  Disable USART6 peripheral clocks during CSleep mode
  * @rmtoll USART6         USART6LPEN         LL_RCC_USART6_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART6_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->USART6CFGR, RCC_USART6CFGR_USART6LPEN);
}

/**
  * @brief  Disable TIM8 peripheral clocks during CSleep mode
  * @rmtoll TIM8         TIM8LPEN         LL_RCC_TIM8_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM8_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->TIM8CFGR, RCC_TIM8CFGR_TIM8LPEN);
}

/**
  * @brief  Disable TIM1 peripheral clocks during CSleep mode
  * @rmtoll TIM1         TIM1LPEN         LL_RCC_TIM1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->TIM1CFGR, RCC_TIM1CFGR_TIM1LPEN);
}

#if defined(RCC_UART8CFGR_UART8RST)
/**
  * @brief  Assert UART8 reset
  * @rmtoll UART8         UART8RST         LL_RCC_UART8_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART8_ForceReset(void)
{
  SET_BIT(RCC->UART8CFGR, RCC_UART8CFGR_UART8RST);
}
#endif /* RCC_UART8CFGR_UART8RST */

/**
  * @brief  Assert UART7 reset
  * @rmtoll UART7         UART7RST         LL_RCC_UART7_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART7_ForceReset(void)
{
  SET_BIT(RCC->UART7CFGR, RCC_UART7CFGR_UART7RST);
}

#if defined(RCC_SPI7CFGR_SPI7RST)
/**
  * @brief  Assert SPI7 reset
  * @rmtoll SPI7         SPI7RST         LL_RCC_SPI7_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI7_ForceReset(void)
{
  SET_BIT(RCC->SPI7CFGR, RCC_SPI7CFGR_SPI7RST);
}
#endif /* RCC_SPI7CFGR_SPI7RST */

#if defined(RCC_SPI6CFGR_SPI6RST)
/**
  * @brief  Assert SPI6 reset
  * @rmtoll SPI6         SPI6RST         LL_RCC_SPI6_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI6_ForceReset(void)
{
  SET_BIT(RCC->SPI6CFGR, RCC_SPI6CFGR_SPI6RST);
}
#endif /* RCC_SPI6CFGR_SPI6RST */

/**
  * @brief  Assert SAI4 reset
  * @rmtoll SAI4         SAI4RST         LL_RCC_SAI4_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI4_ForceReset(void)
{
  SET_BIT(RCC->SAI4CFGR, RCC_SAI4CFGR_SAI4RST);
}

/**
  * @brief  Assert USART1 reset
  * @rmtoll USART1         USART1RST         LL_RCC_USART1_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART1_ForceReset(void)
{
  SET_BIT(RCC->USART1CFGR, RCC_USART1CFGR_USART1RST);
}

#if defined(RCC_TIM20CFGR_TIM20RST)
/**
  * @brief  Assert TIM20 reset
  * @rmtoll TIM20         TIM20RST         LL_RCC_TIM20_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM20_ForceReset(void)
{
  SET_BIT(RCC->TIM20CFGR, RCC_TIM20CFGR_TIM20RST);
}
#endif /* RCC_TIM20CFGR_TIM20RST */

/**
  * @brief  Assert FDCAN reset
  * @rmtoll FDCAN         FDCANRST         LL_RCC_FDCAN_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_FDCAN_ForceReset(void)
{
  SET_BIT(RCC->FDCANCFGR, RCC_FDCANCFGR_FDCANRST);
}

#if defined(RCC_UART9CFGR_UART9RST)
/**
  * @brief  Assert UART9 reset
  * @rmtoll UART9         UART9RST         LL_RCC_UART9_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART9_ForceReset(void)
{
  SET_BIT(RCC->UART9CFGR, RCC_UART9CFGR_UART9RST);
}
#endif /* RCC_UART9CFGR_UART9RST */

/**
  * @brief  Assert SAI3 reset
  * @rmtoll SAI3         SAI3RST         LL_RCC_SAI3_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI3_ForceReset(void)
{
  SET_BIT(RCC->SAI3CFGR, RCC_SAI3CFGR_SAI3RST);
}

/**
  * @brief  Assert SAI2 reset
  * @rmtoll SAI2         SAI2RST         LL_RCC_SAI2_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI2_ForceReset(void)
{
  SET_BIT(RCC->SAI2CFGR, RCC_SAI2CFGR_SAI2RST);
}

/**
  * @brief  Assert SAI1 reset
  * @rmtoll SAI1         SAI1RST         LL_RCC_SAI1_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI1_ForceReset(void)
{
  SET_BIT(RCC->SAI1CFGR, RCC_SAI1CFGR_SAI1RST);
}

/**
  * @brief  Assert SPI5 reset
  * @rmtoll SPI5         SPI5RST         LL_RCC_SPI5_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI5_ForceReset(void)
{
  SET_BIT(RCC->SPI5CFGR, RCC_SPI5CFGR_SPI5RST);
}

/**
  * @brief  Assert TIM17 reset
  * @rmtoll TIM17         TIM17RST         LL_RCC_TIM17_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM17_ForceReset(void)
{
  SET_BIT(RCC->TIM17CFGR, RCC_TIM17CFGR_TIM17RST);
}

/**
  * @brief  Assert TIM16 reset
  * @rmtoll TIM16         TIM16RST         LL_RCC_TIM16_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM16_ForceReset(void)
{
  SET_BIT(RCC->TIM16CFGR, RCC_TIM16CFGR_TIM16RST);
}

/**
  * @brief  Assert TIM15 reset
  * @rmtoll TIM15         TIM15RST         LL_RCC_TIM15_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM15_ForceReset(void)
{
  SET_BIT(RCC->TIM15CFGR, RCC_TIM15CFGR_TIM15RST);
}

/**
  * @brief  Assert SPI4 reset
  * @rmtoll SPI4         SPI4RST         LL_RCC_SPI4_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI4_ForceReset(void)
{
  SET_BIT(RCC->SPI4CFGR, RCC_SPI4CFGR_SPI4RST);
}

/**
  * @brief  Assert SPI1 reset
  * @rmtoll SPI1         SPI1RST         LL_RCC_SPI1_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI1_ForceReset(void)
{
  SET_BIT(RCC->SPI1CFGR, RCC_SPI1CFGR_SPI1RST);
}

/**
  * @brief  Assert USART6 reset
  * @rmtoll USART6         USART6RST         LL_RCC_USART6_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART6_ForceReset(void)
{
  SET_BIT(RCC->USART6CFGR, RCC_USART6CFGR_USART6RST);
}

/**
  * @brief  Assert TIM8 reset
  * @rmtoll TIM8         TIM8RST         LL_RCC_TIM8_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM8_ForceReset(void)
{
  SET_BIT(RCC->TIM8CFGR, RCC_TIM8CFGR_TIM8RST);
}

/**
  * @brief  Assert TIM1 reset
  * @rmtoll TIM1         TIM1RST         LL_RCC_TIM1_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM1_ForceReset(void)
{
  SET_BIT(RCC->TIM1CFGR, RCC_TIM1CFGR_TIM1RST);
}

#if defined(RCC_UART8CFGR_UART8RST)
/**
  * @brief  Release UART8 reset
  * @rmtoll UART8         UART8RST         LL_RCC_UART8_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART8_ReleaseReset(void)
{
  CLEAR_BIT(RCC->UART8CFGR, RCC_UART8CFGR_UART8RST);
}
#endif /* RCC_UART8CFGR_UART8RST */

/**
  * @brief  Release UART7 reset
  * @rmtoll UART7         UART7RST         LL_RCC_UART7_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART7_ReleaseReset(void)
{
  CLEAR_BIT(RCC->UART7CFGR, RCC_UART7CFGR_UART7RST);
}

#if defined(RCC_SPI7CFGR_SPI7RST)
/**
  * @brief  Release SPI7 reset
  * @rmtoll SPI7         SPI7RST         LL_RCC_SPI7_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI7_ReleaseReset(void)
{
  CLEAR_BIT(RCC->SPI7CFGR, RCC_SPI7CFGR_SPI7RST);
}
#endif /* RCC_SPI7CFGR_SPI7RST */

#if defined(RCC_SPI6CFGR_SPI6RST)
/**
  * @brief  Release SPI6 reset
  * @rmtoll SPI6         SPI6RST         LL_RCC_SPI6_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI6_ReleaseReset(void)
{
  CLEAR_BIT(RCC->SPI6CFGR, RCC_SPI6CFGR_SPI6RST);
}
#endif /* RCC_SPI6CFGR_SPI6RST */

/**
  * @brief  Release SAI4 reset
  * @rmtoll SAI4         SAI4RST         LL_RCC_SAI4_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI4_ReleaseReset(void)
{
  CLEAR_BIT(RCC->SAI4CFGR, RCC_SAI4CFGR_SAI4RST);
}

/**
  * @brief  Release USART1 reset
  * @rmtoll USART1         USART1RST         LL_RCC_USART1_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART1_ReleaseReset(void)
{
  CLEAR_BIT(RCC->USART1CFGR, RCC_USART1CFGR_USART1RST);
}

#if defined(RCC_TIM20CFGR_TIM20RST)
/**
  * @brief  Release TIM20 reset
  * @rmtoll TIM20         TIM20RST         LL_RCC_TIM20_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM20_ReleaseReset(void)
{
  CLEAR_BIT(RCC->TIM20CFGR, RCC_TIM20CFGR_TIM20RST);
}
#endif /* RCC_TIM20CFGR_TIM20RST */

/**
  * @brief  Release FDCAN reset
  * @rmtoll FDCAN         FDCANRST         LL_RCC_FDCAN_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_FDCAN_ReleaseReset(void)
{
  CLEAR_BIT(RCC->FDCANCFGR, RCC_FDCANCFGR_FDCANRST);
}

#if defined(RCC_UART9CFGR_UART9RST)
/**
  * @brief  Release UART9 reset
  * @rmtoll UART9         UART9RST         LL_RCC_UART9_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UART9_ReleaseReset(void)
{
  CLEAR_BIT(RCC->UART9CFGR, RCC_UART9CFGR_UART9RST);
}
#endif /* RCC_UART9CFGR_UART9RST */

