zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_bus.h
/**
  * @brief  Release SAI3 reset
  * @rmtoll SAI3         SAI3RST         LL_RCC_SAI3_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI3_ReleaseReset(void)
{
  CLEAR_BIT(RCC->SAI3CFGR, RCC_SAI3CFGR_SAI3RST);
}

/**
  * @brief  Release SAI2 reset
  * @rmtoll SAI2         SAI2RST         LL_RCC_SAI2_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI2_ReleaseReset(void)
{
  CLEAR_BIT(RCC->SAI2CFGR, RCC_SAI2CFGR_SAI2RST);
}

/**
  * @brief  Release SAI1 reset
  * @rmtoll SAI1         SAI1RST         LL_RCC_SAI1_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SAI1_ReleaseReset(void)
{
  CLEAR_BIT(RCC->SAI1CFGR, RCC_SAI1CFGR_SAI1RST);
}

/**
  * @brief  Release SPI5 reset
  * @rmtoll SPI5         SPI5RST         LL_RCC_SPI5_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI5_ReleaseReset(void)
{
  CLEAR_BIT(RCC->SPI5CFGR, RCC_SPI5CFGR_SPI5RST);
}

/**
  * @brief  Release TIM17 reset
  * @rmtoll TIM17         TIM17RST         LL_RCC_TIM17_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM17_ReleaseReset(void)
{
  CLEAR_BIT(RCC->TIM17CFGR, RCC_TIM17CFGR_TIM17RST);
}

/**
  * @brief  Release TIM16 reset
  * @rmtoll TIM16         TIM16RST         LL_RCC_TIM16_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM16_ReleaseReset(void)
{
  CLEAR_BIT(RCC->TIM16CFGR, RCC_TIM16CFGR_TIM16RST);
}

/**
  * @brief  Release TIM15 reset
  * @rmtoll TIM15         TIM15RST         LL_RCC_TIM15_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM15_ReleaseReset(void)
{
  CLEAR_BIT(RCC->TIM15CFGR, RCC_TIM15CFGR_TIM15RST);
}

/**
  * @brief  Release SPI4 reset
  * @rmtoll SPI4         SPI4RST         LL_RCC_SPI4_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI4_ReleaseReset(void)
{
  CLEAR_BIT(RCC->SPI4CFGR, RCC_SPI4CFGR_SPI4RST);
}

/**
  * @brief  Release SPI1 reset
  * @rmtoll SPI1         SPI1RST         LL_RCC_SPI1_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI1_ReleaseReset(void)
{
  CLEAR_BIT(RCC->SPI1CFGR, RCC_SPI1CFGR_SPI1RST);
}

/**
  * @brief  Release USART6 reset
  * @rmtoll USART6         USART6RST         LL_RCC_USART6_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USART6_ReleaseReset(void)
{
  CLEAR_BIT(RCC->USART6CFGR, RCC_USART6CFGR_USART6RST);
}

/**
  * @brief  Release TIM8 reset
  * @rmtoll TIM8         TIM8RST         LL_RCC_TIM8_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM8_ReleaseReset(void)
{
  CLEAR_BIT(RCC->TIM8CFGR, RCC_TIM8CFGR_TIM8RST);
}

/**
  * @brief  Release TIM1 reset
  * @rmtoll TIM1         TIM1RST         LL_RCC_TIM1_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TIM1_ReleaseReset(void)
{
  CLEAR_BIT(RCC->TIM1CFGR, RCC_TIM1CFGR_TIM1RST);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB3 APB3
  * @{
  */
/**
  * @brief  Enable HDP  peripheral clock
  * @rmtoll HDP         HDPEN         LL_RCC_HDP_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HDP_EnableClock(void)
{
  SET_BIT(RCC->HDPCFGR, RCC_HDPCFGR_HDPEN);
}

/**
  * @brief  Enable WWDG1  peripheral clock
  * @rmtoll WWDG1         WWDG1EN         LL_RCC_WWDG1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_WWDG1_EnableClock(void)
{
  SET_BIT(RCC->WWDG1CFGR, RCC_WWDG1CFGR_WWDG1EN);
}

/**
  * @brief  Enable IWDG4  peripheral clock
  * @rmtoll IWDG4         IWDG4EN         LL_RCC_IWDG4_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IWDG4_EnableClock(void)
{
  SET_BIT(RCC->IWDG4CFGR, RCC_IWDG4CFGR_IWDG4EN);
}

/**
  * @brief  Enable VREF  peripheral clock
  * @rmtoll VREF         VREFEN         LL_RCC_VREF_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_VREF_EnableClock(void)
{
  SET_BIT(RCC->VREFCFGR, RCC_VREFCFGR_VREFEN);
}

/**
  * @brief  Enable IWDG3  peripheral clock
  * @rmtoll IWDG3         IWDG3EN         LL_RCC_IWDG3_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IWDG3_EnableClock(void)
{
  SET_BIT(RCC->IWDG3CFGR, RCC_IWDG3CFGR_IWDG3EN);
}

/**
  * @brief  Enable IWDG2  peripheral clock
  * @rmtoll IWDG2         IWDG2EN         LL_RCC_IWDG2_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IWDG2_EnableClock(void)
{
  SET_BIT(RCC->IWDG2CFGR, RCC_IWDG2CFGR_IWDG2EN);
}

/**
  * @brief  Enable IWDG1  peripheral clock
  * @rmtoll IWDG1         IWDG1EN         LL_RCC_IWDG1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IWDG1_EnableClock(void)
{
  SET_BIT(RCC->IWDG1CFGR, RCC_IWDG1CFGR_IWDG1EN);
}

/**
  * @brief  Enable BSEC  peripheral clock
  * @rmtoll BSEC         BSECEN         LL_RCC_BSEC_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_BSEC_EnableClock(void)
{
  SET_BIT(RCC->BSECCFGR, RCC_BSECCFGR_BSECEN);
}

/**
  * @brief  Disable HDP  peripheral clock
  * @rmtoll HDP         HDPEN         LL_RCC_HDP_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HDP_DisableClock(void)
{
  CLEAR_BIT(RCC->HDPCFGR, RCC_HDPCFGR_HDPEN);
}

/**
  * @brief  Disable WWDG1  peripheral clock
  * @rmtoll WWDG1         WWDG1EN         LL_RCC_WWDG1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_WWDG1_DisableClock(void)
{
  CLEAR_BIT(RCC->WWDG1CFGR, RCC_WWDG1CFGR_WWDG1EN);
}

/**
  * @brief  Disable IWDG4  peripheral clock
  * @rmtoll IWDG4         IWDG4EN         LL_RCC_IWDG4_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IWDG4_DisableClock(void)
{
  CLEAR_BIT(RCC->IWDG4CFGR, RCC_IWDG4CFGR_IWDG4EN);
}

/**
  * @brief  Disable VREF  peripheral clock
  * @rmtoll VREF         VREFEN         LL_RCC_VREF_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_VREF_DisableClock(void)
{
  CLEAR_BIT(RCC->VREFCFGR, RCC_VREFCFGR_VREFEN);
}

/**
  * @brief  Disable IWDG3  peripheral clock
  * @rmtoll IWDG3         IWDG3EN         LL_RCC_IWDG3_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IWDG3_DisableClock(void)
{
  CLEAR_BIT(RCC->IWDG3CFGR, RCC_IWDG3CFGR_IWDG3EN);
}

/**
  * @brief  Disable IWDG2  peripheral clock
  * @rmtoll IWDG2         IWDG2EN         LL_RCC_IWDG2_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IWDG2_DisableClock(void)
{
  CLEAR_BIT(RCC->IWDG2CFGR, RCC_IWDG2CFGR_IWDG2EN);
}

/**
  * @brief  Disable IWDG1  peripheral clock
  * @rmtoll IWDG1         IWDG1EN         LL_RCC_IWDG1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IWDG1_DisableClock(void)
{
  CLEAR_BIT(RCC->IWDG1CFGR, RCC_IWDG1CFGR_IWDG1EN);
}

/**
  * @brief  Disable BSEC  peripheral clock
  * @rmtoll BSEC         BSECEN         LL_RCC_BSEC_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_BSEC_DisableClock(void)
{
  CLEAR_BIT(RCC->BSECCFGR, RCC_BSECCFGR_BSECEN);
}

/**
  * @brief  Enable WWDG1 peripheral clocks enable during CSleep mode
  * @rmtoll WWDG1         WWDG1LPEN         LL_RCC_WWDG1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_WWDG1_EnableClockSleep(void)
{
  SET_BIT(RCC->WWDG1CFGR, RCC_WWDG1CFGR_WWDG1LPEN);
}

/**
  * @brief  Enable IWDG4 peripheral clocks enable during CSleep mode
  * @rmtoll IWDG4         IWDG4LPEN         LL_RCC_IWDG4_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IWDG4_EnableClockSleep(void)
{
  SET_BIT(RCC->IWDG4CFGR, RCC_IWDG4CFGR_IWDG4LPEN);
}

/**
  * @brief  Enable VREF peripheral clocks enable during CSleep mode
  * @rmtoll VREF         VREFLPEN         LL_RCC_VREF_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_VREF_EnableClockSleep(void)
{
  SET_BIT(RCC->VREFCFGR, RCC_VREFCFGR_VREFLPEN);
}

/**
  * @brief  Enable IWDG3 peripheral clocks enable during CSleep mode
  * @rmtoll IWDG3         IWDG3LPEN         LL_RCC_IWDG3_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IWDG3_EnableClockSleep(void)
{
  SET_BIT(RCC->IWDG3CFGR, RCC_IWDG3CFGR_IWDG3LPEN);
}

/**
  * @brief  Enable IWDG2 peripheral clocks enable during CSleep mode
  * @rmtoll IWDG2         IWDG2LPEN         LL_RCC_IWDG2_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IWDG2_EnableClockSleep(void)
{
  SET_BIT(RCC->IWDG2CFGR, RCC_IWDG2CFGR_IWDG2LPEN);
}

/**
  * @brief  Enable IWDG1 peripheral clocks enable during CSleep mode
  * @rmtoll IWDG1         IWDG1LPEN         LL_RCC_IWDG1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IWDG1_EnableClockSleep(void)
{
  SET_BIT(RCC->IWDG1CFGR, RCC_IWDG1CFGR_IWDG1LPEN);
}

/**
  * @brief  Enable BSEC peripheral clocks enable during CSleep mode
  * @rmtoll BSEC         BSECLPEN         LL_RCC_BSEC_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_BSEC_EnableClockSleep(void)
{
  SET_BIT(RCC->BSECCFGR, RCC_BSECCFGR_BSECLPEN);
}

/**
  * @brief  Disable WWDG1 peripheral clocks during CSleep mode
  * @rmtoll WWDG1         WWDG1LPEN         LL_RCC_WWDG1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_WWDG1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->WWDG1CFGR, RCC_WWDG1CFGR_WWDG1LPEN);
}

/**
  * @brief  Disable IWDG4 peripheral clocks during CSleep mode
  * @rmtoll IWDG4         IWDG4LPEN         LL_RCC_IWDG4_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IWDG4_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->IWDG4CFGR, RCC_IWDG4CFGR_IWDG4LPEN);
}

/**
  * @brief  Disable VREF peripheral clocks during CSleep mode
  * @rmtoll VREF         VREFLPEN         LL_RCC_VREF_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_VREF_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->VREFCFGR, RCC_VREFCFGR_VREFLPEN);
}

/**
  * @brief  Disable IWDG3 peripheral clocks during CSleep mode
  * @rmtoll IWDG3         IWDG3LPEN         LL_RCC_IWDG3_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IWDG3_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->IWDG3CFGR, RCC_IWDG3CFGR_IWDG3LPEN);
}

/**
  * @brief  Disable IWDG2 peripheral clocks during CSleep mode
  * @rmtoll IWDG2         IWDG2LPEN         LL_RCC_IWDG2_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IWDG2_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->IWDG2CFGR, RCC_IWDG2CFGR_IWDG2LPEN);
}

/**
  * @brief  Disable IWDG1 peripheral clocks during CSleep mode
  * @rmtoll IWDG1         IWDG1LPEN         LL_RCC_IWDG1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IWDG1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->IWDG1CFGR, RCC_IWDG1CFGR_IWDG1LPEN);
}

/**
  * @brief  Disable BSEC peripheral clocks during CSleep mode
  * @rmtoll BSEC         BSECLPEN         LL_RCC_BSEC_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_BSEC_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->BSECCFGR, RCC_BSECCFGR_BSECLPEN);
}

/**
  * @brief  Assert HDP reset
  * @rmtoll HDP         HDPRST         LL_RCC_HDP_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HDP_ForceReset(void)
{
  SET_BIT(RCC->HDPCFGR, RCC_HDPCFGR_HDPRST);
}

/**
  * @brief  Assert WWDG1 reset
  * @rmtoll WWDG1         WWDG1RST         LL_RCC_WWDG1_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_WWDG1_ForceReset(void)
{
  SET_BIT(RCC->WWDG1CFGR, RCC_WWDG1CFGR_WWDG1RST);
}

/**
  * @brief  Assert VREF reset
  * @rmtoll VREF         VREFRST         LL_RCC_VREF_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_VREF_ForceReset(void)
{
  SET_BIT(RCC->VREFCFGR, RCC_VREFCFGR_VREFRST);
}

/**
  * @brief  Release HDP reset
  * @rmtoll HDP         HDPRST         LL_RCC_HDP_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HDP_ReleaseReset(void)
{
  CLEAR_BIT(RCC->HDPCFGR, RCC_HDPCFGR_HDPRST);
}

/**
  * @brief  Release WWDG1 reset
  * @rmtoll WWDG1         WWDG1RST         LL_RCC_WWDG1_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_WWDG1_ReleaseReset(void)
{
  CLEAR_BIT(RCC->WWDG1CFGR, RCC_WWDG1CFGR_WWDG1RST);
}

/**
  * @brief  Release VREF reset
  * @rmtoll VREF         VREFRST         LL_RCC_VREF_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_VREF_ReleaseReset(void)
{
  CLEAR_BIT(RCC->VREFCFGR, RCC_VREFCFGR_VREFRST);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB4 APB4
  * @{
  */
#if defined(RCC_UCPDCFGR_UCPDEN)
/**
  * @brief  Enable UCPD1  peripheral clock
  * @rmtoll UCPD1         UCPD1EN         LL_RCC_UCPD1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UCPD1_EnableClock(void)
{
  SET_BIT(RCC->UCPDCFGR, RCC_UCPDCFGR_UCPDEN);
}
#endif /* RCC_UCPDCFGR_UCPDEN */
#if defined(RCC_BUSPERFMCFGR_BUSPERFMEN)
/**
  * @brief  Enable BUSPERF  peripheral clock
  * @rmtoll BUSPERF         BUSPERFEN         LL_RCC_BUSPERF_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_BUSPERFM_EnableClock(void)
{
  SET_BIT(RCC->BUSPERFMCFGR, RCC_BUSPERFMCFGR_BUSPERFMEN);
}
#endif /* RCC_BUSPERFMCFGR_BUSPERFMEN */
#if defined(RCC_USB3PCIEPHYCFGR_USB3PCIEPHYEN)
/**
  * @brief  Enable USB3PCI  peripheral clock
  * @rmtoll USB3PCI         USB3PCIEN         LL_RCC_USB3PCI_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB3PCIEPHY_EnableClock(void)
{
  SET_BIT(RCC->USB3PCIEPHYCFGR, RCC_USB3PCIEPHYCFGR_USB3PCIEPHYEN);
}
#endif /* RCC_USB3PCIEPHYCFGR_USB3PCIEPHYEN */

/**
  * @brief  Enable LTDC  peripheral clock
  * @rmtoll LTDC         LTDCEN         LL_RCC_LTDC_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LTDC_EnableClock(void)
{
  SET_BIT(RCC->LTDCCFGR, RCC_LTDCCFGR_LTDCEN);
}

#if defined(RCC_GICV2MCFGR_GICV2MEN)
/**
  * @brief  Enable GICV2M  peripheral clock
  * @rmtoll GICV2M         GICV2MEN         LL_RCC_GICV2M_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GICV2M_EnableClock(void)
{
  SET_BIT(RCC->GICV2MCFGR, RCC_GICV2MCFGR_GICV2MEN);
}
#endif /* RCC_GICV2MCFGR_GICV2MEN */

#if defined(RCC_UCPDCFGR_UCPDEN)
/**
  * @brief  Disable UCPD1  peripheral clock
  * @rmtoll UCPD1         UCPD1EN         LL_RCC_UCPD1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UCPD1_DisableClock(void)
{
  CLEAR_BIT(RCC->UCPDCFGR, RCC_UCPDCFGR_UCPDEN);
}
#endif /* RCC_UCPDCFGR_UCPDEN */
#if defined(RCC_BUSPERFMCFGR_BUSPERFMEN)
/**
  * @brief  Disable BUSPERF  peripheral clock
  * @rmtoll BUSPERF         BUSPERFEN         LL_RCC_BUSPERF_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_BUSPERFM_DisableClock(void)
{
  CLEAR_BIT(RCC->BUSPERFMCFGR, RCC_BUSPERFMCFGR_BUSPERFMEN);
}
#endif /* RCC_BUSPERFMCFGR_BUSPERFMEN */
#if defined(RCC_USB3PCIEPHYCFGR_USB3PCIEPHYEN)
/**
  * @brief  Disable USB3PCI  peripheral clock
  * @rmtoll USB3PCI         USB3PCIEN         LL_RCC_USB3PCI_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB3PCIEPHY_DisableClock(void)
{
  CLEAR_BIT(RCC->USB3PCIEPHYCFGR, RCC_USB3PCIEPHYCFGR_USB3PCIEPHYEN);
}
#endif /* RCC_USB3PCIEPHYCFGR_USB3PCIEPHYEN */

/**
  * @brief  Disable LTDC  peripheral clock
  * @rmtoll LTDC         LTDCEN         LL_RCC_LTDC_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LTDC_DisableClock(void)
{
  CLEAR_BIT(RCC->LTDCCFGR, RCC_LTDCCFGR_LTDCEN);
}

#if defined(RCC_GICV2MCFGR_GICV2MEN)
/**
  * @brief  Disable GICV2M  peripheral clock
  * @rmtoll GICV2M         GICV2MEN         LL_RCC_GICV2M_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GICV2M_DisableClock(void)
{
  CLEAR_BIT(RCC->GICV2MCFGR, RCC_GICV2MCFGR_GICV2MEN);
}
#endif /* RCC_GICV2MCFGR_GICV2MEN */

#if defined(RCC_UCPDCFGR_UCPDLPEN)
/**
  * @brief  Enable UCPD1 peripheral clocks enable during CSleep mode
  * @rmtoll UCPD1         UCPD1LPEN         LL_RCC_UCPD1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UCPD1_EnableClockSleep(void)
{
  SET_BIT(RCC->UCPDCFGR, RCC_UCPDCFGR_UCPDLPEN);
}
#endif /* RCC_UCPDCFGR_UCPDLPEN */
#if defined(RCC_BUSPERFMCFGR_BUSPERFMLPEN)
/**
  * @brief  Enable BUSPERF peripheral clocks enable during CSleep mode
  * @rmtoll BUSPERF         BUSPERFLPEN         LL_RCC_BUSPERF_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_BUSPERFM_EnableClockSleep(void)
{
  SET_BIT(RCC->BUSPERFMCFGR, RCC_BUSPERFMCFGR_BUSPERFMLPEN);
}
#endif /* RCC_BUSPERFMCFGR_BUSPERFMLPEN */
#if defined(RCC_USB3PCIEPHYCFGR_USB3PCIEPHYLPEN)
/**
  * @brief  Enable USB3PCI peripheral clocks enable during CSleep mode
  * @rmtoll USB3PCI         USB3PCILPEN         LL_RCC_USB3PCI_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB3PCIEPHY_EnableClockSleep(void)
{
  SET_BIT(RCC->USB3PCIEPHYCFGR, RCC_USB3PCIEPHYCFGR_USB3PCIEPHYLPEN);
}
#endif /* RCC_USB3PCIEPHYCFGR_USB3PCIEPHYLPEN */

/**
  * @brief  Enable LTDC peripheral clocks enable during CSleep mode
  * @rmtoll LTDC         LTDCLPEN         LL_RCC_LTDC_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LTDC_EnableClockSleep(void)
{
  SET_BIT(RCC->LTDCCFGR, RCC_LTDCCFGR_LTDCLPEN);
}

#if defined(RCC_GICV2MCFGR_GICV2MLPEN)
/**
  * @brief  Enable GICV2M peripheral clocks enable during CSleep mode
  * @rmtoll GICV2M         GICV2MLPEN         LL_RCC_GICV2M_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GICV2M_EnableClockSleep(void)
{
  SET_BIT(RCC->GICV2MCFGR, RCC_GICV2MCFGR_GICV2MLPEN);
}
#endif /* RCC_GICV2MCFGR_GICV2MLPEN */

#if defined(RCC_UCPDCFGR_UCPDLPEN)
/**
  * @brief  Disable UCPD1 peripheral clocks during CSleep mode
  * @rmtoll UCPD1         UCPD1LPEN         LL_RCC_UCPD1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UCPD1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->UCPDCFGR, RCC_UCPDCFGR_UCPDLPEN);
}
#endif /* RCC_UCPDCFGR_UCPDLPEN */
#if defined(RCC_BUSPERFMCFGR_BUSPERFMLPEN)
/**
  * @brief  Disable BUSPERF peripheral clocks during CSleep mode
  * @rmtoll BUSPERF         BUSPERFLPEN         LL_RCC_BUSPERF_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_BUSPERFM_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->BUSPERFMCFGR, RCC_BUSPERFMCFGR_BUSPERFMLPEN);
}
#endif /* RCC_BUSPERFMCFGR_BUSPERFMLPEN */
#if defined(RCC_USB3PCIEPHYCFGR_USB3PCIEPHYLPEN)
/**
  * @brief  Disable USB3PCI peripheral clocks during CSleep mode
  * @rmtoll USB3PCI         USB3PCILPEN         LL_RCC_USB3PCI_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB3PCIEPHY_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->USB3PCIEPHYCFGR, RCC_USB3PCIEPHYCFGR_USB3PCIEPHYLPEN);
}
#endif /* RCC_USB3PCIEPHYCFGR_USB3PCIEPHYLPEN */

/**
  * @brief  Disable LTDC peripheral clocks during CSleep mode
  * @rmtoll LTDC         LTDCLPEN         LL_RCC_LTDC_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LTDC_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->LTDCCFGR, RCC_LTDCCFGR_LTDCLPEN);
}

#if defined(RCC_GICV2MCFGR_GICV2MLPEN)
/**
  * @brief  Disable GICV2M peripheral clocks during CSleep mode
  * @rmtoll GICV2M         GICV2MLPEN         LL_RCC_GICV2M_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_GICV2M_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->GICV2MCFGR, RCC_GICV2MCFGR_GICV2MLPEN);
}
#endif /* RCC_GICV2MCFGR_GICV2MLPEN */

#if defined(RCC_UCPDCFGR_UCPDRST)
/**
  * @brief  Assert UCPD1 reset
  * @rmtoll UCPD1         UCPD1RST         LL_RCC_UCPD1_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UCPD1_ForceReset(void)
{
  SET_BIT(RCC->UCPDCFGR, RCC_UCPDCFGR_UCPDRST);
}
#endif /* RCC_UCPDCFGR_UCPDRST */
#if defined(RCC_BUSPERFMCFGR_BUSPERFMRST)
/**
  * @brief  Assert BUSPERF reset
  * @rmtoll BUSPERF         BUSPERFRST         LL_RCC_BUSPERF_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_BUSPERFM_ForceReset(void)
{
  SET_BIT(RCC->BUSPERFMCFGR, RCC_BUSPERFMCFGR_BUSPERFMRST);
}
#endif /* RCC_BUSPERFMCFGR_BUSPERFMRST */
#if defined(RCC_USB3PCIEPHYCFGR_USB3PCIEPHYRST)
/**
  * @brief  Assert USB3PCI reset
  * @rmtoll USB3PCI         USB3PCIRST         LL_RCC_USB3PCI_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB3PCIEPHY_ForceReset(void)
{
  SET_BIT(RCC->USB3PCIEPHYCFGR, RCC_USB3PCIEPHYCFGR_USB3PCIEPHYRST);
}
#endif /* RCC_USB3PCIEPHYCFGR_USB3PCIEPHYRST */

/**
  * @brief  Assert LTDC reset
  * @rmtoll LTDC         LTDCRST         LL_RCC_LTDC_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LTDC_ForceReset(void)
{
  SET_BIT(RCC->LTDCCFGR, RCC_LTDCCFGR_LTDCRST);
}

#if defined(RCC_UCPDCFGR_UCPDRST)
/**
  * @brief  Release UCPD1 reset
  * @rmtoll UCPD1         UCPD1RST         LL_RCC_UCPD1_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_UCPD1_ReleaseReset(void)
{
  CLEAR_BIT(RCC->UCPDCFGR, RCC_UCPDCFGR_UCPDRST);
}
#endif /* RCC_UCPDCFGR_UCPDRST */
#if defined(RCC_BUSPERFMCFGR_BUSPERFMRST)
/**
  * @brief  Release BUSPERF reset
  * @rmtoll BUSPERF         BUSPERFRST         LL_RCC_BUSPERF_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_BUSPERFM_ReleaseReset(void)
{
  CLEAR_BIT(RCC->BUSPERFMCFGR, RCC_BUSPERFMCFGR_BUSPERFMRST);
}
#endif /* RCC_BUSPERFMCFGR_BUSPERFMRST */
#if defined(RCC_USB3PCIEPHYCFGR_USB3PCIEPHYRST)
/**
  * @brief  Release USB3PCI reset
  * @rmtoll USB3PCI         USB3PCIRST         LL_RCC_USB3PCI_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_USB3PCIEPHY_ReleaseReset(void)
{
  CLEAR_BIT(RCC->USB3PCIEPHYCFGR, RCC_USB3PCIEPHYCFGR_USB3PCIEPHYRST);
}
#endif /* RCC_USB3PCIEPHYCFGR_USB3PCIEPHYRST */

/**
  * @brief  Release LTDC reset
  * @rmtoll LTDC         LTDCRST         LL_RCC_LTDC_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LTDC_ReleaseReset(void)
{
  CLEAR_BIT(RCC->LTDCCFGR, RCC_LTDCCFGR_LTDCRST);
}

/**
  * @}
  */

#if defined(RCC_WWDG2CFGR_WWDG2EN)
/** @defgroup BUS_LL_EF_APBSMARTRUN APB Smartrun
  * @{
  */
/**
  * @brief  Enable WWDG2  peripheral clock
  * @rmtoll WWDG2         WWDG2EN         LL_RCC_WWDG2_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_WWDG2_EnableClock(void)
{
  SET_BIT(RCC->WWDG2CFGR, RCC_WWDG2CFGR_WWDG2EN);
}
#endif /* RCC_WWDG2CFGR_WWDG2EN */

#if defined(RCC_I3C4CFGR_I3C4EN)
/**
  * @brief  Enable I3C4  peripheral clock
  * @rmtoll I3C4         I3C4EN         LL_RCC_I3C4_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C4_EnableClock(void)
{
  SET_BIT(RCC->I3C4CFGR, RCC_I3C4CFGR_I3C4EN);
}
#endif /* RCC_I3C4CFGR_I3C4EN */

