zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_bus.h
#if defined(RCC_IWDG5CFGR_IWDG5EN)
/**
  * @brief  Enable IWDG5  peripheral clock
  * @rmtoll IWDG5         IWDG5EN         LL_RCC_IWDG5_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IWDG5_EnableClock(void)
{
  SET_BIT(RCC->IWDG5CFGR, RCC_IWDG5CFGR_IWDG5EN);
}
#endif /* RCC_IWDG5CFGR_IWDG5EN */

/**
  * @brief  Enable LPTIM4  peripheral clock
  * @rmtoll LPTIM4         LPTIM4EN         LL_RCC_LPTIM4_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM4_EnableClock(void)
{
  SET_BIT(RCC->LPTIM4CFGR, RCC_LPTIM4CFGR_LPTIM4EN);
}

/**
  * @brief  Enable LPTIM5  peripheral clock
  * @rmtoll LPTIM5         LPTIM5EN         LL_RCC_LPTIM5_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM5_EnableClock(void)
{
  SET_BIT(RCC->LPTIM5CFGR, RCC_LPTIM5CFGR_LPTIM5EN);
}

#if defined(RCC_I2C8CFGR_I2C8EN)
/**
  * @brief  Enable I2C8  peripheral clock
  * @rmtoll I2C8         I2C8EN         LL_RCC_I2C8_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C8_EnableClock(void)
{
  SET_BIT(RCC->I2C8CFGR, RCC_I2C8CFGR_I2C8EN);
}
#endif /* RCC_I2C8CFGR_I2C8EN */
/**
  * @brief  Enable LPTIM3  peripheral clock
  * @rmtoll LPTIM3         LPTIM3EN         LL_RCC_LPTIM3_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM3_EnableClock(void)
{
  SET_BIT(RCC->LPTIM3CFGR, RCC_LPTIM3CFGR_LPTIM3EN);
}

#if defined(RCC_SPI8CFGR_SPI8EN)
/**
  * @brief  Enable SPI8  peripheral clock
  * @rmtoll SPI8         SPI8EN         LL_RCC_SPI8_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI8_EnableClock(void)
{
  SET_BIT(RCC->SPI8CFGR, RCC_SPI8CFGR_SPI8EN);
}
#endif /* RCC_SPI8CFGR_SPI8EN */

/**
  * @brief  Enable LPUART1  peripheral clock
  * @rmtoll LPUART1         LPUART1EN         LL_RCC_LPUART1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPUART1_EnableClock(void)
{
  SET_BIT(RCC->LPUART1CFGR, RCC_LPUART1CFGR_LPUART1EN);
}

/**
  * @brief  Enable RTC  peripheral clock
  * @rmtoll RTC         RTCEN         LL_RCC_RTC_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RTC_EnableClock(void)
{
  SET_BIT(RCC->RTCCFGR, RCC_RTCCFGR_RTCEN);
}

#if defined(RCC_WWDG2CFGR_WWDG2EN)
/**
  * @brief  Disable WWDG2  peripheral clock
  * @rmtoll WWDG2         WWDG2EN         LL_RCC_WWDG2_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_WWDG2_DisableClock(void)
{
  CLEAR_BIT(RCC->WWDG2CFGR, RCC_WWDG2CFGR_WWDG2EN);
}
#endif /* RCC_WWDG2CFGR_WWDG2EN */

#if defined(RCC_I3C4CFGR_I3C4EN)
/**
  * @brief  Disable I3C4  peripheral clock
  * @rmtoll I3C4         I3C4EN         LL_RCC_I3C4_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C4_DisableClock(void)
{
  CLEAR_BIT(RCC->I3C4CFGR, RCC_I3C4CFGR_I3C4EN);
}
#endif /* RCC_I3C4CFGR_I3C4EN */

#if defined(RCC_I3C4CFGR_I3C4EN)
/**
  * @brief  Disable IWDG5  peripheral clock
  * @rmtoll IWDG5         IWDG5EN         LL_RCC_IWDG5_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IWDG5_DisableClock(void)
{
  CLEAR_BIT(RCC->IWDG5CFGR, RCC_IWDG5CFGR_IWDG5EN);
}
#endif /* RCC_IWDG5CFGR_IWDG5EN */

/**
  * @brief  Disable LPTIM4  peripheral clock
  * @rmtoll LPTIM4         LPTIM4EN         LL_RCC_LPTIM4_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM4_DisableClock(void)
{
  CLEAR_BIT(RCC->LPTIM4CFGR, RCC_LPTIM4CFGR_LPTIM4EN);
}

/**
  * @brief  Disable LPTIM5  peripheral clock
  * @rmtoll LPTIM5         LPTIM5EN         LL_RCC_LPTIM5_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM5_DisableClock(void)
{
  CLEAR_BIT(RCC->LPTIM5CFGR, RCC_LPTIM5CFGR_LPTIM5EN);
}

#if defined(RCC_I2C8CFGR_I2C8EN)
/**
  * @brief  Disable I2C8  peripheral clock
  * @rmtoll I2C8         I2C8EN         LL_RCC_I2C8_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C8_DisableClock(void)
{
  CLEAR_BIT(RCC->I2C8CFGR, RCC_I2C8CFGR_I2C8EN);
}
#endif /* RCC_I2C8CFGR_I2C8EN */

/**
  * @brief  Disable LPTIM3  peripheral clock
  * @rmtoll LPTIM3         LPTIM3EN         LL_RCC_LPTIM3_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM3_DisableClock(void)
{
  CLEAR_BIT(RCC->LPTIM3CFGR, RCC_LPTIM3CFGR_LPTIM3EN);
}

#if defined(RCC_SPI8CFGR_SPI8EN)
/**
  * @brief  Disable SPI8  peripheral clock
  * @rmtoll SPI8         SPI8EN         LL_RCC_SPI8_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI8_DisableClock(void)
{
  CLEAR_BIT(RCC->SPI8CFGR, RCC_SPI8CFGR_SPI8EN);
}
#endif /* RCC_SPI8CFGR_SPI8EN */

/**
  * @brief  Disable LPUART1  peripheral clock
  * @rmtoll LPUART1         LPUART1EN         LL_RCC_LPUART1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPUART1_DisableClock(void)
{
  CLEAR_BIT(RCC->LPUART1CFGR, RCC_LPUART1CFGR_LPUART1EN);
}

/**
  * @brief  Disable RTC  peripheral clock
  * @rmtoll RTC         RTCEN         LL_RCC_RTC_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RTC_DisableClock(void)
{
  CLEAR_BIT(RCC->RTCCFGR, RCC_RTCCFGR_RTCEN);
}

#if defined(RCC_WWDG2CFGR_WWDG2LPEN)
/**
  * @brief  Enable WWDG2 peripheral clocks enable during CSleep mode
  * @rmtoll WWDG2         WWDG2LPEN         LL_RCC_WWDG2_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_WWDG2_EnableClockSleep(void)
{
  SET_BIT(RCC->WWDG2CFGR, RCC_WWDG2CFGR_WWDG2LPEN);
}
#endif /* RCC_WWDG2CFGR_WWDG2LPEN */

#if defined(RCC_I3C4CFGR_I3C4LPEN)
/**
  * @brief  Enable I3C4 peripheral clocks enable during CSleep mode
  * @rmtoll I3C4         I3C4LPEN         LL_RCC_I3C4_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C4_EnableClockSleep(void)
{
  SET_BIT(RCC->I3C4CFGR, RCC_I3C4CFGR_I3C4LPEN);
}
#endif /* RCC_I3C4CFGR_I3C4LPEN */

#if defined(RCC_I3C4CFGR_I3C4AMEN)
/**
  * @brief  Enable I3C4 peripheral clocks during Autonomous mode
  * @rmtoll I3C4         I3C4AMEN         LL_RCC_I3C4_EnableClockAutonomous
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C4_EnableClockAutonomous(void)
{
  SET_BIT(RCC->I3C4CFGR, RCC_I3C4CFGR_I3C4AMEN);
}
#endif /* RCC_I3C4CFGR_I3C4AMEN */

#if defined(RCC_IWDG5CFGR_IWDG5LPEN)
/**
  * @brief  Enable IWDG5 peripheral clocks enable during CSleep mode
  * @rmtoll IWDG5         IWDG5LPEN         LL_RCC_IWDG5_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IWDG5_EnableClockSleep(void)
{
  SET_BIT(RCC->IWDG5CFGR, RCC_IWDG5CFGR_IWDG5LPEN);
}
#endif /* RCC_IWDG5CFGR_IWDG5LPEN */

/**
  * @brief  Enable LPTIM4 peripheral clocks enable during CSleep mode
  * @rmtoll LPTIM4         LPTIM4LPEN         LL_RCC_LPTIM4_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM4_EnableClockSleep(void)
{
  SET_BIT(RCC->LPTIM4CFGR, RCC_LPTIM4CFGR_LPTIM4LPEN);
}

/**
  * @brief  Enable LPTIM5 peripheral clocks enable during CSleep mode
  * @rmtoll LPTIM5         LPTIM5LPEN         LL_RCC_LPTIM5_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM5_EnableClockSleep(void)
{
  SET_BIT(RCC->LPTIM5CFGR, RCC_LPTIM5CFGR_LPTIM5LPEN);
}

#if defined(RCC_I2C8CFGR_I2C8LPEN)
/**
  * @brief  Enable I2C8 peripheral clocks enable during CSleep mode
  * @rmtoll I2C8         I2C8LPEN         LL_RCC_I2C8_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C8_EnableClockSleep(void)
{
  SET_BIT(RCC->I2C8CFGR, RCC_I2C8CFGR_I2C8LPEN);
}
#endif /* RCC_I2C8CFGR_I2C8LPEN */

/**
  * @brief  Enable LPTIM3 peripheral clocks enable during CSleep mode
  * @rmtoll LPTIM3         LPTIM3LPEN         LL_RCC_LPTIM3_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM3_EnableClockSleep(void)
{
  SET_BIT(RCC->LPTIM3CFGR, RCC_LPTIM3CFGR_LPTIM3LPEN);
}

#if defined(RCC_SPI8CFGR_SPI8LPEN)
/**
  * @brief  Enable SPI8 peripheral clocks enable during CSleep mode
  * @rmtoll SPI8         SPI8LPEN         LL_RCC_SPI8_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI8_EnableClockSleep(void)
{
  SET_BIT(RCC->SPI8CFGR, RCC_SPI8CFGR_SPI8LPEN);
}
#endif /* RCC_SPI8CFGR_SPI8LPEN */

/**
  * @brief  Enable LPUART1 peripheral clocks enable during CSleep mode
  * @rmtoll LPUART1         LPUART1LPEN         LL_RCC_LPUART1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPUART1_EnableClockSleep(void)
{
  SET_BIT(RCC->LPUART1CFGR, RCC_LPUART1CFGR_LPUART1LPEN);
}

/**
  * @brief  Enable RTC peripheral clocks enable during CSleep mode
  * @rmtoll RTC         RTCLPEN         LL_RCC_RTC_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RTC_EnableClockSleep(void)
{
  SET_BIT(RCC->RTCCFGR, RCC_RTCCFGR_RTCLPEN);
}

#if defined(RCC_WWDG2CFGR_WWDG2LPEN)
/**
  * @brief  Disable WWDG2 peripheral clocks during CSleep mode
  * @rmtoll WWDG2         WWDG2LPEN         LL_RCC_WWDG2_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_WWDG2_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->WWDG2CFGR, RCC_WWDG2CFGR_WWDG2LPEN);
}
#endif /* RCC_WWDG2CFGR_WWDG2LPEN */

