zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_bus.h
#if defined(RCC_I3C4CFGR_I3C4LPEN)
/**
  * @brief  Disable I3C4 peripheral clocks during CSleep mode
  * @rmtoll I3C4         I3C4LPEN         LL_RCC_I3C4_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C4_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->I3C4CFGR, RCC_I3C4CFGR_I3C4LPEN);
}
#endif /* RCC_I3C4CFGR_I3C4LPEN */

#if defined(RCC_I3C4CFGR_I3C4AMEN)
/**
  * @brief  Disable I3C4 peripheral clocks during Autonomous mode
  * @rmtoll I3C4         I3C4AMEN         LL_RCC_I3C4_EnableClockAutonomous
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C4_DisableClockAutonomous(void)
{
  CLEAR_BIT(RCC->I3C4CFGR, RCC_I3C4CFGR_I3C4AMEN);
}
#endif /* RCC_I3C4CFGR_I3C4AMEN */

#if defined(RCC_IWDG5CFGR_IWDG5LPEN)
/**
  * @brief  Disable IWDG5 peripheral clocks during CSleep mode
  * @rmtoll IWDG5         IWDG5LPEN         LL_RCC_IWDG5_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IWDG5_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->IWDG5CFGR, RCC_IWDG5CFGR_IWDG5LPEN);
}
#endif /* RCC_IWDG5CFGR_IWDG5LPEN */

/**
  * @brief  Disable LPTIM4 peripheral clocks during CSleep mode
  * @rmtoll LPTIM4         LPTIM4LPEN         LL_RCC_LPTIM4_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM4_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->LPTIM4CFGR, RCC_LPTIM4CFGR_LPTIM4LPEN);
}

/**
  * @brief  Disable LPTIM5 peripheral clocks during CSleep mode
  * @rmtoll LPTIM5         LPTIM5LPEN         LL_RCC_LPTIM5_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM5_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->LPTIM5CFGR, RCC_LPTIM5CFGR_LPTIM5LPEN);
}

#if defined(RCC_I2C8CFGR_I2C8LPEN)
/**
  * @brief  Disable I2C8 peripheral clocks during CSleep mode
  * @rmtoll I2C8         I2C8LPEN         LL_RCC_I2C8_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C8_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->I2C8CFGR, RCC_I2C8CFGR_I2C8LPEN);
}
#endif /* RCC_I2C8CFGR_I2C8LPEN */

/**
  * @brief  Disable LPTIM3 peripheral clocks during CSleep mode
  * @rmtoll LPTIM3         LPTIM3LPEN         LL_RCC_LPTIM3_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM3_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->LPTIM3CFGR, RCC_LPTIM3CFGR_LPTIM3LPEN);
}

#if defined(RCC_SPI8CFGR_SPI8LPEN)
/**
  * @brief  Disable SPI8 peripheral clocks during CSleep mode
  * @rmtoll SPI8         SPI8LPEN         LL_RCC_SPI8_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI8_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->SPI8CFGR, RCC_SPI8CFGR_SPI8LPEN);
}
#endif /* RCC_SPI8CFGR_SPI8LPEN */

/**
  * @brief  Disable LPUART1 peripheral clocks during CSleep mode
  * @rmtoll LPUART1         LPUART1LPEN         LL_RCC_LPUART1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPUART1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->LPUART1CFGR, RCC_LPUART1CFGR_LPUART1LPEN);
}

/**
  * @brief  Disable RTC peripheral clocks during CSleep mode
  * @rmtoll RTC         RTCLPEN         LL_RCC_RTC_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RTC_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->RTCCFGR, RCC_RTCCFGR_RTCLPEN);
}

#if defined(RCC_WWDG2CFGR_WWDG2RST)
/**
  * @brief  Assert WWDG2 reset
  * @rmtoll WWDG2         WWDG2RST         LL_RCC_WWDG2_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_WWDG2_ForceReset(void)
{
  SET_BIT(RCC->WWDG2CFGR, RCC_WWDG2CFGR_WWDG2RST);
}
#endif /* RCC_WWDG2CFGR_WWDG2RST */

#if defined(RCC_I3C4CFGR_I3C4RST)
/**
  * @brief  Assert I3C4 reset
  * @rmtoll I3C4         I3C4RST         LL_RCC_I3C4_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C4_ForceReset(void)
{
  SET_BIT(RCC->I3C4CFGR, RCC_I3C4CFGR_I3C4RST);
}
#endif /* RCC_I3C4CFGR_I3C4RST */

/**
  * @brief  Assert LPTIM4 reset
  * @rmtoll LPTIM4         LPTIM4RST         LL_RCC_LPTIM4_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM4_ForceReset(void)
{
  SET_BIT(RCC->LPTIM4CFGR, RCC_LPTIM4CFGR_LPTIM4RST);
}

/**
  * @brief  Assert LPTIM5 reset
  * @rmtoll LPTIM5         LPTIM5RST         LL_RCC_LPTIM5_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM5_ForceReset(void)
{
  SET_BIT(RCC->LPTIM5CFGR, RCC_LPTIM5CFGR_LPTIM5RST);
}

#if defined(RCC_I2C8CFGR_I2C8RST)
/**
  * @brief  Assert I2C8 reset
  * @rmtoll I2C8         I2C8RST         LL_RCC_I2C8_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C8_ForceReset(void)
{
  SET_BIT(RCC->I2C8CFGR, RCC_I2C8CFGR_I2C8RST);
}
#endif /* RCC_I2C8CFGR_I2C8RST */

/**
  * @brief  Assert LPTIM3 reset
  * @rmtoll LPTIM3         LPTIM3RST         LL_RCC_LPTIM3_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM3_ForceReset(void)
{
  SET_BIT(RCC->LPTIM3CFGR, RCC_LPTIM3CFGR_LPTIM3RST);
}

#if defined(RCC_SPI8CFGR_SPI8RST)
/**
  * @brief  Assert SPI8 reset
  * @rmtoll SPI8         SPI8RST         LL_RCC_SPI8_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI8_ForceReset(void)
{
  SET_BIT(RCC->SPI8CFGR, RCC_SPI8CFGR_SPI8RST);
}
#endif /* RCC_SPI8CFGR_SPI8RST */

/**
  * @brief  Assert LPUART1 reset
  * @rmtoll LPUART1         LPUART1RST         LL_RCC_LPUART1_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPUART1_ForceReset(void)
{
  SET_BIT(RCC->LPUART1CFGR, RCC_LPUART1CFGR_LPUART1RST);
}

#if defined(RCC_WWDG2CFGR_WWDG2LPEN)
/**
  * @brief  Release WWDG2 reset
  * @rmtoll WWDG2         WWDG2RST         LL_RCC_WWDG2_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_WWDG2_ReleaseReset(void)
{
  CLEAR_BIT(RCC->WWDG2CFGR, RCC_WWDG2CFGR_WWDG2RST);
}
#endif /* RCC_WWDG2CFGR_WWDG2LPEN */

#if defined(RCC_I3C4CFGR_I3C4RST)
/**
  * @brief  Release I3C4 reset
  * @rmtoll I3C4         I3C4RST         LL_RCC_I3C4_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I3C4_ReleaseReset(void)
{
  CLEAR_BIT(RCC->I3C4CFGR, RCC_I3C4CFGR_I3C4RST);
}
#endif /* RCC_I3C4CFGR_I3C4RST */

/**
  * @brief  Release LPTIM4 reset
  * @rmtoll LPTIM4         LPTIM4RST         LL_RCC_LPTIM4_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM4_ReleaseReset(void)
{
  CLEAR_BIT(RCC->LPTIM4CFGR, RCC_LPTIM4CFGR_LPTIM4RST);
}

/**
  * @brief  Release LPTIM5 reset
  * @rmtoll LPTIM5         LPTIM5RST         LL_RCC_LPTIM5_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM5_ReleaseReset(void)
{
  CLEAR_BIT(RCC->LPTIM5CFGR, RCC_LPTIM5CFGR_LPTIM5RST);
}

#if defined(RCC_I2C8CFGR_I2C8RST)
/**
  * @brief  Release I2C8 reset
  * @rmtoll I2C8         I2C8RST         LL_RCC_I2C8_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_I2C8_ReleaseReset(void)
{
  CLEAR_BIT(RCC->I2C8CFGR, RCC_I2C8CFGR_I2C8RST);
}
#endif /* RCC_I2C8CFGR_I2C8RST*/

/**
  * @brief  Release LPTIM3 reset
  * @rmtoll LPTIM3         LPTIM3RST         LL_RCC_LPTIM3_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPTIM3_ReleaseReset(void)
{
  CLEAR_BIT(RCC->LPTIM3CFGR, RCC_LPTIM3CFGR_LPTIM3RST);
}

