zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_bus.h
#if defined(RCC_SPI8CFGR_SPI8RST)
/**
  * @brief  Release SPI8 reset
  * @rmtoll SPI8         SPI8RST         LL_RCC_SPI8_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SPI8_ReleaseReset(void)
{
  CLEAR_BIT(RCC->SPI8CFGR, RCC_SPI8CFGR_SPI8RST);
}
#endif /* RCC_SPI8CFGR_SPI8RST */

/**
  * @brief  Release LPUART1 reset
  * @rmtoll LPUART1         LPUART1RST         LL_RCC_LPUART1_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LPUART1_ReleaseReset(void)
{
  CLEAR_BIT(RCC->LPUART1CFGR, RCC_LPUART1CFGR_LPUART1RST);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_OTHERS Others
  * @{
  */
/**
  * @brief  Enable ETR  peripheral clock
  * @rmtoll ETR         ETREN         LL_RCC_ETR_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ETR_EnableClock(void)
{
  SET_BIT(RCC->ETRCFGR, RCC_ETRCFGR_ETREN);
}

/**
  * @brief  Enable SYSCPU1  peripheral clock
  * @rmtoll SYSCPU1         SYSCPU1EN         LL_RCC_SYSCPU1_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SYSCPU1_EnableClock(void)
{
  SET_BIT(RCC->SYSCPU1CFGR, RCC_SYSCPU1CFGR_SYSCPU1EN);
}
#if defined(RCC_IS2MCFGR_IS2MEN)
/**
  * @brief  Enable IS2M  peripheral clock
  * @rmtoll IS2M         IS2MEN         LL_RCC_IS2M_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IS2M_EnableClock(void)
{
  SET_BIT(RCC->IS2MCFGR, RCC_IS2MCFGR_IS2MEN);
}
#endif /* RCC_IS2MCFGR_IS2MEN */
#if defined(RCC_LVDSCFGR_LVDSEN)
/**
  * @brief  Enable LVDS  peripheral clock
  * @rmtoll LVDS         LVDSEN         LL_RCC_LVDS_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LVDS_EnableClock(void)
{
  SET_BIT(RCC->LVDSCFGR, RCC_LVDSCFGR_LVDSEN);
}
#endif /* RCC_LVDSCFGR_LVDSEN */
#if defined(RCC_CCICFGR_CCIEN)
/**
  * @brief  Enable CCI  peripheral clock
  * @rmtoll CCI         CCIEN         LL_RCC_CCI_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CCI_EnableClock(void)
{
  SET_BIT(RCC->CCICFGR, RCC_CCICFGR_CCIEN);
}
#endif /* RCC_CCICFGR_CCIEN */

#if defined(RCC_TMPSENSCFGR_TMPSENSEN)
/**
  * @brief  Enable TMPSENS  peripheral clock
  * @rmtoll TMPSENS         TMPSENSEN         LL_RCC_TMPSENS_EnableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TMPSENS_EnableClock(void)
{
  SET_BIT(RCC->TMPSENSCFGR, RCC_TMPSENSCFGR_TMPSENSEN);
}
#endif /* RCC_TMPSENSCFGR_TMPSENSEN */

/**
  * @brief  Disable ETR  peripheral clock
  * @rmtoll ETR         ETREN         LL_RCC_ETR_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ETR_DisableClock(void)
{
  CLEAR_BIT(RCC->ETRCFGR, RCC_ETRCFGR_ETREN);
}

/**
  * @brief  Disable SYSCPU1  peripheral clock
  * @rmtoll SYSCPU1         SYSCPU1EN         LL_RCC_SYSCPU1_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SYSCPU1_DisableClock(void)
{
  CLEAR_BIT(RCC->SYSCPU1CFGR, RCC_SYSCPU1CFGR_SYSCPU1EN);
}
#if defined(RCC_IS2MCFGR_IS2MEN)
/**
  * @brief  Disable IS2M  peripheral clock
  * @rmtoll IS2M         IS2MEN         LL_RCC_IS2M_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IS2M_DisableClock(void)
{
  CLEAR_BIT(RCC->IS2MCFGR, RCC_IS2MCFGR_IS2MEN);
}
#endif /* RCC_IS2MCFGR_IS2MEN */

#if defined(RCC_LVDSCFGR_LVDSEN)
/**
  * @brief  Disable LVDS  peripheral clock
  * @rmtoll LVDS         LVDSEN         LL_RCC_LVDS_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LVDS_DisableClock(void)
{
  CLEAR_BIT(RCC->LVDSCFGR, RCC_LVDSCFGR_LVDSEN);
}
#endif /* RCC_LVDSCFGR_LVDSEN */
#if defined(RCC_CCICFGR_CCIEN)
/**
  * @brief  Disable CCI  peripheral clock
  * @rmtoll CCI         CCIEN         LL_RCC_CCI_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CCI_DisableClock(void)
{
  CLEAR_BIT(RCC->CCICFGR, RCC_CCICFGR_CCIEN);
}
#endif /* RCC_CCICFGR_CCIEN */

#if defined(RCC_TMPSENSCFGR_TMPSENSEN)
/**
  * @brief  Disable TMPSENS  peripheral clock
  * @rmtoll TMPSENS         TMPSENSEN         LL_RCC_TMPSENS_DisableClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TMPSENS_DisableClock(void)
{
  CLEAR_BIT(RCC->TMPSENSCFGR, RCC_TMPSENSCFGR_TMPSENSEN);
}
#endif /* RCC_TMPSENSCFGR_TMPSENSEN */

/**
  * @brief  Enable ETR peripheral clocks enable during CSleep mode
  * @rmtoll ETR         ETRLPEN         LL_RCC_ETR_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ETR_EnableClockSleep(void)
{
  SET_BIT(RCC->ETRCFGR, RCC_ETRCFGR_ETRLPEN);
}

/**
  * @brief  Enable SYSCPU1 peripheral clocks enable during CSleep mode
  * @rmtoll SYSCPU1         SYSCPU1LPEN         LL_RCC_SYSCPU1_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SYSCPU1_EnableClockSleep(void)
{
  SET_BIT(RCC->SYSCPU1CFGR, RCC_SYSCPU1CFGR_SYSCPU1LPEN);
}
#if defined(RCC_IS2MCFGR_IS2MLPEN)
/**
  * @brief  Enable IS2M peripheral clocks enable during CSleep mode
  * @rmtoll IS2M         IS2MLPEN         LL_RCC_IS2M_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IS2M_EnableClockSleep(void)
{
  SET_BIT(RCC->IS2MCFGR, RCC_IS2MCFGR_IS2MLPEN);
}
#endif /* RCC_IS2MCFGR_IS2MLPEN */

#if defined(RCC_LVDSCFGR_LVDSLPEN)
/**
  * @brief  Enable LVDS peripheral clocks enable during CSleep mode
  * @rmtoll LVDS         LVDSLPEN         LL_RCC_LVDS_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LVDS_EnableClockSleep(void)
{
  SET_BIT(RCC->LVDSCFGR, RCC_LVDSCFGR_LVDSLPEN);
}
#endif /* RCC_LVDSCFGR_LVDSLPEN */
#if defined(RCC_CCICFGR_CCILPEN)
/**
  * @brief  Enable CCI peripheral clock during CSleep mode
  * @rmtoll CCI         CCILPEN         LL_RCC_CCI_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CCI_EnableClockSleep(void)
{
  SET_BIT(RCC->CCICFGR, RCC_CCICFGR_CCILPEN);
}
#endif /* RCC_CCICFGR_CCILPEN */

#if defined(RCC_TMPSENSCFGR_TMPSENSLPEN)
/**
  * @brief  Enable TMPSENS peripheral clocks enable during CSleep mode
  * @rmtoll TMPSENS         TMPSENSLPEN         LL_RCC_TMPSENS_EnableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TMPSENS_EnableClockSleep(void)
{
  SET_BIT(RCC->TMPSENSCFGR, RCC_TMPSENSCFGR_TMPSENSLPEN);
}
#endif /* RCC_TMPSENSCFGR_TMPSENSLPEN */

/**
  * @brief  Disable ETR peripheral clocks during CSleep mode
  * @rmtoll ETR         ETRLPEN         LL_RCC_ETR_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ETR_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->ETRCFGR, RCC_ETRCFGR_ETRLPEN);
}

/**
  * @brief  Disable SYSCPU1 peripheral clocks during CSleep mode
  * @rmtoll SYSCPU1         SYSCPU1LPEN         LL_RCC_SYSCPU1_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SYSCPU1_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->SYSCPU1CFGR, RCC_SYSCPU1CFGR_SYSCPU1LPEN);
}
#if defined(RCC_IS2MCFGR_IS2MLPEN)
/**
  * @brief  Disable IS2M peripheral clocks during CSleep mode
  * @rmtoll IS2M         IS2MLPEN         LL_RCC_IS2M_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IS2M_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->IS2MCFGR, RCC_IS2MCFGR_IS2MLPEN);
}
#endif /* RCC_IS2MCFGR_IS2MLPEN */
#if defined(RCC_LVDSCFGR_LVDSLPEN)
/**
  * @brief  Disable LVDS peripheral clocks during CSleep mode
  * @rmtoll LVDS         LVDSLPEN         LL_RCC_LVDS_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LVDS_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->LVDSCFGR, RCC_LVDSCFGR_LVDSLPEN);
}
#endif /* RCC_LVDSCFGR_LVDSLPEN */
#if defined(RCC_CCICFGR_CCILPEN)
/**
  * @brief  Disable CCI peripheral clocks during CSleep mode
  * @rmtoll CCI         CCILPEN         LL_RCC_CCI_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CCI_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->CCICFGR, RCC_CCICFGR_CCILPEN);
}
#endif /* RCC_CCICFGR_CCILPEN */

