zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_bus.h
#if defined(RCC_TMPSENSCFGR_TMPSENSLPEN)
/**
  * @brief  Disable TMPSENS peripheral clocks during CSleep mode
  * @rmtoll TMPSENS         TMPSENSLPEN         LL_RCC_TMPSENS_DisableClockSleep
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TMPSENS_DisableClockSleep(void)
{
  CLEAR_BIT(RCC->TMPSENSCFGR, RCC_TMPSENSCFGR_TMPSENSLPEN);
}
#endif /* RCC_TMPSENSCFGR_TMPSENSLPEN */
#if defined(RCC_IS2MCFGR_IS2MRST)
/**
  * @brief  Assert IS2M reset
  * @rmtoll IS2M         IS2MRST         LL_RCC_IS2M_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IS2M_ForceReset(void)
{
  SET_BIT(RCC->IS2MCFGR, RCC_IS2MCFGR_IS2MRST);
}
#endif /* RCC_IS2MCFGR_IS2MRST */
#if defined(RCC_LVDSCFGR_LVDSRST)
/**
  * @brief  Assert LVDS reset
  * @rmtoll LVDS         LVDSRST         LL_RCC_LVDS_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LVDS_ForceReset(void)
{
  SET_BIT(RCC->LVDSCFGR, RCC_LVDSCFGR_LVDSRST);
}
#endif /* RCC_LVDSCFGR_LVDSRST */
#if defined(RCC_CCICFGR_CCIRST)
/**
  * @brief  Assert CCI reset
  * @rmtoll CCI         CCIRST         LL_RCC_CCI_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CCI_ForceReset(void)
{
  SET_BIT(RCC->CCICFGR, RCC_CCICFGR_CCIRST);
}
#endif /* RCC_CCICFGR_CCIRST */

#if defined(RCC_TMPSENSCFGR_TMPSENSRST)
/**
  * @brief  Assert TMPSENS reset
  * @rmtoll TMPSENS         TMPSENSRST         LL_RCC_TMPSENS_ForceReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TMPSENS_ForceReset(void)
{
  SET_BIT(RCC->TMPSENSCFGR, RCC_TMPSENSCFGR_TMPSENSRST);
}
#endif /* RCC_TMPSENSCFGR_TMPSENSRST */
#if defined(RCC_IS2MCFGR_IS2MRST)
/**
  * @brief  Release IS2M reset
  * @rmtoll IS2M         IS2MRST         LL_RCC_IS2M_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IS2M_ReleaseReset(void)
{
  CLEAR_BIT(RCC->IS2MCFGR, RCC_IS2MCFGR_IS2MRST);
}
#endif /* RCC_IS2MCFGR_IS2MRST */
#if defined(RCC_LVDSCFGR_LVDSRST)
/**
  * @brief  Release LVDS reset
  * @rmtoll LVDS         LVDSRST         LL_RCC_LVDS_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LVDS_ReleaseReset(void)
{
  CLEAR_BIT(RCC->LVDSCFGR, RCC_LVDSCFGR_LVDSRST);
}
#endif /* RCC_LVDSCFGR_LVDSRST */
#if defined(RCC_CCICFGR_CCIRST)
/**
  * @brief  Release CCI reset
  * @rmtoll CCI         CCIRST         LL_RCC_CCI_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CCI_ReleaseReset(void)
{
  CLEAR_BIT(RCC->CCICFGR, RCC_CCICFGR_CCIRST);
}
#endif /* RCC_CCICFGR_CCIRST */

#if defined(RCC_TMPSENSCFGR_TMPSENSRST)
/**
  * @brief  Release TMPSENS reset
  * @rmtoll TMPSENS         TMPSENSRST         LL_RCC_TMPSENS_ReleaseReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TMPSENS_ReleaseReset(void)
{
  CLEAR_BIT(RCC->TMPSENSCFGR, RCC_TMPSENSCFGR_TMPSENSRST);
}
#endif /* RCC_TMPSENSCFGR_TMPSENSRST */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#endif /* RCC */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32MP2xx_LL_BUS_H */
